{
  "data": {
    "dojo4/2015-complete-boulder-voter-guide": {
      "author": "emily@dojo4.com",
      "title": "2015 Complete Boulder Voter Guide",
      "published_at": "2015-10-20 14:07:06 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>DOJO4 is above all a community, and we love where we live so - we vote!  We want you to vote, too, and in the hopes of making it easier and thus more likely that you will, I’m sharing a voter guide that I wrote up for friends and family.  These recommendations represent only my own views, but I’m also including some opposing views from my friend &amp; colleague <a href=\"https://twitter.com/markgelband\">Mark Gelband</a>.  While we have the same endgame: getting Boulder off fossil fuels ASAP, Mark and I stand on opposite sides of the municipalization debate (he’s anti, I’m pro) and that one issue determines much of where our views diverge on the candidates and ballot measures below.</p>\n\n<p><strong>One place we agree wholeheartedly is NO on 300/301.</strong></p>\n\n<p><a href=\"http://oneboulder.org/\"><img src='/ro/dojo4/2015-complete-boulder-voter-guide/assets/b.png' alt=\"One-Boulder-Banner-Billboard-Sign-1024x306.png\" /></a></p>\n\n<p>300 is the “neighborhood rights initiative” (aka “gated community act”). It would give 10% of the people in a hood - and there are 66 tiny proposed enclaves - the right to put any land use or zoning changes affecting that neighborhood up for a vote. As <a href=\"http://oneboulder.org/david-abelson-neighborhood-ballot-issue-unconstitutional/\">one opponent</a> put it, “The ironic part is that Livable Boulder states on its website that the initiatives were ‘born out of a concern for democracy.’ Yet, the ‘neighborhood right to vote’ initiative limits the thing it purports to support — community engagement. Only a small fraction of the city electorate would effectively be granted a veto power over a valid council action. That approach does not foster greater democracy; instead, it disenfranchises the rest of the voters.”  A great article in City Lab sums it up as “<a href=\"http://www.citylab.com/housing/2015/10/they-are-coming-for-our-neighborhoods/408994/\">Mega-NIMBYism at work</a>.”</p>\n\n<p>I am personally not a fan of many decisions the planning department has made on new developments, or the say I had in some of the bigger eye-sores going in.  I also agree with Mark that our current land use and zoning rules are in desperate need of an overhaul.  But if you think getting a permit for your granny unit above the garage is expensive and difficult now, just wait until a handful of your neighbors can force a vote on it!</p>\n\n<p>So, 300 is kinda see through if you actually read it, but 301 seems to be getting a little more traction because it continues the long standing Boulder meme of the “evil developer.” I mean, <em>of course</em> development should pay it’s own way. Aside from the fact that Boulder already has some of the most costly fees for development in the nation - <a href=\"http://oneboulder.org/david-biek-no-on-300-and-301/\">David Biek covers those here</a> - and we just added a $9/sq ft. linkage fee to subsidize affordable housing, Livable Boulder has gravely misrepresented the inevitable outcomes of 301’s passage.</p>\n\n<p>To summarize, development would stop in it’s tracks (yeah, actually our City Manager has said that flat out - no more permits until the litigious dust settles).  Let me rephrase: <strong>no more housing units would be added to our city</strong>.  That means that current homeowners’ property values <em>and property taxes</em> will skyrocket (yes, beyond their current altitude); kids who grew up here will have to leave to be able to afford homes; teachers and service workers will have to move further out and commute in; retirees on fixed incomes wouldn’t be able to afford their property taxes on a fixed income; etc. etc. etc.</p>\n\n<p>[PAUSE, DEEP BREATH.]</p>\n\n<p>By now you’re thinking, “<em>It seems like everyone I talk to is against those measures (<a href=\"http://oneboulder.org/daily-camera-editorial-no-on-300-301/\">even The Daily Camera</a>, which is no friend of the planning department); I’m sure they’re too extreme to pass; I don’t really need to go to all the trouble of filling out the ballot that someone hand delivered to my very doorstep and will pick up after I’ve marked a few dots and signed it.</em>”</p>\n\n<p>Well not so fast, buster!  <strong>The folks who put these measures on the ballot represent the faction of Boulder that actually votes.</strong> Doesn’t matter if they’re the minority if they’re the only ones who bother to vote. To reference the <em>fucking</em> awesome citizen, <a href=\"https://twitter.com/boonrs?lang=en\">Becky Boone</a> — that woman who got in hot water with some of Boulder’s more conservative faction earlier this year for <a href=\"https://youtu.be/Mme2iqk1IYU\">saying “fuck” a lot</a> while trying to get more people in Boulder to vote — in our last local election (2013) only 1/3 of Boulder voted.  : (  Sad face : (  And the majority who do vote are over 40 and own their own homes (while the majority of Boulder’s residents are under forty and rent).</p>\n\n<p><img src='/ro/dojo4/2015-complete-boulder-voter-guide/assets/c.jpeg' alt=\"tumblr_nnoiy8I53b1uu6cgso1_1280.jpg\" /></p>\n\n<p>So, here’s how I’m voting — hope it’s useful to you!</p>\n\n<p><strong>CITY COUNCIL</strong></p>\n\n<p>There are 5 open spots and 19 candidates.  These five are the ones that I think have the best chance at both getting elected and effectively opposing 300/301 and promoting affordable housing, climate action, open space and the other issues I care most about locally.</p>\n\n<ol>\n  <li>\n    <p><strong>Morzel</strong> - has been an amazing advocate for the mobile home owners I’ve been organizing to help this year, plus she’s a geologist, mother of three boys and a zero waste hero in her own home. Although I don’t agree with everything she’s done in her long tenure, I think she should stay on council because she will continue to be a strong voice for open space, climate, and social justice issues.</p>\n  </li>\n  <li>\n    <p><strong>Rigler</strong> - is younger than most candidates. He is a strong environmental advocate (he used to work for Al Gore on climate change), has gotten involved in Boulder by serving on the Transportation Advisory Board, and works as spokesperson for Naropa. He would bring a very visceral sense of what it is like to try to get by in Boulder as a renter. Half of our residents rent, while I believe that every other council member is a homeowner.</p>\n  </li>\n  <li>\n    <p><strong>Brockett</strong> - Aaron is a younger family guy who lives in North Boulder’s Holiday neighborhood. Aaron is one of the “we should have more density where it makes sense, such as along transportation corridors and hubs” voices. Although I’m not necessarily a true believer of the “density equals affordability” mantra, I do think Aaron is a really smart, rational, and independent thinker and very much has his heart in the right place. He’ll be a really really great addition to council.</p>\n  </li>\n  <li>\n    <p><strong>Plass</strong> - Tim is running for his second term on council and has really proven himself as a bridge-builder and approaches decisions on council not as an ideologue, but as a reasonable person who wants the best for Boulder. The bike community has recently embraced Tim and he also is a strong advocate for Boulder’s municipalization efforts, local food investment, and smart growth.</p>\n  </li>\n  <li>\n    <p><strong>Jones</strong> - Zan is a terrific public servant and is a strong champion for progressive values, especially including the environment and climate. Zan is also the Executive Director for Ecocycle. She’s an all-around great person and is always a calm, reasonable, and intelligent voice on important issues.</p>\n  </li>\n</ol>\n\n<p>Note: Some of this text was lifted from my most favorite candidate of all, <a href=\"http://\">Steve Fenberg</a>.</p>\n\n<p>Mark will probably vote for Riggler, Yates, Burton, Cote and maybe Spinrad.</p>\n\n<p><strong>ALPHABET SOUP</strong></p>\n\n<p>2B — Yes\n2C — Yes\n2D — Yes\n2N — Yes\n2O — Yes\n2P -— Yes \n2Q — Yes\n2R — Yes\n300 — NO\n301 — NO\n3A — Yes\n5B — Yes\nBB — Yes</p>\n\n<p>For those who want to read more about the ballot measures:</p>\n\n<p><strong>Yes on 2B, C &amp; D</strong> — Tax extensions + one sales tax increase to fund open space and transportation and the general fund.  Here’s a brief summary from Better Boulder on <a href=\"http://betterboulder.com/vote-yes-on-2b-2c-and-2d/\">why to vote YES on 2B, 2C and 2D</a>.</p>\n\n<p><strong>YES on 2N</strong> — This is a fraught attempt at regulating AirB&amp;B and VRBO style rentals, which supplement the income of thousands of Boulder residents and enable them to actually afford to live here.  The short story is: if this doesn’t pass, all short-term rentals will become illegal.  If it does pass, the fight goes on and the dumber parts of this measure will surely be challenged in court, so think of it as an interim step.</p>\n\n<p><strong>YES on 2P!!!</strong>  I am so disappointed to see the ambivalent coverage this is getting in the Camera.  In short, ALL of the efforts that Boulder makes across dozens of programs in dozens of departments — including EVERYTHING my partner works on to <a href=\"https://bouldercolorado.gov/climate\">transition Boulder to carbon-free power sources</a> — will be severely curtailed if this doesn’t pass.</p>\n\n<p><strong>Yes on 2O</strong> — Like 2P, this merely extends existing taxes on electricity use – one that replaced the old franchise fee and funds the general fund (2O), and the other funds city climate action programs (2P). <em>This is not a vote on municipalization – however you feel about that, these two deserve a yes.</em>  (<strong>Mark would disagree, and say No on 2O</strong> because “it would send a strong message to council on the $15M + already wasted on lawyers and consultants and not 1kWh of local or renewable energy.”)</p>\n\n<p><strong>Yes on 2Q</strong> — From what I understand, this just modernizes the library commission and is basically an administrative clarification and there really isn’t any reason to oppose it.</p>\n\n<p><strong>Yes on 2R</strong> — This is an interesting one. (From the Daily Camera: This measure asks: Should City Council members get a $10,000 annual salary, which will increase with inflation, in addition to the per-meeting pay they get now, and health benefits equivalent to those received by city employees? Council members currently earn $206.97 per meeting for up to 52 meetings per year, with the maximum pay being $10,762.44. Adding the base salary would put City Council members above $20,000 a year.</p>\n\n<p><em>What supporters say</em>: Offering a higher salary and health insurance will make it possible for people from more diverse economic backgrounds to serve on City Council. Adding a base salary also reflects the large amount of work council members do outside of meetings.</p>\n\n<p><em>What opponents say</em>: Serving on council should be essentially a volunteer position, and raising the pay moves it closer to being a job. Others believe the pay increase isn’t large enough to make a difference in the types of candidates who can afford to serve.</p>\n\n<p><em>What I say</em>: it’s not enough of a pay raise, and obviously they should have access to the same health benefits city employees get.  The idea that serving on City Council should be a volunteer position is flagrantly classist and merely ensures that only people who can afford not to work for a living could even consider running, and that thus our representation will continue to be drawn only from the wealthiest among us.</p>\n\n<p><strong>YES on BB</strong> — This is a statewide ballot measure that is on the ballot because of the ridiculousness of TABOR.  If it passes, the state keeps tax $$ it has <em>already collected</em> from the marijuana industry and spends $40million on schools and $12million on marijuana education.  If it doesn’t pass, most of the money goes back to growers and sellers, and regular CO taxpayers get about an $8 refund - woohoo.</p>\n\n<p><strong>Yes on 5B</strong> — There will be more and more wildfires to come as the climate heats up. Adding $0.004 per dollar to property tax values to pay for the fire department to protect their homes seems more than reasonable, it seems prudent!</p>\n\n<p><strong>BOULDER VALLEY SCHOOL DISTRICT</strong></p>\n\n<p>Only two are running opposed.  Between Barge, Femmer and Gebhardt, I’d pick:  <strong>Barge, without a doubt</strong>.  His wife is a teacher (currently), and his answers to the <a href=\"http://www.dailycamera.com/local-election-news/ci_28946902/voter-guide-2015-boulder-and-broomfield-counties\">Daily Camera questionnaire</a> were the best among his competitors. Several of my friends know him personally, and like him a lot.</p>\n\n<p>And between McCloskey and Benford, I’d pick: <strong>McCloskey!!</strong>.  When asked about the biggest problem our district faces he answered equity while Benford discussed student achievement.  McCloskey has been a teacher, and Benford seems to be a bit of a firebrand who holds less than mainstream views. I’ve heard that she’s seen as someone who attacks the superintendant and the teacher’s union repeatedly.</p>\n\n<p><strong>IT’S NOT TOO LATE TO REGISTER TO VOTE!</strong></p>\n\n<p>As a reminder, everyone’s ballots arrive by mail (many have already arrived) and you can either mail them in or <a href=\"http://www.bouldercounty.org/elections/polling/pages/default.aspx\">drop them off</a>.  And, <a href=\"https://www.registerincolorado.org/\">it’s not even too late to register to vote, change your address or get a replacement ballot</a>!  Just go online by the 26th of this month if you’d like your ballot mailed to you.</p>\n\n<p><strong>NOW GO VOTE!</strong></p>\n\n<p><img src='/ro/dojo4/2015-complete-boulder-voter-guide/assets/d.jpeg' alt=\"doorsixteen_lisacongdon_VOTE.jpg\" /></p>\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/2015-complete-boulder-voter-guide/assets/b.png",
          "path": "dojo4/2015-complete-boulder-voter-guide/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 800,
            "height": 345
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/2015-complete-boulder-voter-guide/assets/c.jpeg",
          "path": "dojo4/2015-complete-boulder-voter-guide/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 599,
            "height": 451
          },
          "src": null
        },
        "d.jpeg": {
          "url": "/ro/dojo4/2015-complete-boulder-voter-guide/assets/d.jpeg",
          "path": "dojo4/2015-complete-boulder-voter-guide/assets/d.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 600,
            "height": 300
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/2015-complete-boulder-voter-guide",
        "type": "dojo4",
        "id": "2015-complete-boulder-voter-guide",
        "urls": [
          "/ro/dojo4/2015-complete-boulder-voter-guide/assets/b.png",
          "/ro/dojo4/2015-complete-boulder-voter-guide/assets/c.jpeg",
          "/ro/dojo4/2015-complete-boulder-voter-guide/assets/d.jpeg",
          "/ro/dojo4/2015-complete-boulder-voter-guide/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/2015-complete-boulder-voter-guide",
          "prev": "dojo4/love-and-code-rocky-mountain-ruby-conference-presentation",
          "next": "dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party"
        }
      }
    },
    "dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party": {
      "author": "emily@dojo4.com",
      "title": "Awesomesauce & Awesome Sounds @ Awesome Boulder Party",
      "published_at": "2015-10-21 16:42:05 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/b.jpeg' alt=\"awesome.jpg\" /></p>\n\n<p>One of the best things about being on the Board of <a href=\"http://www.awesomeboulder.org/\">Awesome Boulder Foundation</a> is the annual celebration at which we:</p>\n\n<ul>\n  <li>hang out</li>\n  <li>eat good food</li>\n  <li>drink some beers</li>\n  <li>visit with some of <a href=\"http://www.awesomefoundation.org/en/chapters/boulder\">the past year’s grantees</a></li>\n  <li>drink some beers</li>\n</ul>\n\n<p>This year’s bash was especially delicious, thanks to our favorite pizza joint, <a href=\"http://localeboulder.com/\">Pizzeria Locale</a>, which managed to donate 30 pies to our event in the midst of their Friday evening rush. Thank you pizza gods!</p>\n\n<p><img src='/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/c.jpeg' alt=\"pizzerialocale.jpg\" /></p>\n\n<p>A huge shout out also goes to Joel of <a href=\"http://www.blackswansounds.com/\">Black Swan Sounds</a> who brought out the booty-shakin’ soul in all of us.</p>\n\n<p><img src='/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/d.jpeg' alt=\"blackswan.jpg\" /></p>\n\n<p>If you’re someone doing cool shit in Boulder, it’s super easy to <a href=\"http://www.awesomefoundation.org//submissions/new\">apply</a> for an Awesome Boulder grant. $1,000. Submission deadline’s once/month. Make Boulder even more awesome, and then you can come to next year’s party! : )</p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/b.jpeg",
          "path": "dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "png",
            "width": 1462,
            "height": 986
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/c.jpeg",
          "path": "dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 417,
            "height": 51
          },
          "src": null
        },
        "d.jpeg": {
          "url": "/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/d.jpeg",
          "path": "dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/d.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 500,
            "height": 500
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party",
        "type": "dojo4",
        "id": "awesomesauce-and-awesome-sounds-at-awesome-boulder-party",
        "urls": [
          "/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/b.jpeg",
          "/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/c.jpeg",
          "/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/assets/d.jpeg",
          "/ro/dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party",
          "prev": "dojo4/2015-complete-boulder-voter-guide",
          "next": "dojo4/where-can-we-meet"
        }
      }
    },
    "dojo4/where-can-we-meet": {
      "author": "mark@dojo4.com",
      "title": "Where Can We Meet?",
      "published_at": "2015-10-22 19:06:15 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/where-can-we-meet/assets/b.jpeg' alt=\"ello-xhdpi-c3c5401c.jpg\" /> <small>Photo by @KellyDelay <a href=\"ello.co/kellydelay\">ello.co/kellydelay</a></small></p>\n\n<p>My father has experienced an inordinate amount of loss in his life. He is a holocaust survivor - born in Vienna, his home stolen as a child, escaped to Cuba, made it to Newark, NJ. At 12 when he got home from school, he found his mother dead of a stroke on the kitchen floor. His father had a heart attack and died next to him in bed when my dad was 24, home from medical school, studying to become a cardiologist.</p>\n\n<p>Cruel irony.</p>\n\n<p>His wife of 25 years - my mother - died when she was 47.</p>\n\n<p>People who’ve met my father in the past 20 years often tell me what a kind and gentle man he is. Yes, no doubt, but I always think, you weren’t raised by that prick. Sometimes I might say it. Explain how his mesmerizing blue eyes could be like ice, his silent disapproval a Bruce Lee blow - so compact, precise, piercing.</p>\n\n<p>Of my two brothers and I, I most physically resemble my mother. The only times I saw them really fight was in discussing how I should be punished, my mother almost always giving me the unconditional love it’s nice to think all children deserve. As my 17 year old son says to me based on my descriptions of my youth: “you were a bad kid, dad.”</p>\n\n<p>Truth. And these truths led to some deep tensions between my father and me.</p>\n\n<p>After my mom passed, I bought a round-the-world ticket for $1,700, took another 10 grand I had saved and left to discover a piece of me. I was 23. When I returned, one of my father’s closest friends told me: “your dad talks about you, your trip with such pride. He really identifies with you in ways you might not imagine.”</p>\n\n<p>Like most young men, I wanted to hear it from him. Wanted to know the ways he felt he identified with me. So much so - I wanted the journey of self I was beginning then to include him.</p>\n\n<p>He gave a hint of it once briefly - “Rich or poor,” he said, “it’s good to have money, but it’s way better to be rich with life. And you’re lucky Mark, even when you haven’t had a pot to piss in, you’ve been rich with life. You live so freely. I’ve always wished I could do what you do.”</p>\n\n<p>And I wanted more of that - to ask him about his youth, learn about his parents whom I never knew, about leaving Vienna as a child, his fears, his triumphs and disappointments, his deeper views on life and living and love. But he couldn’t really meet me there, and I didn’t want to push.</p>\n\n<p>I appreciated the smallest connections.</p>\n\n<p>During those years - 25 years ago, I remember consciously thinking that it’s better to have some connection than no connection. Meet him where it feels comfortable to him and maybe he will open up.</p>\n\n<p>I would bring a Cuban cigar to our regular dinners. We would talk Dolphins and women, weather and politics a bit. Rarely did we go much deeper than that. I’d bust out a Cuban after dinner, and we’d walk Lincoln Road mall in relative silence - sharing the quiet company and the joy of a good cigar.</p>\n\n<p>One night I joined him and his friend Herbie and Barbara, Herbie’s new girlfriend at Pacific Time. It was an early successful place on Lincoln Rd. We ate there several times with my mother’s parents before they passed. Herbie and my father were great friends from high school, and I learned that Barbara was the widow of one of their other good friends from those days.</p>\n\n<p>It was a great evening. I asked Herbie how he met my father. He said they went to different middle schools but had overlapping peer groups. A girl in that group had a big party and my father wasn’t invited. He said my dad rode his bike to the girl’s house and threw a rock through the window. All the kids ran outside to see who did it, and my father was there yelling.</p>\n\n<p>I smiled at that, felt connected in a new and different way.</p>\n\n<p>Twenty or so minutes after I got home that night, my father called. It was a little unusual.</p>\n\n<p>“You okay,” I asked?</p>\n\n<p>“I’m a little sad,” he said.</p>\n\n<p>“What’s up?”</p>\n\n<p>“I’m jealous of Herbie a bit. Not that Barbara is that attractive. I never thought she was - physically, but they have a shared history. He’s just lucky to have that. I don’t think I’ll ever have that again. Dating at this age is hard. I really miss your mom.”</p>\n\n<p>“I miss her too,” I said.</p>\n\n<p>His vulnerability was immensely beautiful to me that night and right now as I type this. It opened something deeper and more special than we had ever shared.</p>\n\n<p>And lately I’ve been thinking about how I often fail to accept others where they are emotionally, that it inhibits my ability to be vulnerable, my ability to communicate and affect change and grow. That what I tried to get from my father was only available for the gentle years of accepting him where he was, meeting him where he felt comfortable.</p>\n\n<p>Not 100% sure how this applies to business, but in its basest form someone says: where can we meet. Think about it. Alpine Modern, The Yellow Deli, Ozo, your house, mine (mine might be cooler and more controversial), The Cup, Boxcar, wherever, whatever. Your choice. Think about it.</p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/where-can-we-meet/assets/b.jpeg",
          "path": "dojo4/where-can-we-meet/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1500,
            "height": 1000
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/where-can-we-meet",
        "type": "dojo4",
        "id": "where-can-we-meet",
        "urls": [
          "/ro/dojo4/where-can-we-meet/assets/b.jpeg",
          "/ro/dojo4/where-can-we-meet/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/where-can-we-meet",
          "prev": "dojo4/awesomesauce-and-awesome-sounds-at-awesome-boulder-party",
          "next": "dojo4/boulder-voter-guide"
        }
      }
    },
    "dojo4/boulder-voter-guide": {
      "author": "emily@dojo4.com",
      "title": "Boulder Voter Guide",
      "published_at": "2015-10-26 18:06:56 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>DOJO4 is above all a community, and we love where we live so - we vote!  We want you to vote, too, and in the hopes of making it easier and thus more likely that you will, I’m sharing a voter guide that I wrote up for friends and family.  These recommendations represent only my own views, but I’m also including some opposing views from my friend &amp; colleague <a href=\"https://twitter.com/markgelband\">Mark Gelband</a>.  While we have the same endgame: getting Boulder off fossil fuels ASAP, Mark and I stand on opposite sides of the municipalization debate (he’s anti, I’m pro) and that one issue determines much of where our views diverge on the candidates and ballot measures below.</p>\n\n<p><strong>One place we agree wholeheartedly is NO on 300/301.</strong></p>\n\n<p><a href=\"http://oneboulder.org/\"><img src='/ro/dojo4/boulder-voter-guide/assets/b.png' alt=\"One-Boulder-Banner-Billboard-Sign-1024x306.png\" /></a></p>\n\n<p>300 is the “neighborhood rights initiative” (aka “gated community act”). It would give 10% of the people in a hood - and there are 66 tiny proposed enclaves - the right to put any land use or zoning changes affecting that neighborhood up for a vote. As <a href=\"http://oneboulder.org/david-abelson-neighborhood-ballot-issue-unconstitutional/\">one opponent</a> put it, “The ironic part is that Livable Boulder states on its website that the initiatives were ‘born out of a concern for democracy.’ Yet, the ‘neighborhood right to vote’ initiative limits the thing it purports to support — community engagement. Only a small fraction of the city electorate would effectively be granted a veto power over a valid council action. That approach does not foster greater democracy; instead, it disenfranchises the rest of the voters.”  A great article in City Lab sums it up as “<a href=\"http://www.citylab.com/housing/2015/10/they-are-coming-for-our-neighborhoods/408994/\">Mega-NIMBYism at work</a>.”</p>\n\n<p>I am personally not a fan of many decisions the planning department has made on new developments, or the say I had in some of the bigger eye-sores going in.  I also agree with Mark that our current land use and zoning rules are in desperate need of an overhaul.  But if you think getting a permit for your granny unit above the garage is expensive and difficult now, just wait until a handful of your neighbors can force a vote on it!</p>\n\n<p>So, 300 is kinda see through if you actually read it, but 301 seems to be getting a little more traction because it continues the long standing Boulder meme of the “evil developer.” I mean, <em>of course</em> development should pay it’s own way. Aside from the fact that Boulder already has some of the most costly fees for development in the nation - <a href=\"http://oneboulder.org/david-biek-no-on-300-and-301/\">David Biek covers those here</a> - and we just added a $9/sq ft. linkage fee to subsidize affordable housing, Livable Boulder has gravely misrepresented the inevitable outcomes of 301’s passage.</p>\n\n<p>To summarize, development would stop in it’s tracks (yeah, actually our City Manager has said that flat out - no more permits until the litigious dust settles).  Let me rephrase: <strong>no more housing units would be added to our city</strong>.  That means that current homeowners’ property values <em>and property taxes</em> will skyrocket (yes, beyond their current altitude); kids who grew up here will have to leave to be able to afford homes; teachers and service workers will have to move further out and commute in; retirees on fixed incomes wouldn’t be able to afford their property taxes on a fixed income; etc. etc. etc.</p>\n\n<p>[PAUSE, DEEP BREATH.]</p>\n\n<p>By now you’re thinking, “<em>It seems like everyone I talk to is against those measures (<a href=\"http://oneboulder.org/daily-camera-editorial-no-on-300-301/\">even The Daily Camera</a>, which is no friend of the planning department); I’m sure they’re too extreme to pass; I don’t really need to go to all the trouble of filling out the ballot that someone hand delivered to my very doorstep and will pick up after I’ve marked a few dots and signed it.</em>”</p>\n\n<p>Well not so fast, buster!  <strong>The folks who put these measures on the ballot represent the faction of Boulder that actually votes.</strong> Doesn’t matter if they’re the minority if they’re the only ones who bother to vote. To reference the <em>fucking</em> awesome citizen, <a href=\"https://twitter.com/boonrs?lang=en\">Becky Boone</a> — that woman who got in hot water with some of Boulder’s more conservative faction earlier this year for <a href=\"https://youtu.be/Mme2iqk1IYU\">saying “fuck” a lot</a> while trying to get more people in Boulder to vote — in our last local election (2013) only 1/3 of Boulder voted.  : (  Sad face : (  And the majority who do vote are over 40 and own their own homes (while the majority of Boulder’s residents are under forty and rent).</p>\n\n<p><img src='/ro/dojo4/boulder-voter-guide/assets/c.jpeg' alt=\"tumblr_nnoiy8I53b1uu6cgso1_1280.jpg\" /></p>\n\n<p>So, here’s how I’m voting — hope it’s useful to you!</p>\n\n<p><strong>CITY COUNCIL</strong></p>\n\n<p>There are 5 open spots and 19 candidates.  These five are the ones that I think have the best chance at both getting elected and effectively opposing 300/301 and promoting affordable housing, climate action, open space and the other issues I care most about locally.</p>\n\n<ol>\n  <li>\n    <p><strong>Morzel</strong> - has been an amazing advocate for the mobile home owners I’ve been organizing to help this year, plus she’s a geologist, mother of three boys and a zero waste hero in her own home. Although I don’t agree with everything she’s done in her long tenure, I think she should stay on council because she will continue to be a strong voice for open space, climate, and social justice issues.</p>\n  </li>\n  <li>\n    <p><strong>Rigler</strong> - is younger than most candidates. He is a strong environmental advocate (he used to work for Al Gore on climate change), has gotten involved in Boulder by serving on the Transportation Advisory Board, and works as spokesperson for Naropa. He would bring a very visceral sense of what it is like to try to get by in Boulder as a renter. Half of our residents rent, while I believe that every other council member is a homeowner.</p>\n  </li>\n  <li>\n    <p><strong>Brockett</strong> - Aaron is a younger family guy who lives in North Boulder’s Holiday neighborhood. Aaron is one of the “we should have more density where it makes sense, such as along transportation corridors and hubs” voices. Although I’m not necessarily a true believer of the “density equals affordability” mantra, I do think Aaron is a really smart, rational, and independent thinker and very much has his heart in the right place. He’ll be a really really great addition to council.</p>\n  </li>\n  <li>\n    <p><strong>Plass</strong> - Tim is running for his second term on council and has really proven himself as a bridge-builder and approaches decisions on council not as an ideologue, but as a reasonable person who wants the best for Boulder. The bike community has recently embraced Tim and he also is a strong advocate for Boulder’s municipalization efforts, local food investment, and smart growth.</p>\n  </li>\n  <li>\n    <p><strong>Jones</strong> - Zan is a terrific public servant and is a strong champion for progressive values, especially including the environment and climate. Zan is also the Executive Director for Ecocycle. She’s an all-around great person and is always a calm, reasonable, and intelligent voice on important issues.</p>\n  </li>\n</ol>\n\n<p>Note: Some of this text was lifted from my most favorite candidate of all, <a href=\"http://www.stevefenberg.org/\">Steve Fenberg</a>.</p>\n\n<p>Mark will probably vote for Riggler, Yates, Burton, Cote and maybe Spinrad.</p>\n\n<p><strong>ALPHABET SOUP</strong></p>\n\n<p>2N — Yes\n2O — Yes\n2P -— Yes \n2Q — Yes\n2R — Yes\n300 — NO\n301 — NO\n3A — Yes\n5B — Yes\nBB — Yes</p>\n\n<p>For those who want to read more about the ballot measures:</p>\n\n<p><strong>YES on 2N</strong> — This is a fraught attempt at regulating AirB&amp;B and VRBO style rentals, which supplement the income of thousands of Boulder residents and enable them to actually afford to live here.  The short story is: if this doesn’t pass, all short-term rentals will become illegal.  If it does pass, the fight goes on and the dumber parts of this measure will surely be challenged in court, so think of it as an interim step.</p>\n\n<p><strong>YES on 2P!!!</strong>  I am so disappointed to see the ambivalent coverage this is getting in the Camera.  In short, ALL of the efforts that Boulder makes across dozens of programs in dozens of departments — including EVERYTHING my partner works on to <a href=\"https://bouldercolorado.gov/climate\">transition Boulder to carbon-free power sources</a> — will be severely curtailed if this doesn’t pass.</p>\n\n<p><strong>Yes on 2O</strong> — Like 2P, this merely extends existing taxes on electricity use – one that replaced the old franchise fee and funds the general fund (2O), and the other funds city climate action programs (2P). <em>This is not a vote on municipalization – however you feel about that, these two deserve a yes.</em>  (<strong>Mark would disagree, and say No on 2O</strong> because “it would send a strong message to council on the $15M + already wasted on lawyers and consultants and not 1kWh of local or renewable energy.”)</p>\n\n<p><strong>Yes on 2Q</strong> — From what I understand, this just modernizes the library commission and is basically an administrative clarification and there really isn’t any reason to oppose it.</p>\n\n<p><strong>Yes on 2R</strong> — This is an interesting one. (From the Daily Camera: This measure asks: Should City Council members get a $10,000 annual salary, which will increase with inflation, in addition to the per-meeting pay they get now, and health benefits equivalent to those received by city employees? Council members currently earn $206.97 per meeting for up to 52 meetings per year, with the maximum pay being $10,762.44. Adding the base salary would put City Council members above $20,000 a year.</p>\n\n<p><em>What supporters say</em>: Offering a higher salary and health insurance will make it possible for people from more diverse economic backgrounds to serve on City Council. Adding a base salary also reflects the large amount of work council members do outside of meetings.</p>\n\n<p><em>What opponents say</em>: Serving on council should be essentially a volunteer position, and raising the pay moves it closer to being a job. Others believe the pay increase isn’t large enough to make a difference in the types of candidates who can afford to serve.</p>\n\n<p><em>What I say</em>: it’s not enough of a pay raise, and obviously they should have access to the same health benefits city employees get.  The idea that serving on City Council should be a volunteer position is flagrantly classist and merely ensures that only people who can afford not to work for a living could even consider running, and that thus our representation will continue to be drawn only from the wealthiest among us.</p>\n\n<p><strong>YES on BB</strong> — This is a statewide ballot measure that is on the ballot because of the ridiculousness of TABOR.  If it passes, the state keeps tax $$ it has <em>already collected</em> from the marijuana industry and spends $40million on schools and $12million on marijuana education.  If it doesn’t pass, most of the money goes back to growers and sellers, and regular CO taxpayers get about an $8 refund - woohoo.</p>\n\n<p><strong>Yes on 5B</strong> — There will be more and more wildfires to come as the climate heats up. Adding $0.004 per dollar to property tax values to pay for the fire department to protect their homes seems more than reasonable, it seems prudent!</p>\n\n<p><strong>BOULDER VALLEY SCHOOL DISTRICT</strong></p>\n\n<p>Only two are running opposed.  Between Barge, Femmer and Gebhardt, I’d pick:  <strong>Barge, without a doubt</strong>.  His wife is a teacher (currently), and his answers to the <a href=\"http://www.dailycamera.com/local-election-news/ci_28946902/voter-guide-2015-boulder-and-broomfield-counties\">Daily Camera questionnaire</a> were the best among his competitors. Several of my friends know him personally, and like him a lot.</p>\n\n<p>And between McCloskey and Benford, I’d pick: <strong>McCloskey!!</strong>.  When asked about the biggest problem our district faces he answered equity while Benford discussed student achievement.  McCloskey has been a teacher, and Benford seems to be a bit of a firebrand who holds less than mainstream views. I’ve heard that she’s seen as someone who attacks the superintendant and the teacher’s union repeatedly.</p>\n\n<p><strong>IT’S NOT TOO LATE TO REGISTER TO VOTE!</strong></p>\n\n<p>As a reminder, everyone’s ballots arrive by mail (many have already arrived) and you can either mail them in or <a href=\"http://www.bouldercounty.org/elections/polling/pages/default.aspx\">drop them off</a>.  And, <a href=\"https://www.registerincolorado.org/\">it’s not even too late to register to vote, change your address or get a replacement ballot</a>!  Just go online by the 26th of this month if you’d like your ballot mailed to you.</p>\n\n<p><strong>NOW GO VOTE!</strong></p>\n\n<p><img src='/ro/dojo4/boulder-voter-guide/assets/d.jpeg' alt=\"doorsixteen_lisacongdon_VOTE.jpg\" /></p>\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/boulder-voter-guide/assets/b.png",
          "path": "dojo4/boulder-voter-guide/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 800,
            "height": 345
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/boulder-voter-guide/assets/c.jpeg",
          "path": "dojo4/boulder-voter-guide/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 599,
            "height": 451
          },
          "src": null
        },
        "d.jpeg": {
          "url": "/ro/dojo4/boulder-voter-guide/assets/d.jpeg",
          "path": "dojo4/boulder-voter-guide/assets/d.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 600,
            "height": 300
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/boulder-voter-guide",
        "type": "dojo4",
        "id": "boulder-voter-guide",
        "urls": [
          "/ro/dojo4/boulder-voter-guide/assets/b.png",
          "/ro/dojo4/boulder-voter-guide/assets/c.jpeg",
          "/ro/dojo4/boulder-voter-guide/assets/d.jpeg",
          "/ro/dojo4/boulder-voter-guide/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/boulder-voter-guide",
          "prev": "dojo4/where-can-we-meet",
          "next": "dojo4/saccharine-smiles-and-fishnet-stockings"
        }
      }
    },
    "dojo4/saccharine-smiles-and-fishnet-stockings": {
      "author": "mark@dojo4.com",
      "title": "Saccharine Smiles and Fishnet Stockings",
      "published_at": "2015-10-27 17:40:16 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><small>“Sincerity - if you can fake that, you’ve got it made.” ― George Burns</small></p>\n\n<p><img src='/ro/dojo4/saccharine-smiles-and-fishnet-stockings/assets/b.jpeg' alt=\"IMG_2605.jpg\" /> \nWhen Shakespeare wrote “Merchant of Venice” more than five centuries ago, he knew well that what’s on the outside is rarely the whole story - and yes, he wrote “glisters” not “glitters”:</p>\n\n<p>All that glisters is not gold;</p>\n\n<p>Often have you heard that told:</p>\n\n<p>Many a man his life hath sold</p>\n\n<p>But my outside to behold:</p>\n\n<p>Gilded tombs do worms enfold.</p>\n\n<p>But for some reason we still seem obsessed with the external illusions in life - car, clothes, hairdos, zip code… And even as we challenge long standing social norms about race, sexual orientation, gender identification, discrimination, etc. we still spend a significant amount of time judging the proverbial book by its cover. And when I say “we,” I see myself in the picture.</p>\n\n<p>“Appearances matter.” “Never a second chance to make a first impression.”</p>\n\n<p>A couple of Fridays ago I got a chance to share personally with <a href=\"https://www.google.com/url?q=http://mindfullinvestors.com/who-we-are/&amp;sa=D&amp;usg=AFQjCNEH0EorUJ084k0Hh6q3VyO_8zEHoA\">Stuart Rudick</a> of <a href=\"https://www.google.com/url?q=http://mindfullinvestors.com/&amp;sa=D&amp;usg=AFQjCNG6OIAhlbWlT7QRae7EoSpkTyBRCQ\">Mindfull Investors</a>. He had taken a mountain bike ride with @drawohara and was in town to visit his daughter, a student at CU, where he too had graduated way back when bands still rocked Tulagis and alcohol flowed on the Hill.</p>\n\n<p>Not exactly sure where or how Ara and Stu first met, but Stu attended the <a href=\"https://www.google.com/url?q=http://en.wikipedia.org/wiki/Michael_Fitzpatrick_(musician)&amp;sa=D&amp;usg=AFQjCNHFNiYNY_fGXfe9SqJDmD1H3WeB1A\">Michael Fitzpatrick</a> house concert, a burgeoning cultural aspect of @dojo4’s unique practice of business through meaningful work, doing cool shit that matters and honoring people in the process.</p>\n\n<p>I didn’t know who Stu was when I first met him, but he had two essential qualities I appreciate - he looked straight and clearly into my eyes when he spoke; he paid attention when he listened.</p>\n\n<p>Stu walked into dojo4 right before lunch on Friday; he had his dog with him, a cocker spaniel he “claimed” was his daughter’s. Friday lunch @dojo4 is the perfect time to be introduced to another evolving human. Before lunch, daily stand-up includes a community circle with a more personal question.</p>\n\n<p>This is a weekly acknowledgement - something that gives each of us a chance to pause and think about ourselves, our loved ones, each other, our work, our community. A clap and a bow. One minute of silent contemplation. For those who have never meditated (or like to talk like I do), one minute of silence gives a much fuller sense of the breadth of 60 seconds.</p>\n\n<p>Close your eyes and your mouth for a minute. Check it out. Notice your breath.</p>\n\n<p>@coreykohn had the question: what is the best/worst, easiest/hardest thing for you about community?</p>\n\n<p>“My selfishness.”</p>\n\n<p>I forget exactly what Stu said though I knew he felt at home, welcomed in our community.</p>\n\n<p>We ate middle eastern. We chatted. We knew some similar people, Miami transplants to SF, one a great friend who had recently moved back to Boulder. Something about who he was, what he projected gave me the sense that I wanted to know more. Ara had said he should check out my home invited him up to see my home and he came.</p>\n\n<p>I showed him around, immensely proud of what I have built, but open with him about how the parts “unfinished” greatly impact my love relationship, exacerbate some challenging feelings with neighbors not loving our shipping container meets recycled barn aesthetic.</p>\n\n<p><img src='/ro/dojo4/saccharine-smiles-and-fishnet-stockings/assets/c.jpeg' alt=\"10390265_10152283620719601_5530823275928211179_n.jpg\" /> \nIn all fairness I’ve done no landscaping, scraps of cut out container, weeds and construction detritus litter the yard, and a 20’ Hyundai rusting shipping container graffitied with “Love Thy Neighbor” facing the street sits where a driveway once was. It’s waiting to become part of a garage/workshop.</p>\n\n<p>When I tell people about this, I say the outside still looks like West, West Virginia.</p>\n\n<p>Stu had another quality in the best longstanding relationships I’ve had and the ones I’ve created recently - no bullshit, self-effacing, direct and loving - even when that means honest feedback. He got close to me, looked straight into me and said: “Mark, your house is a metaphor. You don’t see it. You must.”</p>\n\n<p>“This place is so damn amazing on the inside. It’s you - creative and bold and beautiful. It’s what you clearly care the most about - what’s on the inside. But the outside is your shadow self. It’s this buffer you use to keep some from loving you in ways you want. Soften that a little. See what happens.” I don’t know about you, but this IS the communication I want.</p>\n\n<p>I told him it was a filter, a filter I’d used effectively throughout my life. That the people who were willing to get beyond my sometimes gruff exterior were the ones I would more likely want to engage with.</p>\n\n<p>“I get that,” he said. “But others who could really benefit from knowing you, might not be able to.”</p>\n\n<p>Thank you, Stu. I’m thinking about that pretty deeply, and I might even take a shave.</p>\n\n<p>If you’re interested in how fishnet stockings fit in this story, authentic communication, building with shipping containers, or building kindness, empathy and meaning in your organizations, get in touch <a href=\"mailto:mark@dojo4.com\" target=\"_blank\">mark@dojo4.com</a>.</p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/saccharine-smiles-and-fishnet-stockings/assets/b.jpeg",
          "path": "dojo4/saccharine-smiles-and-fishnet-stockings/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 2448,
            "height": 3264
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/saccharine-smiles-and-fishnet-stockings/assets/c.jpeg",
          "path": "dojo4/saccharine-smiles-and-fishnet-stockings/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 720,
            "height": 960
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/saccharine-smiles-and-fishnet-stockings",
        "type": "dojo4",
        "id": "saccharine-smiles-and-fishnet-stockings",
        "urls": [
          "/ro/dojo4/saccharine-smiles-and-fishnet-stockings/assets/b.jpeg",
          "/ro/dojo4/saccharine-smiles-and-fishnet-stockings/assets/c.jpeg",
          "/ro/dojo4/saccharine-smiles-and-fishnet-stockings/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/saccharine-smiles-and-fishnet-stockings",
          "prev": "dojo4/boulder-voter-guide",
          "next": "dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters"
        }
      }
    },
    "dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters": {
      "author": "corey@dojo4.com",
      "title": "Uncle Earl, Godfrey Reggio and Why How & Where We Do Our Work Matters",
      "published_at": "2015-10-29 18:44:47 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/assets/b.jpeg' alt=\"cubicles.jpg\" /> \nIn 2001, my uncle, Earl, took me to visit an old buddy of his, <a href=\"http://www.imdb.com/name/nm0716585/\">Godfrey Reggio</a>, in the film editing studio he had set up just below Canal St., not long before 9/11, and not far from my East Village apartment. He was in the process of making <a href=\"https://en.wikipedia.org/wiki/Naqoyqatsi\">Naqoyqatsi</a>, the third film in the <a href=\"http://www.koyaanisqatsi.com/\">Qatsi trilogy</a>. Earl thought I’d be interested because I was working in documentary film and television production at the time- but in the end, what was a huge influence on me wasn’t the product of the filmmaking that was happening, but the environment is which the film was being made.</p>\n\n<p>Godfrey welcomed us warmly as we stepped out of the freight elevator and into the cavernous loft. Right away I could see there was something different happening here than in any other production company I’d ever visited or worked at. It was late-morning and almost completely quiet in the space- there was none of the regular hubbub I was used to and although I couldn’t see anyone right away, there was an palpable sense of hushed productivity. The tour Godfrey led us on revealed numbers of sparse but cozy, dimly lit edit bays arranged along wide <a href=\"http://www.faena.com/aleph/articles/the-monk-who-became-a-filmmaker-documents-the-soul-of-the-world/\">cloistral</a> hallways, each inhabited by one or two people, working on footage glistening on cinema displays. The back of the loft opened up into a communal kitchen area bounded by a long, heavy wooden dining table with a projector screen at the end of the room.</p>\n\n<p>As Godfrey and Earl kibitzed about friends from their hippie commune days, someone came out of the kitchen and clanged a large, iron fire triangle hanging from the ceiling. Seconds later, a dozen and a half or so people came streaming out into the hall and into the kitchen and started to serve each other from the pots that had been cooking on the stove. We joined them with our bowls of steaming lunch as they sat down at the long table and started to eat. The meal’s lively conversation was punctuated by Godfrey’s introduction of us as guests, and then a screening of some of that morning’s work.</p>\n\n<p>Probably then everyone just got up, plopped their dishes in the sink and holed up for a few more hours to slog their way through endless hours of difficult video. However, the way that I like to remember it- and the imagery and activity that the environment seemed to be designed to evoke-  is that there was then a post-meal, spontaneous, communal and utopian co-cleaning of the kitchen and some meaningful small talk in the skylight beam of downtown, early afternoon sun as people brewed themselves some tea before settling back into applying their natural talents to an artful documentary imbued with deep purpose. I think I like to remember it like that because the studio and the people I met there opened my eyes to a way of doing, and <em>being in</em> work, that I had not yet encountered.</p>\n\n<p>Maybe I remember it that way because I’m an incorrigible idealist (or maybe because of the giant joint we smoked after lunch with Godfrey in the apartment he shared with his girlfriend in the back of the loft). But, I left with my mind sparked by seeing that the product of work is deeply influence by the environment in which it is created, that the ‘what’ may actually be wholly secondary to the ‘how’. That day influenced me in my belief that <em>the work is in the doing rather than what comes out of the doing</em>. And it influenced my thinking about what is important work and why we do it. It encouraged my understanding that work does not have to look like what people might think of as work to be both impactful and valuable. It allowed me to be inspired to build beautiful, unconventional physical and interpersonal spaces for people to do that work.</p>\n\n<p>I hope that what we are doing at dojo4 is some version of that and that I can do it more and more. We’ve worked hard to create a space that is a reflection our values of the primacy of community and authentic relationships, radical openness, and the worthiness of work well-done. Maybe some day, some young whippersnapper will come here and be inspired to do meaningful work in a meaningful way. (And maybe, if I’m lucky, I’ll smoke a joint with them in the back and they’ll write an idealistic blog post about it.)</p>\n\n<p><img src='/ro/dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/assets/c.jpeg' alt=\"dojo4panorama.jpg\" /></p>\n\n<p><a href=\"https://instagram.com/p/8USDweEqgZ/\"><em>Uncle Earl Rosner ::: July 9, 1942 - October 1, 2015</em></a> \n<em>Om gate gate paragate parasamgate bodhi svaha</em></p>\n\n<p><strong>Naqoyqatsi</strong></p>\n<ul>\n  <li>trailer: <a href=\"https://www.youtube.com/watch?v=jl1RcfvEsiA\">https://www.youtube.com/watch?v=jl1RcfvEsiA</a></li>\n  <li>full movie: <a href=\"http://www.disclose.tv/action/viewvideo/174861/Naqoyqatsi_Life_as_WarFull_Length/\">http://www.disclose.tv/action/viewvideo/174861/Naqoyqatsi_Life_as_WarFull_Length/</a></li>\n  <li>soundtrack by Philip Glass: <a href=\"https://soundcloud.com/peyman-khazaeli/naqoyqatsi-philip-glass\">https://soundcloud.com/peyman-khazaeli/naqoyqatsi-philip-glass</a></li>\n  <li>Qatsi Trilogy: <a href=\"http://www.koyaanisqatsi.com/films/film.php\">http://www.koyaanisqatsi.com/films/film.php</a></li>\n</ul>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/assets/b.jpeg",
          "path": "dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 640,
            "height": 349
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/assets/c.jpeg",
          "path": "dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1152,
            "height": 328
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters",
        "type": "dojo4",
        "id": "uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters",
        "urls": [
          "/ro/dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/assets/b.jpeg",
          "/ro/dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/assets/c.jpeg",
          "/ro/dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters",
          "prev": "dojo4/saccharine-smiles-and-fishnet-stockings",
          "next": "dojo4/sense-of-self-as-commodity"
        }
      }
    },
    "dojo4/sense-of-self-as-commodity": {
      "author": "mark@dojo4.com",
      "title": "Sense of Self as Commodity",
      "published_at": "2015-11-05 23:20:13 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/sense-of-self-as-commodity/assets/b.jpeg' alt=\"29EF6F6000000578-3137793-image-a-3_1435163092168.jpg\" /> \nEssena O’Neill quit Instagram. You haven’t heard? It’s hard work being phony, hard on one’s sense of self. Don’t pretend like you don’t know. We’ve all had to play act in social situations - mother-in-law, boss, whomever or have affected some hairstyle, movement, mannerism, language, way of dress to mask insecurities and physical imperfections, or some way of being to fit in.</p>\n\n<p>In an article on Refinery 29 Ms. O’Neill is quoted as saying, “Please can someone make a social sharing platform not based on validation in views/followers/likes but shared for real value and love?”</p>\n\n<p>The inevitable and harsh backlash had begun within hours - the questioning of motives, anger, name calling and public shaming. Where else? In the very social media where flogging has become the norm, and the mirror for seeing one’s true self is bombarded and clouded with curated images of something.</p>\n\n<p>Undressing our vulnerabilities in public is frightening. And Essena, a teenager, had the cunt, the girl given gumption to out herself and stake a claim for something better.</p>\n\n<p>Back in March, gender-bending model Rain Dove, who is already calling into question rigid views of identification, preference and style by just being, and being brave enough to do so, posted a blog titled: NEEDED: LESS SELFIE PEOPLE AND MORE SELFLESS PEOPLE</p>\n\n<p>“QUICK PSA: I post a photo wearing $5k outfit… 300 Likes. I post a photo donating $5k from selling that item to a homeless shelter organization… 45 Likes. Im not looking for applause or validation from the world. But I am wishing that people valued GOOD ACTIONS as highly as GOOD CLOTHING.”</p>\n\n<p>Meanwhile, over on the Wal-Mart of social media where original thought has long been replaced with a weird mix of pettiness, Thanksgiving day politeness and second hand showmanship, the Zuck-machina is now serving up a “healthy” dose of ersatz emotion.</p>\n\n<p><img src='/ro/dojo4/sense-of-self-as-commodity/assets/c.png' alt=\"Screen Shot 2015-11-05 at 2.40.31 PM.png\" /></p>\n\n<p>As the father of three teenagers, two girls 17 and 14, and 17 year old son, all of this has deep meaning. That crazy human transition from the parental nest to forming an identity, a sense of self, becoming more adult was difficult enough when not every waking second was easily documented, shared and compared. But externalized pressures of what it means to be successful, beautiful, worthwhile have ramped up considerably, making it that much harder to discover and know one’s true self.</p>\n\n<p>At 23 I dated a beautiful young woman who had modelled almost all her life. All that time in front of a camera, being complimented on her physical appearance, jaded her sense of self. How deeply she wanted someone to know her inside, to care enough. She was also smart enough to know the doors her physical opened - which actually made her even more self conscious.</p>\n\n<p>My son told me this week about a weekend of relative debauchery. One of his buddies had rented an AirBnB or VRBO in the foothills, and the house was used like a bit of a one-hour motel (though more likely an 8-minute motel). He said he and his buddies were talking Sunday morning about how all the girls are: “someone’s daughter or sister.”</p>\n\n<p>My daughters, his sisters, experience the disconnect between a sense of self and peer-group perception. It’s an odd feeling watching one’s daughter be objectified, and even much harder when it happens outside her peer group, at a restaurant say, on the street, a man not much younger than I am.</p>\n\n<p>Social media in some ways objectifies the self, commodifies in a way that cannot be great for self-esteem. I am not a social scientist - not one with a PhD from a reputable university. I cut my teeth behind bars, a gin and tonic psychologist who just likes to watch people. I’ve done my share of objectification as well in my day, still probably slip more than I should, especially as the father of three teens.</p>\n\n<p>If I were Essena’s father, I’d tell her she should be proud of herself for choosing a different path, learning herself in real time, feeling. I’d say: remember that place that felt hollow and lean into the places that feel good for you.</p>\n\n<p>Rain Dove, too, sets a shining example for all of us on the path of emotional evolution. How special that her sense of self cannot be defined by social norms. That her gender fluidity manifests itself in so many beautiful ways.</p>\n\n<p>Wouldn’t it be nice if instead of selfie-sticks, we started honoring self through acceptance of, empathy for and learning to love what is beneath the surface. Wouldn’t it be nice if our social media presence matched that place.</p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/sense-of-self-as-commodity/assets/b.jpeg",
          "path": "dojo4/sense-of-self-as-commodity/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 634,
            "height": 423
          },
          "src": null
        },
        "c.png": {
          "url": "/ro/dojo4/sense-of-self-as-commodity/assets/c.png",
          "path": "dojo4/sense-of-self-as-commodity/assets/c.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 497,
            "height": 188
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/sense-of-self-as-commodity",
        "type": "dojo4",
        "id": "sense-of-self-as-commodity",
        "urls": [
          "/ro/dojo4/sense-of-self-as-commodity/assets/b.jpeg",
          "/ro/dojo4/sense-of-self-as-commodity/assets/c.png",
          "/ro/dojo4/sense-of-self-as-commodity/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/sense-of-self-as-commodity",
          "prev": "dojo4/uncle-earl-godfrey-reggio-and-why-how-and-where-we-do-our-work-matters",
          "next": "dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet"
        }
      }
    },
    "dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet": {
      "author": "emily@dojo4.com",
      "title": "! 'Green The Web Post #1 - Championing the Conversation to a Carbon Neutral",
      "published_at": "2015-11-10 15:16:34 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><em>This blog will be the first in a series on the carbon costs of our Internet activities, and what to do about it - woot!</em></p>\n\n<p><img src='/ro/dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/assets/b.png' alt=\"bcorp_reatreat_building_bridges.png\" /></p>\n\n<p>DOJO4 recently co-hosted an “unconference session” at the <a href=\"http://www.tripzero.info/b_corp_champions_retreat_2015.html\">B Corp Champions Retreat</a> near Portland, Oregon called “Championing the Conversion to a Carbon-Neutral Internet.” With our kindred colleagues at <a href=\"http://manoverboard.com/\">Manoverboard</a> and <a href=\"http://www.mightybytes.com/\">Mightybytes</a> we circled up with some other tech-savvy B’s to foment a movement of certified B Corporations to lead the way on both measuring and mitigating the carbon footprint of our websites and internet usage.</p>\n\n<p>Why?</p>\n\n<p>No one has said it better than <a href=\"https://twitter.com/deckchairs\">Andrew Boardman</a>, so below we repost part of his article <a href=\"http://\">Creating a Responsible, Earth-Friendly Website</a>.</p>\n\n<hr />\n\n<p>According to a stellar new <a href=\"http://www.greenpeace.org/usa/global-warming/click-clean/\">report by Greenpeace</a>, internet and IT services comprise approximately 2% of all carbon emissions — or approximately the same as that of the aviation sector. <strong>In other words, those crowded lanes in the sky are putting out as much carbon as the cable beneath our roads.</strong></p>\n\n<p><img src='/ro/dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/assets/c.jpeg' alt=\"manycontrails.jpg\" /></p>\n\n<p>In the report, the authors point out that while there have been some improvements (and Apple comes out smelling great with a 100% Clean Energy Index), for a number of internet behemoths like Facebook and eBay, there is much to be done if we want to stay ahead of a sustainable growth curve.</p>\n\n<p><strong>THE INTERNET IS EXPECTED TO CONTINUE ITS GROWTH TRAJECTORY</strong></p>\n\n<p>According to Doug Webster, Vice President of product and solutions marketing at Cisco “Cisco’s VNI Forecast once again showcases the seemingly insatiable demand for bandwidth around the globe and provides insights into the architectural considerations necessary to deliver on the ever-increasing experiences being delivered. With more and more people, things, processes and data being connected to the Internet of Everything, the intelligent network and the service providers who operate them are more relevant than ever.”</p>\n\n<p>By 2017, there will be about 3.6 billion internet users — more than 45% of the world’s projected population.\nIn 2012, there were 2.3 billion internet users — about 32% of the world’s population.</p>\n\n<p>By 2017, there will be more than 19 billion global network connections, up from 12 billion in 2013.\nBy 2017, the non-PC share of Internet traffic will grow to 46% from 26% in 2012.</p>\n\n<p>In its report, Greenpeace goes on to summarize: “From music and video to communications and mail, more and more of our ‘offline’ world is moving online. We can expect that trend to continue and accelerate as the global online population reaches 50% of the world’s projected population.”</p>\n\n<p>All of this leads to one conclusion: In the short term, the Internet has helped offset carbon emissions through greater connectivity leading to less travel worldwide. However, access in the long-term will demand as much if not more energy to keep the infrastructure sound and safe. And we need to keep our sites, tools, and applications online as green as possible if we expect to have a chance at reducing carbon emissions.</p>\n\n<p><strong>WHAT CAN WE DO?</strong></p>\n\n<p>So how do we create a more sustainable web? How can we design our internet lives and websites to minimize, if not negate, our impact? And what can designers, marketers, and web serfs do to keep it green?</p>\n\n<p>There is one basic premise on which everyone seems to agree when designing any website and especially a green one — Keep It Simple. This was always one of the most basic rules to follow from day one. When I designed my first (and crappy) website in 1995, the web forced us to keep it simple. There wasn’t much we even could do. And in 2001, designer Steve Krug wrote the book on KISS — called Don’t Make Me Think (and now in its third edition). These principles of design are still highly relevant to all digital interfaces not only for ease of use and human engagement but also in determining energy consumption that powers our online behaviours.</p>\n\n<p><strong>DON’T REPEAT PAST MISTAKES WHEN DESIGNING FOR THE WEB</strong></p>\n\n<p>Given the increase in bandwidth and speeds over the last ten years, many designers and developers ignored the ‘KISS’ principle. Flash scripts created bulky downloads. Larger and larger images are currently used to showcase product lines. Massive JavaScript libraries are being served to control features and functions on websites, often with varying success. Slideshows of large images can create performance slowdowns, making users wait for information and forcing servers to use unnecessary energy. (Our own homepage featured heavy images requiring large downloads; this is something we addressed in the past few weeks.)</p>\n\n<p>The euphoric response by designers and developers to faster online speeds have made websites bigger (or heavier, when thinking about data and performance). This might have been fine if billions of internet users hadn’t also been added to the mix — straining networks, demanding additional infrastructure, and consuming more energy.</p>\n\n<p><strong>THREE REASONS (AS IF ONE ISN’T ENOUGH) FOR INCREASING SITE PERFORMANCE</strong></p>\n\n<p>First, heavier, more complex content requires additional infrastructure, bandwidth and energy to move data from point A (a server) to point B (your device). With more people using mobile devices to connect, speed is at a premium.</p>\n\n<p>Second, as noted earlier, a greener web will create less carbon emissions and a healthier planet for all of us.</p>\n\n<p>Finally, Google and other search providers are <a href=\"https://moz.com/blog/how-website-speed-actually-impacts-search-ranking\">starting</a> to prioritize the rank of those sites that are speedy. There may come a time when a bandwidth-heavy site will be penalized in search results.</p>\n\n<p>The hard and wonderful reality is this: <strong>Mobile performance, green web design, and SEO are all interconnected.</strong></p>\n\n<p>We need to return to a simpler and bandwidth-conscious time. We know that lots of data-consuming animation doesn’t get a visitor’s attention but great content and design does.</p>\n\n<hr />\n\n<p><em>So there’s the WHY.  Stay tuned for the next installments in this series, which will focus on the HOW of greening up your website.</em></p>\n\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/assets/b.png",
          "path": "dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 640,
            "height": 479
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/assets/c.jpeg",
          "path": "dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 400,
            "height": 300
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet",
        "type": "dojo4",
        "id": "green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet",
        "urls": [
          "/ro/dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/assets/b.png",
          "/ro/dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/assets/c.jpeg",
          "/ro/dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet",
          "prev": "dojo4/sense-of-self-as-commodity",
          "next": "dojo4/when-was-the-last-time-you-heard-my-voice"
        }
      }
    },
    "dojo4/when-was-the-last-time-you-heard-my-voice": {
      "author": "jessica@jwatsoncreative.com",
      "title": "When was the last time you heard my voice?",
      "published_at": "2015-11-13 00:04:18 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/when-was-the-last-time-you-heard-my-voice/assets/b.png' alt=\"Time_Dojo4_JWC.png\" /> \nAs in, when was the last time we actually spoke on the phone or in person? I have friends who won’t answer their phone when it rings, who will not listen to voicemails with any kind of urgency, and who prefer text messaging over the real thing <em>(the real thing being: an actual conversation)</em>.</p>\n\n<p>Where is our time going, and is anyone else feeling this shift in human communication and connection? We live in a day and age where now more than ever, a person is most likely to walk into a telephone pole because he or she was looking down at her phone. This is a time where people are actually thumb soreness from excessive scrolling. Where you can be laying next to the love of your life, and yet separated by a phone screen and the lure of social media.</p>\n\n<p>Help! My dad just texted me and said “LOL!”</p>\n\n<p><em>How did he learn about LOL?!?!</em></p>\n\n<p>I have friends that I think about often whom I rarely get to talk to, but according to Facebook I guess they are doing fine. Except Facebook is a poor outlet for showcasing the full spectrum of someone’s life, and it’s so damn easy to cover up the rough spots or to simply put your best foot forward. Are the advances in social technology also encouraging a sugar coat, and the wearing of masks?</p>\n\n<p>In my lifetime, I have experienced going to the movie theater with someone who was constantly texting and checking updates on his phone <em>(and this was a date! Clearly, the first and last date)</em>. I’ve gone out to dinner where one person taking out a phone grants permission for all, and I’m the only one looking at the menu, eagerly contemplating the risotto over the grilled scallops. I’ve also experienced talking in front an inner city high school class full of cell phones. I don’t remember making eye contact, but the teacher complimented me that I held their attention so well.</p>\n\n<p>It’s a different world out there. Am I in the right time?</p>\n\n<p>Now I’m not asking that we all chuck our phones out the window. I actually really enjoy using mine to take scenic photos of the places I’ve been. A photo is still worth a thousand words, and I love sharing the world I see. I also use my phone to check into places when I travel, so I have a digital record later when I’m writing about where I’ve been.</p>\n\n<p>I am simply asking that we reevaluate how we spend our time with technology, and ask ourselves if by being so plugged in we are missing out on the real thing.</p>\n\n<p>–\n<strong>THE FACTS</strong>\nOne report says smartphone users check Facebook 13.8 times a day, on average.[^1] This study was done in 2013, so I can predict the numbers have only gone up between now and then. Have you ever stepped on a subway or a bus, or stood in a long line anywhere? If you look around, you’ll notice that almost everyone is on their phone.</p>\n\n<p>Smart phones are becoming the easiest and quickest way to access news and friends all at once. The average user reaches for their phone when they wake up in the morning. These users check their personal emails and Facebook before they get out of bed. Many of us pick up our phones more than 1500 times each week. Average owners use their smartphone for 3 hours and 16 minutes a day.<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">1</a></sup></p>\n\n<p>Many smartphone owners also confessed to finding themselves using their phones without realizing they’re doing so, with 2/3rds saying they have managed to log in and browse Facebook without thinking.<sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">2</a></sup> This learned behavior puts parts of our lives on autopilot.</p>\n\n<p>–\n<strong>ARE WE ADDICTED?</strong>\nWebMD places the topic of Technology Addiction under their Substance Abuse and Addiction Health Center. Our uber-connected lives have made us virtually available at any time, at any place — the movies, the golf course, traffic lights, you name it.<sup id=\"fnref:4\"><a href=\"#fn:4\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">3</a></sup></p>\n\n<p>We are now more wired than ever. Researchers from the University of Glasgow found that half of the study participants reported checking their email once an hour, while some individuals check up to 30 to 40 times an hour.<sup id=\"fnref:5\"><a href=\"#fn:5\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">4</a></sup></p>\n\n<p>“I live and die in email,” says IT manager Christopher Post in Camp Hill, Pa. “I found a PDA to be a double-edged sword. It can certainly allow you to do a lot more in any given day, but there is certainly a cost associated. I tend to lose out on a lot of other experiences, like when I should be paying attention at the dinner table.”<sup id=\"fnref:6\"><a href=\"#fn:6\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">5</a></sup></p>\n\n<p>I admit that I have seen this behavior this trickle over into the business world. Replies in my inbox mere seconds after sending an email out. I’d also be lying if I said my business line didn’t receive a random text message every now and then, by someone who didn’t get the memo that they are texting a business line.</p>\n\n<p>In an age where so much is available instantly at our finger tips, how do we unplug?</p>\n\n<p>–\n<strong>HOW DO WE GET UNSTUCK?</strong>\nI want to have more real time conversations with people, where someone is actually making time for me, and I’m making time for them. Where we are listening and responding, not responding to text messages while also checking in on Facebook and playing opponents on Words with Friends. Am I living in a fantasy world?</p>\n\n<p>I am not separate from this article. I too enjoy scrolling on Facebook and Instagram. I text friends all the time to send them a funny joke to make them smile or to let them know I’m thinking of them. But I miss the kind of connecting we used to do before these smart phones and social networks became so popular.</p>\n\n<p>If like me and you’re looking to create some distance between yourself and the digital world we’re always plugged into, here are some suggestions:</p>\n\n<ul class=\"task-list\">\n  <li class=\"task-list-item\">\n    <p><input type=\"checkbox\" class=\"task-list-item-checkbox\" disabled=\"disabled\" /><strong>Leave Your Phone At Home:</strong> Maybe it’s not feasible for an entire day, but how about for lunch, for dinner out with your friends, for the movie, or for going to the gym. Too much of a leap? Well then, for starters, try switching your phone to airplane mode so you’re not accessible but you can still access the time and your music.</p>\n  </li>\n  <li class=\"task-list-item\">\n    <p><input type=\"checkbox\" class=\"task-list-item-checkbox\" disabled=\"disabled\" /><strong>Hide Your Phone:</strong> I’d recommend this for the times when you’re trying to be productive. Smartphones are an easy distraction, especially if you have the screen up and can see every time someone is messaging you.</p>\n  </li>\n  <li class=\"task-list-item\">\n    <p><input type=\"checkbox\" class=\"task-list-item-checkbox\" disabled=\"disabled\" /><strong>Turn Off Push Notifications:</strong> Do you really need to get dinged every time someone likes a post or a tweet or a pin? No. It may even be more excited to log in at the end of the day and see you have 25 notifications waiting for you instead of logging in every hour for 1 or 2.</p>\n  </li>\n  <li class=\"task-list-item\">\n    <p><input type=\"checkbox\" class=\"task-list-item-checkbox\" disabled=\"disabled\" /><strong>Delete Social Media Apps:</strong> I’ve done this for Facebook. If I want to log in on my phone, I have to go through my web browser. Since it’s more of a hassle to get there, I spend less time on it while I’m on my phone.</p>\n  </li>\n  <li class=\"task-list-item\">\n    <p><input type=\"checkbox\" class=\"task-list-item-checkbox\" disabled=\"disabled\" /><strong>Get the Phone Out of Your Bedroom:</strong> I realized that the only functional reason why my phone is in my bedroom is that it also serves as an alarm clock. So I brought and old fashion alarm clock, and now if I can’t fall asleep at night, I pick up a book.</p>\n  </li>\n</ul>\n\n<p>–\n<strong>WHAT I WANT</strong>\nFor the people I care about to call me every now and then so we can catch up, and a little effort to be made for spending time together.</p>\n\n<p>–\n[^1]: How Many Times A Day Do You Check Facebook From Your Smartphone?, <a href=\"http://www.bizjournals.com/pacific/blog/morning_call/2013/03/how-much-time-do-you-really-spend-on.html\">Pacific Business News</a>.</p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:2\">\n      <p>How Often Do You Look?, <a href=\"http://www.dailymail.co.uk/sciencetech/article-2783677/How-YOU-look-phone-The-average-user-picks-device-1-500-times-day.html\">Daily Mail</a> <a href=\"#fnref:2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:3\">\n      <p>How Often Do You Look?, <a href=\"http://www.dailymail.co.uk/sciencetech/article-2783677/How-YOU-look-phone-The-average-user-picks-device-1-500-times-day.html\">Daily Mail</a> <a href=\"#fnref:3\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:4\">\n      <p>When Technology Addiction Takes Over, <a href=\"http://www.webmd.com/mental-health/addiction/features/when-technology-addiction-takes-over-your-life\">WebMD</a> <a href=\"#fnref:4\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:5\">\n      <p>When Technology Addiction Takes Over, <a href=\"http://www.webmd.com/mental-health/addiction/features/when-technology-addiction-takes-over-your-life\">WebMD</a> <a href=\"#fnref:5\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:6\">\n      <p>When Technology Addiction Takes Over, <a href=\"http://www.webmd.com/mental-health/addiction/features/when-technology-addiction-takes-over-your-life\">WebMD</a> <a href=\"#fnref:6\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/when-was-the-last-time-you-heard-my-voice/assets/b.png",
          "path": "dojo4/when-was-the-last-time-you-heard-my-voice/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 752,
            "height": 396
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/when-was-the-last-time-you-heard-my-voice",
        "type": "dojo4",
        "id": "when-was-the-last-time-you-heard-my-voice",
        "urls": [
          "/ro/dojo4/when-was-the-last-time-you-heard-my-voice/assets/b.png",
          "/ro/dojo4/when-was-the-last-time-you-heard-my-voice/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/when-was-the-last-time-you-heard-my-voice",
          "prev": "dojo4/green-the-web-post-number-1-championing-the-conversation-to-a-carbon-neutral-internet",
          "next": "dojo4/can-you-build-me-an-app"
        }
      }
    },
    "dojo4/can-you-build-me-an-app": {
      "author": "mark@dojo4.com",
      "title": "Can You Build Me an App?",
      "published_at": "2015-11-16 19:14:53 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/can-you-build-me-an-app/assets/b.png' alt=\"Screen Shot 2015-11-16 at 11.50.36 AM.png\" /> \n“<em><a href=\"http://www.greenpeace.org/usa/wp-content/uploads/legacy/Global/usa/planet3/PDFs/2015ClickCleanKeyFindings.pdf\">Companies that host in colocation and cloud environments can send a powerful signal to potential vendors by adopting procurement policies to work with vendors that demonstrate energy transparency and are committed to increasing their renewable energy supply</a></em>.”</p>\n\n<p>I spent many nights behind bars at some of South Beach’s hottest nightclubs in the early 90s. At every place we prominently displayed the 5 or 6 beers we carried as convenience to customers and bartenders who slammed out drinks as quickly as they could make them. It drove me crazy when someone asked: what beers do you have? A few times I’m sure I said what I really wanted to - just imagine for yourself. You don’t have to get too creative.</p>\n\n<p>Unlike the restaurant biz, in high volume clubs the customer is not always right. He is drunk or wanting to get drunk, someone is standing right next to him with money in his pocket too, and dozens of people are out front. Most of the time I pointed at the beer bottle display and walked away to serve someone else. I’ve always been a fan of non-verbal communication.\n<img src='/ro/dojo4/can-you-build-me-an-app/assets/c.png' alt=\"Screen Shot 2015-11-16 at 11.53.13 AM.png\" /> \nBut I just might also one-too-many colodas muy rapido riff: BudBudLightAmstelLightHienekenBecksCorona (look this was pre-handcrafted, micro reality).</p>\n\n<p>Drinks in plastic cups. Beers in bottles. No blenders. High-efficiency. Indisputable agile drink serving development.</p>\n\n<p>Way too often a clueless customer would ask: Do you have a Dos Equis (Michelob, Miller Lite, whatever)? In those instances I rarely held back - remember, the bar is four deep and there’s a crowd gathered outside around the velvet ropes just wishing they could pay a ridiculous cover and get inside: Are you fucking stupid? You just asked me what I have. I told you. Did you hear me say Dos Equis? And I would definitely walk away to serve somebody else.</p>\n\n<p>For all of you who are thinking about walking into a creative technology company and asking: Can You Build Me an App (or at a high-volume nightclub wanting a drink), please remember this story. Of course dojo4 (or any competent creative technology shop) can build you an app. The more important questions are: Who are you? What are you building and why? What’s your budget? Do we care?</p>\n\n<p>Do we care is probably the most important question today. We’ve long passed the great app store gold rush. We have infinite angry birds, communication tools, news sources, social distractions, etc. to choose from. Techstars even funded Drizly - a company with an app that solves the liquor delivery problem. Yeah, brah!</p>\n\n<p>Greenpeace approached dojo4 last spring to help rebuild the back-end and improve their Click Clean Scorecard app (browser extension) before release. The Click Clean Scorecard helps you “find out which of the companies behind the world’s most popular websites are leading the way or falling behind in the race to build a greener online.” The browser extension gives you an energy score on the sites you visit. You can download the app [here] (<a href=\"https://www.google.com/url?q=https://chrome.google.com/webstore/detail/click-clean-scorecard/kabglhocepgbnobnbhjalijemcipaoha?hl%3Den&amp;sa=D&amp;usg=AFQjCNGnfxT8AaCMOQ9k7MGVRHlYQBCGKQ\" target=\"_blank\">https://www.google.com/url?q=https://chrome.google.com/webstore/detail/click-clean-scorecard/kabglhocepgbnobnbhjalijemcipaoha?hl%3Den&amp;sa=D&amp;usg=AFQjCNGnfxT8AaCMOQ9k7MGVRHlYQBCGKQ</a>).</p>\n\n<p>dojo4 founding partner and CTO, Ara Howard, has spoken extensively about the relative power of coders and the importance of doing shit that matters. In his powerful 2015 Kiev Ruby conference presentation “Program Like You Give a Damn” (transcript available [here] (<a href=\"https://www.google.com/url?q=http://dojo4.com/blog/program-like-you-give-a-damn&amp;sa=D&amp;usg=AFQjCNEPPD6D6i_uLrXuqzaYytKqFHxQeg\" target=\"_blank\">https://www.google.com/url?q=http://dojo4.com/blog/program-like-you-give-a-damn&amp;sa=D&amp;usg=AFQjCNEPPD6D6i_uLrXuqzaYytKqFHxQeg</a>)), Ara challenges the fundamental notion of coding.</p>\n\n<p>“The thing that’s wrong with a whole lot of the startup community  – and the development community by side effect – is that people have forgotten that the fundamental criteria for having a successful business and engineering a solution is having a real problem. Right? You actually need a problem to solve in order to write code that has an impact. And the whole point of this talk, again, is just to encourage the people on the ground – you, the troops – that this is possible.”</p>\n\n<p>Energy use is a real problem. dojo 4 engineers just updated the Click Clean Scorecard for release in Korean. The technological problem in updating the Chrome extension wasn’t necessarily significant or deeply challenging, but the time was well spent because it helps solve the most important question we’re grappling with here: do we care?</p>\n\n<p>And, yes, we care. Greenpeace’s recognition of the importance of technology, technology companies, knowledge as power in transformation and more conscious consumerism not only helps move the conversation on global energy issues, it deeply aligns with the dojo4 imperative to “do shit that matters.”</p>\n\n<p>The Click Clean Scorecard: Key Findings &amp; Scores Explained, an initial report recently released based on information gleaned from the browser extension, comes to the following important four conclusions on technology companies’ energy use:</p>\n\n<ol>\n  <li>Green streaming will be crucial</li>\n  <li>Amazon Web Services is holding many of our favorite sites hostage to dirty energy</li>\n  <li>Transparency about our favorite online brands’ energy use is sorely lacking</li>\n  <li>Cloud and colocation customers can play a key role as renewable energy champions</li>\n</ol>\n\n<p>Reforming our energy use and our impact on climate change are moral imperatives. Understanding our impact and aligning our business model and who we are as people raise even deeper questions about <em>energy</em> use - i.e. how we use our personal energy. What are we willing to change? What do we spend time on? What will we get paid for?</p>\n\n<p>These questions loom even more definitively as politicians, scientists and world leaders are about to convene in Paris for the Climate Change Summit and in light of the tragedy there this weekend. Bear with me and get the connection. The one to the Climate Change Summit is easier, I think, but it points to the other.</p>\n\n<p>The beautiful subtext of what Greenpeace’s Click Clean Scorecard asks is how our online habits directly support dirty energy choices. But it also points to something deeper, I believe. That is: the conversation around climate change seems to consistently be driven by externalities - coal plants, electric cars, solar panels, melting ice, heat, extreme weather patterns, data, papers, companies.</p>\n\n<p>Our energy choice - not just the URLs we visit or waste time on or love - but our actual internal energy systems, what we value and how we act, how our intention matches our reality must become a part of the conversation for change. No differently than how dojo4 is committed to earning an income with its creative coding by rigorously aligning our values with the work we will do.</p>\n\n<p>Similarly, it’s pretty easy to point at “radical Islam” or some other externalized bogeyman in this weekend’s tragedy. A more important conversation - whether it’s climate change and energy use or terrorism - is what’s happening in my energy system - the way I live in the world - that contributes to the problem or the solution.</p>\n\n<p>The world I am living in is my reflection.</p>\n\n<p>So before you walk into dojo4 and ask: can you build me an app?, before you ask a bartender at a busy nightclub what beer they serve, before you blame, look around, think, self-assess. Does it look like we serve Dos Equis?</p>\n\n<p><em>Everyone at dojo4 is sending our love, compassion and kindness to all the victims of this weekend’s tragedy, anyone living in pain, and anyone who’s feeling so victimized by his existence that he feels like violence toward others is part of the solution.</em></p>\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/can-you-build-me-an-app/assets/b.png",
          "path": "dojo4/can-you-build-me-an-app/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 503,
            "height": 289
          },
          "src": null
        },
        "c.png": {
          "url": "/ro/dojo4/can-you-build-me-an-app/assets/c.png",
          "path": "dojo4/can-you-build-me-an-app/assets/c.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 639,
            "height": 384
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/can-you-build-me-an-app",
        "type": "dojo4",
        "id": "can-you-build-me-an-app",
        "urls": [
          "/ro/dojo4/can-you-build-me-an-app/assets/b.png",
          "/ro/dojo4/can-you-build-me-an-app/assets/c.png",
          "/ro/dojo4/can-you-build-me-an-app/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/can-you-build-me-an-app",
          "prev": "dojo4/when-was-the-last-time-you-heard-my-voice",
          "next": "dojo4/korean-release-the-click-clean-scorecard"
        }
      }
    },
    "dojo4/korean-release-the-click-clean-scorecard": {
      "author": "emily@dojo4.com",
      "title": "! 'Korean Release: The Click Clean Scorecard'",
      "published_at": "2015-11-19 04:06:02 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>Greenpeace has been at the forefront of a growing problem many of us haven’t really even thought about: the carbon footprint of our collective Internet use.  People, “the cloud” is actually on the ground, and it takes <a href=\"http://www.greenpeace.org/usa/global-warming/click-clean/#report\">A LOT of power to run it</a>.  That power can either come from clean or dirty sources, and Greenpeace has been out there for years actually measuring the flow of energy that fuels our streaming video, texted photos and websites.</p>\n\n<p>Greenpeace’s <a href=\"https://chrome.google.com/webstore/detail/click-clean-scorecard/kabglhocepgbnobnbhjalijemcipaoha\">Click Clean Scorecard</a> Chrome extension is the latest plugin, so to speak, in their <a href=\"http://www.greenpeace.org/usa/global-warming/click-clean/#report\">Click Clean Campaign</a>, which leverages consumer demand to compel corporations to switch to green energy sources. Now thanks to some serious nerd head-banging here at DOJO4, it now functions for Korean users in their native tongue.</p>\n\n<p><img src='/ro/dojo4/korean-release-the-click-clean-scorecard/assets/b.png' alt=\"Image 2015-11-11 at 11.24.18 오전.png\" /></p>\n\n<p>When you use the Click Clean Scorecard extension, a little cloud lights up red, yellow or green on your dashboard, indicating how the website you’re on scores in terms of their data power sourcing.  Click on the cloud, and you’ll see the details, but more importantly you’ll have a Tweet all written out for you that either congratulates or shames the responsible corporation for their stand on clean energy usage.</p>\n\n<pre><code>            ![tweet.jpg](assets/c.jpeg) \n</code></pre>\n\n<p>For all you armchair activists out there, let me tell you: those Tweets make a difference! Waaaaay back in 2011, Greenpeace estimated that global energy use for data/computing was equivalent to that of the 6th largest country in the world. The subsequent explosion of mobile device usage, streaming video and remote data storage has increased that usage exponentially. So, by today’s numbers, if we got the digital industry to go 100% renewable, it would be kind of like getting a nation the size of the United States to get off fossil fuels entirely. Pretty cool, huh?</p>\n\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/korean-release-the-click-clean-scorecard/assets/b.png",
          "path": "dojo4/korean-release-the-click-clean-scorecard/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 400,
            "height": 755
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/korean-release-the-click-clean-scorecard/assets/c.jpeg",
          "path": "dojo4/korean-release-the-click-clean-scorecard/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 300,
            "height": 300
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/korean-release-the-click-clean-scorecard",
        "type": "dojo4",
        "id": "korean-release-the-click-clean-scorecard",
        "urls": [
          "/ro/dojo4/korean-release-the-click-clean-scorecard/assets/b.png",
          "/ro/dojo4/korean-release-the-click-clean-scorecard/assets/c.jpeg",
          "/ro/dojo4/korean-release-the-click-clean-scorecard/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/korean-release-the-click-clean-scorecard",
          "prev": "dojo4/can-you-build-me-an-app",
          "next": "dojo4/jared-polis-representative-of-hate"
        }
      }
    },
    "dojo4/jared-polis-representative-of-hate": {
      "author": "mark@dojo4.com",
      "title": "! 'Jared Polis: Representative of Hate?'",
      "published_at": "2015-11-19 23:12:52 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/jared-polis-representative-of-hate/assets/b.png' alt=\"Screen Shot 2015-11-19 at 2.49.26 PM.png\" /> \nThe U.S.(eless) House of Representatives voted 289-137 today to more severely restrict Syrian and Iraqi refugees wanting to immigrate. Get that - they are restricting the ability for some of the world’s most vulnerable people (refugees are people) from relocating to our country.</p>\n\n<p>We’ve all seen this before, many, many times. We’ve heard the arguments about security. We know the racism of Japanese internment and some of Roosevelt’s decisions when Jews were trying to escape Nazi Germany.</p>\n\n<p>And we know Benjamin Franklin’s great quote: “Those who would give up essential Liberty, to purchase a little temporary Safety, deserve neither Liberty nor Safety.”</p>\n\n<p>The vote in itself is appalling to me - especially as the son of a Holocaust survivor whose family was denied access to the U.S. I am lucky to be alive.</p>\n\n<p>However, I cannot believe my House Representative Jared Polis, an openly gay man, was the only Democrat to vote in support of this measure. I have taken to Twitter today to demand an explanation for his vote, and this was his response:\n<img src='/ro/dojo4/jared-polis-representative-of-hate/assets/c.png' alt=\"Screen Shot 2015-11-19 at 2.26.44 PM.png\" /> \nRead what he is saying carefully.</p>\n\n<p>Here is my response: “I support allowing greater numbers of homosexuals to adopt children and improving our vetting system to ensure no pedophilia.” It uses his very logic, and I am only trying to make a point.</p>\n\n<p>His logic makes even less sense when you consider the current process:</p>\n\n<ul>\n  <li>takes two years</li>\n  <li>includes in-person interviews and supporting documents</li>\n  <li>has experience of conflict cross</li>\n  <li>checked against intelligence</li>\n  <li>and allows about 50% of applicants to get approved</li>\n</ul>\n\n<p>I am deeply saddened, disappointed and enraged by Representative Polis’ vote. Please join me in demanding he retract his position.</p>\n\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/jared-polis-representative-of-hate/assets/b.png",
          "path": "dojo4/jared-polis-representative-of-hate/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 1426,
            "height": 781
          },
          "src": null
        },
        "c.png": {
          "url": "/ro/dojo4/jared-polis-representative-of-hate/assets/c.png",
          "path": "dojo4/jared-polis-representative-of-hate/assets/c.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 591,
            "height": 103
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/jared-polis-representative-of-hate",
        "type": "dojo4",
        "id": "jared-polis-representative-of-hate",
        "urls": [
          "/ro/dojo4/jared-polis-representative-of-hate/assets/b.png",
          "/ro/dojo4/jared-polis-representative-of-hate/assets/c.png",
          "/ro/dojo4/jared-polis-representative-of-hate/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/jared-polis-representative-of-hate",
          "prev": "dojo4/korean-release-the-click-clean-scorecard",
          "next": "dojo4/doing-a-good-job"
        }
      }
    },
    "dojo4/doing-a-good-job": {
      "author": "emily@dojo4.com",
      "title": "Doing A Good Job",
      "published_at": "2015-11-30 17:10:15 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>Sometimes I get completely myopic about the to-do lists. Especially those ones at work, where I want to do a good job and be a team player (my team does a really, really good job).</p>\n\n<p>I need to remind myself from time to time that you can’t do a good job if your job is all you do, so recently I put all the responsibilities up on the shelf and visited some favorite places - Moab, San Francisco, Carbondale.</p>\n\n<p>Now I’m back, grateful for good work to do and the to-do list is front and center again.  Happy Monday, folks!</p>\n\n<p><img src='/ro/dojo4/doing-a-good-job/assets/b.jpeg' alt=\"Screen Shot 2015-11-30 at 9.56.22 AM.jpg\" /></p>\n\n<p><img src='/ro/dojo4/doing-a-good-job/assets/c.jpeg' alt=\"Screen Shot 2015-11-30 at 9.56.12 AM.jpg\" /></p>\n\n<p><img src='/ro/dojo4/doing-a-good-job/assets/d.jpeg' alt=\"Screen Shot 2015-11-30 at 10.07.47 AM.jpg\" /></p>\n\n<p><img src='/ro/dojo4/doing-a-good-job/assets/e.jpeg' alt=\"Screen Shot 2015-11-30 at 9.55.11 AM.jpg\" /></p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/doing-a-good-job/assets/b.jpeg",
          "path": "dojo4/doing-a-good-job/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1196,
            "height": 1200
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/doing-a-good-job/assets/c.jpeg",
          "path": "dojo4/doing-a-good-job/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1196,
            "height": 1198
          },
          "src": null
        },
        "d.jpeg": {
          "url": "/ro/dojo4/doing-a-good-job/assets/d.jpeg",
          "path": "dojo4/doing-a-good-job/assets/d.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1202,
            "height": 1196
          },
          "src": null
        },
        "e.jpeg": {
          "url": "/ro/dojo4/doing-a-good-job/assets/e.jpeg",
          "path": "dojo4/doing-a-good-job/assets/e.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1200,
            "height": 1198
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/doing-a-good-job",
        "type": "dojo4",
        "id": "doing-a-good-job",
        "urls": [
          "/ro/dojo4/doing-a-good-job/assets/b.jpeg",
          "/ro/dojo4/doing-a-good-job/assets/c.jpeg",
          "/ro/dojo4/doing-a-good-job/assets/d.jpeg",
          "/ro/dojo4/doing-a-good-job/assets/e.jpeg",
          "/ro/dojo4/doing-a-good-job/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/doing-a-good-job",
          "prev": "dojo4/jared-polis-representative-of-hate",
          "next": "dojo4/lets-kill-altruism"
        }
      }
    },
    "dojo4/lets-kill-altruism": {
      "author": "nate@dojo4.com",
      "title": "Let's Kill Altruism",
      "published_at": "2015-12-01 12:58:19 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/lets-kill-altruism/assets/b.jpeg' alt=\"tumblr_mtseryqG701rpowflo1_540.jpg\" /> \n“A train has two great attributes of life… motion and purpose,” I said, reading a line from Atlas Shrugged to a friend this past weekend. There’s something wildly attractive about honest, confident movement. I was explaining to a friend why the search for it is what drew me into entrepreneurship, and Kenya. Like other recently graduated twenty-something year olds I want motion and purpose, or in other words, I want to do good through a meaningful career.</p>\n\n<p>A couple of months ago, my search for it led me to ask some DOJO4 co-conspirators, “How can we destroy altruism?” We were wondering why we don’t see more people choosing a career that makes them happy and benefits society—something many of us want, right? There’s nothing inherently wrong with altruism. I’m pinning it as the culprit though because it prioritizes doing good for society before doing what is good for the individual when creating a meaningful career, which is just backwards. Ironically, I’ve seen it hinder both individuals and businesses from doing good.</p>\n\n<p>I’m writing from a small blue-doored car garage in the hills of Central Kenya. It’s owned by Raji, a six-foot-three, 200-plus pound Indian mechanic with a camouflage bandana on his head. I’m here because of a startup called <a href=\"http://www.efkgroup.co.ke/\">EFK Group</a>. Our truck broke down and he’s fixing it. He’s the best mechanic around. He gives me a Coca-Cola and asks me what I am writing about. I tell him and ask him what he thinks. “I’m good at fixing broken shit. So I do that.” “Do you like it?” “Yeah.” “Are you happy?” “Sure.”</p>\n\n<p>I caught a glimpse of motion and purpose in his demeanor and wished life was that simple. But it is. He helps people as a result of what he is good at, which led me to thinking, like Reid Hoffman in Startup of You explains, that a meaningful career is an entrepreneurial endeavor, and thus, altruism has nothing to do with it.</p>\n\n<p>Altruism is defined as “the belief in or practice of disinterested and selfless concern for the wellbeing of others.” (It’s not philanthropy or volunteering necessarily.) It’s giving without getting anything in return. It’s apathetic. There’s no desire for a feedback loop for learning, no mutual value exchanged. Creating a meaningful career is entrepreneurial and motivated by self interest, which is neither selfish nor altruistic.</p>\n\n<p>“I want,” in front of “to do good” is self interest before good. The real work for those looking for a meaningful career consists of asking hard questions, taking action, and defining a set of principles that will guide self interest—like a startup.</p>\n\n<p>Like a recycling plant pays people for collecting cans in cities, EFK Group, a locally owned and run startup in Kenya, pays people for collecting the fallen nuts from an indigenous tree called croton megalocarpus. They process the nut into three organic products that they sell back to local industry as a substitute for imported diesel oil, fertilizer, and animal feed.</p>\n\n<p>There’s a lack of funding for projects like these that the social impact space aims to fill. Since they’re in this space, they are often asked, “What problem are you solving? Who are your beneficiaries and how are you improving their lives? What impact metrics can you show?” Because the tree (and nut) has no previous economic value, it is traditionally cut down for firewood. But now people find economic value in it because they sell it to EFK Group. They are protecting existing trees and planting more. It is locally owned, employs local workers, and it also gives smallholder farmers, street kids, and housewives another source of income. It has a zero-waste manufacturing process because it uses every part of the nut.</p>\n\n<p>What problem are they not solving? Who are they not benefitting? They’re solving massive problems—from poverty to deforestation and climate change—but they didn’t start the business to solve any of those problems. They’re exploiting an opportunity and pursuing personal interests. Their efforts are guided by principles (i.e. don’t waste stuff, be honest, be kind, work hard, etc.) and logic, not good intentions or altruism.</p>\n\n<p>I don’t think impact metrics and goals harm businesses. If anything, they improve them because they encourage people to understand their customer more. But I can see how this could distract a high-performing business. If we were to say that EFK Group exists to improve the lives of farmers, that could limit potential avenues of growth that could positively affect other stakeholders more in the future.</p>\n\n<p>If I were a business, I’d go bankrupt because altruistic thinking had me prioritizing my search for what I thought would be good for society before what is good for me. Fact is, I neither understand what good is nor what it means—for myself or others—because as humans we have a limited capacity to fully grasp life, time and the systems in which we live. (Whenever we solve a problem, we create new ones—that’s progress, right?) Sure, I want to do good and help people, but just like a startup can’t scale impact without profits, I can’t do good without acquiring more and more knowledge and skills.</p>\n\n<p>Joan Didion said, “I write entirely to find out what I’m thinking, what I’m looking at, what I see and what it means.” That’s my purpose here. I think good is an externality of motion and purpose, which is a result of a principled pursuit of self interest.</p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/lets-kill-altruism/assets/b.jpeg",
          "path": "dojo4/lets-kill-altruism/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 540,
            "height": 556
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/lets-kill-altruism",
        "type": "dojo4",
        "id": "lets-kill-altruism",
        "urls": [
          "/ro/dojo4/lets-kill-altruism/assets/b.jpeg",
          "/ro/dojo4/lets-kill-altruism/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/lets-kill-altruism",
          "prev": "dojo4/doing-a-good-job",
          "next": "dojo4/grief-as-an-entrepreneurial-asset"
        }
      }
    },
    "dojo4/grief-as-an-entrepreneurial-asset": {
      "author": "corey@dojo4.com",
      "title": "grief as an entrepreneurial asset",
      "published_at": "2015-12-07 17:42:52 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/grief-as-an-entrepreneurial-asset/assets/b.jpeg' alt=\"goodgrief.jpg\" /></p>\n\n<p>As entrepreneurs we are often expected to tell a seamless and aggressively positive story about the dauntless progress and profit that our businesses are making and the unparalleled “solutions” we’re offering. “We’re killing it!” There should be no chink in the armor, not a moment of visible doubt. And there certainly shouldn’t be any breakdown into utter despair and grief.</p>\n\n<p>Yet, we run in our businesses in a world where every day people are being gunned down, exploded in the street, spurring on destructive cycles of hatred and confusion. We hear about both specific and general instances of environmental degradation on an unfathomable and possibly irreversible scale; people living in such systemic and wretched poverty that they are reduced to animal conditions. The news brings us an unceasing narrative of illnesses, natural disaster, and social disfunction reaping inconceivable levels of societal and personal loss. Furthermore, we are living with our own personal ups and downs, transitions, heartbreaks and losses.</p>\n\n<p>Through all this we are working hard, either not letting ourselves feel anything as destabilizing as grief, or at least not showing it. Letting that much be felt, or be shown being felt, is too uncontrollable, too uncomfortable, too vast. It’s easier to convey confidence and accomplishment by projecting a sense of comfort and ease. In this way, <a href=\"http://www.theguardian.com/sustainable-business/2014/oct/02/grieving-pathway-destructive-economic-system\">disassociation and numbness become the standard and we bury our grief deep within our subconscious</a>.</p>\n\n<p>However, that <strong>dissociation is the mark of a lost opportunity. We rob ourselves of the ability to see things clearly, to have insight and to act effectively with clear intention</strong>. By not feeling things we make ourselves numb to real risks and dangers, and cloud our awareness of what is really at stake. Rather than avoiding or hiding the raw grief that arises as part of living in our difficult world, going right into it may be the most helpful thing we can do - not only for ourselves but for <a href=\"http://dojo4\ncom/blog/program-like-you-give-a-damn\">ensuring that our businesses are providing solutions to real problems that truly matter</a>.</p>\n\n<blockquote>\n  <p><a href=\"http://www.yesmagazine.org/issues/climate-solutions/the-greatest-danger\">“In our culture, despair is feared and resisted because it represents a loss of control. We’re ashamed of it and dodge it by demanding instant solutions to problems. We seek the quick fix. This cultural habit obscures our perceptions and fosters a dangerous innocence of the real world.”</a> ~<a href=\"http://www.joannamacy.net/aboutjoannamacy.html\">Joanna Macy</a></p>\n</blockquote>\n\n<p>Here are a few reasons why good grieving is actually a powerful skill for entrepreneurs to cultivate:</p>\n\n<ol>\n  <li>\n    <p><strong>Connection</strong>. For entrepreneurs, relationships are everything and genuine connection is powerful. Allowing ourselves to feel grief enhances our ability to empathize with the suffering and circumstances of others, which is a precondition for deep connections - be they with family, team members, colleagues, clients or investors.</p>\n  </li>\n  <li>\n    <p><strong>Innovation</strong>. At its best our drive to innovate is fueled by real insight about what the world needs most and how we can best deliver that. From the acknowledgment of pain comes clear insight and a transformation in the way we see and understand the world around us.</p>\n\n    <blockquote>\n      <p><a href=\"https://www.brainpickings.org/2015/03/10/rilke-letters-to-a-young-poet-sadness/\">Great sadnesses…they are the moments when     something new has entered into us.</a> ~ Rainer Maria Rilke</p>\n    </blockquote>\n  </li>\n  <li>\n    <p><strong>Purpose</strong>. When it feels like all is lost, whatever is most important rises to the top. How often do we hear the story of <a href=\"http://news.nationalgeographic.com/energy/2015/10/151006-energy-drink-billionaire-wants-to-power-homes-with-bikes/\">the successful business mogul who gives it all up because they want to do something meaningful</a>? Many entrepreneurs go through their whole careers denying themselves the opportunity to actually feel the anguish in the world around them, and don’t get to do anything they actually care about until they reach some kind of crisis. By being available to that anguish we are empowering ourselves to lead purposeful organizations throughout our careers.</p>\n  </li>\n</ol>\n\n<p>There are, of course, many reasons why we don’t give ourselves up to grief - foremost of which is probably that it hurts. My own experience of heartbreak in its purest form is not lugubrious or depressive, but actually has a quality of cutting through distraction and superficiality. Clearly, we can’t very well walk around sobbing all the time, however we can acknowledge that this sadness is a sane reaction to a distressed world. We might be afraid that we’ll be overcome with the sheer force and vastness of our grief, but when we stop avoiding it we can actually receive its gifts. We <em>can</em> develop the capacity to grieve well, and to allow that grief to support us in our life’s work.</p>\n\n<blockquote>\n  <p><a href=\"http://peacethroughgrief.com/tag/thich-nhat-hanh/\">“Once we understand the art of suffering, we will suffer less.”</a> ~Thich Nhat Hanh</p>\n</blockquote>\n\n<p><small><em>Many thanks for the inspiration for this post to <a href=\"http://workthatreconnects.org/\">Joanna Macy</a>, the mistress of generative grief, and good, late night conversations with <a href=\"http://www.a-new-leaf.ca/New_Leaf/Bio.html\">Sera Thompson</a>, <a href=\"http://www.mindful.org/about-mindful/\">Claudia Chender</a> and <a href=\"http://www.goodworkcoaching.com/about-michael/\">Michael Rich</a>. And thanks, always, to <a href=\"http://dojo4.com/team/emily-utz\">Emily Utz</a> for her brilliant editing insights.</em></small></p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/grief-as-an-entrepreneurial-asset/assets/b.jpeg",
          "path": "dojo4/grief-as-an-entrepreneurial-asset/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 376,
            "height": 300
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/grief-as-an-entrepreneurial-asset",
        "type": "dojo4",
        "id": "grief-as-an-entrepreneurial-asset",
        "urls": [
          "/ro/dojo4/grief-as-an-entrepreneurial-asset/assets/b.jpeg",
          "/ro/dojo4/grief-as-an-entrepreneurial-asset/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/grief-as-an-entrepreneurial-asset",
          "prev": "dojo4/lets-kill-altruism",
          "next": "dojo4/community--dojo4--com"
        }
      }
    },
    "dojo4/community--dojo4--com": {
      "author": "corey@dojo4.com",
      "title": "community.dojo4.com",
      "published_at": "2015-12-08 21:38:24 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/community--dojo4--com/assets/b.png' alt=\"Logo_large_transparent.png\" /> \nSomething beautiful happened at dojo4 over these last 5+ years: we built a community. Countless people have come through our doors. We’ve shared meals, drinks, playlists, joys, tragedies, ideas, practical jokes, knowledge, feedback and connections. dojo4 has emerged as place that is home to many people, a place where we’re doing business in a new way, and a place where we are exploring what it means to do meaningful work.</p>\n\n<p>It’s been pretty amazing to have built a place where anyone can walk in the door and see where they might fit in, and recently we started talk about how we might open our community beyond our walls in Boulder, Colorado. In the spirit of doing <em>something</em> and not letting perfect be the enemy of good, we have thrown up <a href=\"http://community.dojo4.com/\">community.dojo4.com</a>: dojo4 community, open-sourced.</p>\n\n<p>It’s open. It’s can be used however is most useful to you. We’re hoping it will be used to bring people together around conversations about:</p>\n\n<ul>\n  <li>purposeful work</li>\n  <li>new ways of doing business</li>\n  <li>sharing technical and design skillz</li>\n  <li>sharing news, innovations and recommendations</li>\n  <li>opportunities (jobs, investments, connections)</li>\n  <li>things that we enjoy: travel, food, music, hidden gems</li>\n</ul>\n\n<p>We’re also hoping it will be used to discuss blog posts.</p>\n\n<p><img src='/ro/dojo4/community--dojo4--com/assets/c.png' alt=\"blog_talk.png\" /></p>\n\n<p>We’ve created a few categories that may (or may not) be evocative, and posted a few topics there. But inspiration and practicality trumps concept, so use it however it best suits.</p>\n\n<blockquote>\n  <p><a href=\"http://little-startup-handbook.dojo4.com/call-on-community\">None of us are as smart as all of us. ~Japanese proverb</a></p>\n</blockquote>\n\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/community--dojo4--com/assets/b.png",
          "path": "dojo4/community--dojo4--com/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 5253,
            "height": 1212
          },
          "src": null
        },
        "c.png": {
          "url": "/ro/dojo4/community--dojo4--com/assets/c.png",
          "path": "dojo4/community--dojo4--com/assets/c.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 1716,
            "height": 1390
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/community--dojo4--com",
        "type": "dojo4",
        "id": "community--dojo4--com",
        "urls": [
          "/ro/dojo4/community--dojo4--com/assets/b.png",
          "/ro/dojo4/community--dojo4--com/assets/c.png",
          "/ro/dojo4/community--dojo4--com/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/community--dojo4--com",
          "prev": "dojo4/grief-as-an-entrepreneurial-asset",
          "next": "dojo4/the-black-swan-theory"
        }
      }
    },
    "dojo4/the-black-swan-theory": {
      "author": "joel@dojo4.com",
      "title": "The Black Swan Theory",
      "published_at": "2015-12-19 00:55:33 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/the-black-swan-theory/assets/b.jpeg' alt=\"flock_of_swans-wblk.jpg\" /></p>\n\n<p>I’ve been working on my own since the beginning of 2014, running the <a href=\"http://blackswansounds.com\">Black Swan Sounds</a> record label (yes, those do still exist) out of my basement in south Boulder. It’s a pretty good gig, as gigs go, but this fall I was spinning my wheels, stuck in a rut I wasn’t sure how to get out of.</p>\n\n<p>In October, a friend offered me some office space in his warehouse in Boulder. A couple of other friends — an <a href=\"http://juliemaren.com\">artist</a> and a <a href=\"http://sarahchesnutt.com\">graphic designer</a> — were moving in as well, and it sounded like a great situation; my way out of the basement and into the light. But the rent, as cheap as it was (for Boulder or anywhere else), was out of reach for my meager record label budget. Sadly, I had to decline the offer.</p>\n\n<p>A couple of days later, I gave my longtime friend <a href=\"http://dojo4.com/team/mark-gelband\">Mark Gelband</a> a call. It had been a while since we’d spoken and I wanted to catch up. Sensing my mood and, as always, acting out of kindness, Mark said, “Come meet my friends at DOJO4. Bring your laptop, do some work, play some music, have some lunch.” I didn’t know anything about the place, but I trust Mark implicitly and gladly accepted his invitation.</p>\n\n<p>The next day, a Friday, I met up with Mark at <a href=\"http://caffeinatedmornings.com/\">Caffeinated Mornings</a>, where he introduced me to some of the founders and staff at Ello. We had a discussion about music that led to my starting a music community called <a href=\"http://ello.co/radiofreeello\">@radiofreeello</a>. Already, the day was off to a great start.</p>\n\n<p>We headed over to DOJO4 afterwards, and Mark introduced me to the friendly people there. I found a spot, opened my laptop, did some work, played some music (and, yes, had some lunch).</p>\n\n<p>Thanks to their warm and gracious hospitality, I felt at home from the get go. Perhaps it was <a href=\"http://dojo4.com/team/ara-t-howard\">Ara</a> and the others responding positively to the music I played that afternoon. Or, it may have been my awesome <a href=\"http://www.huffingtonpost.ca/2014/07/29/caucasians-t-shirt-tribe-called-red_n_5631865.html\">“Caucasians” t-shirt</a>. Whatever it was, at the end of the day, <a href=\"http://dojo4.com/team/corey-kohn\">Corey</a> invited me to keep coming back. “Get out of the basement. Do your work here. Play music for us.”</p>\n\n<p>It all sounded good to me, and for the last two months that’s what I’ve been doing. Going to the office instead of living at it. Feeding off and perhaps even contributing to the abundant energy flowing through that place. It was exactly the situation I’d been looking for, without even really knowing that I was looking for it. The last time I had that feeling was when I began volunteering at <a href=\"http://kgnu.org\">KGNU Community Radio</a> 25 years ago. That move led to a foundational shift in my life, cementing music as the center of it. Everything I’ve done since then stems from that.</p>\n\n<p>Now, thanks in large part to the unique taste in music that KGNU instilled in me, I’ve been welcomed into a new community and am already feeling that shift. Ideas are turning into plans. I see the opportunity to engage the primary aspects of what I’ve been doing for most of my life: sharing music as a way to create community, positively impact the world around me and, simply, spread joy.</p>\n\n<p>It’s all very cool and exciting. I’m honored, grateful and humbled to be the Resident DJ at DOJO4. It’s a great way to end the year, and has me amped for the big things yet to come.</p>\n\n<p>Today, Corey asked, “what’s the most unexpected thing that happened to you this year.” My answer came easily: landing at DOJO4. As I write this, it occurs to me that this was sort of a personal <a href=\"http://blackswanevents.org/?page_id=26\">“Black Swan event,”</a>. Auspicious (for me, anyway), as that’s part of the inspiration behind the Black Swan Sounds name.</p>\n\n<p>To celebrate (and demonstrate) this unforeseen and very welcome turn of events, here’s a mixtape of some of my favorite songs from 2015. Thanks for listening and Merry Everything.</p>\n\n<p><a href=\"https://www.mixcloud.com/BlackSwanSounds/merry-everything-a-special-friday-mixtape-18-december-2015/\">Merry Everything: A [special] Friday Mixtape</a></p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/the-black-swan-theory/assets/b.jpeg",
          "path": "dojo4/the-black-swan-theory/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1280,
            "height": 780
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/the-black-swan-theory",
        "type": "dojo4",
        "id": "the-black-swan-theory",
        "urls": [
          "/ro/dojo4/the-black-swan-theory/assets/b.jpeg",
          "/ro/dojo4/the-black-swan-theory/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/the-black-swan-theory",
          "prev": "dojo4/community--dojo4--com",
          "next": "dojo4/where-we-gave-in-2015"
        }
      }
    },
    "dojo4/where-we-gave-in-2015": {
      "author": "emily@dojo4.com",
      "title": "Where We Gave in 2015",
      "published_at": "2016-01-08 04:13:13 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>B Corp certification is the gold standard of <a href=\"http://www.roundpegcomm.com/how-the-b-corp-certification-provides-crucial-context/\">proof that your company is walking its talk</a>. But aside from affirming what you already do, the process of becoming a B Corp also compels you to <a href=\"http://little-startup-handbook.dojo4.com/be-generous\">clarify your values</a> and write them into the DNA of the company in the form of <a href=\"https://github.com/dojo4/policy/blob/master/hr.md\">policies and practices</a>.</p>\n\n<p>DOJO4 is doing this in quite a few areas, but my personal favorite is our new matching gifts program. Here are a few reasons why your company should start one, too:</p>\n\n<ol>\n  <li>\n    <p>“Generosity is the virtue that produces peace,” says Buddhism (and a lot of other spiritual traditions - Google it). Peace is good. The world could use more of it.</p>\n  </li>\n  <li>\n    <p>No gift is too small to make a difference (and it doubles in size as soon as you match it, anyway). In fact, nationwide <a href=\"https://gusto.com/blog/zenpayroll-giving/\">individuals donate over five times as much as all foundations combined</a>, representing 72% of all charitable giving (which in 2014 totaled about 316 billion!).</p>\n  </li>\n  <li>\n    <p>It’s easy as all get-out to have a matching gifts program. If you’re big, you can use a service like <a href=\"https://support.gusto.com/hc/en-us/articles/210107558-How-Can-My-Employees-Donate-to-Charities-\">Gusto</a>, which we love, and if you’re small you can do what we did and just alert the team in <a href=\"https://www.flowdock.com/features\">Flowdock</a> that you’ll match their gifts up to X amount; they can just add the donate url and amount to the thread and voila!</p>\n  </li>\n  <li>\n    <p>You will be a valuable asset to your community.  Interestingly, almost all of the organizations and causes that our team gave to were local, even though our work is international. It’s always good to give back where you live, and it’ll also raise your business’ profile among friends and neighbors.</p>\n  </li>\n  <li>\n    <p>In a business context, offering a matching gift program (or giving your team members a say in what your company gives to) is a great way to get to know each other in a way that often doesn’t happen during the daily grind. It was delightful and inspiring to see what moved our team members to give, and hear why they chose the causes they did.</p>\n  </li>\n</ol>\n\n<p>For us in 2015, that included:</p>\n\n<ul>\n  <li>\n    <p><a href=\"http://www.block1750.com/\">Block 1750</a></p>\n  </li>\n  <li>\n    <p><a href=\"http://bcap.org/\">Boulder County Aids Project</a></p>\n  </li>\n  <li>\n    <p><a href=\"http://www.boulderfoodrescue.org\">Boulder Food Rescue </a></p>\n  </li>\n  <li>\n    <p>Boulder Shelter for the Homeless <a href=\"http://www.bouldershelter.org/programs.bccares.html\">Boulder County Cares Program </a></p>\n  </li>\n  <li>\n    <p><a href=\"http://www.boulderwomenshealth.org/\">Boulder Valley Women’s Health</a>\n<a href=\"http://communityfoodshare.org/\">Community Food Share</a></p>\n  </li>\n  <li>\n    <p><a href=\"http://www.hopepantry.org/\">Harvest of Hope Pantry</a></p>\n  </li>\n  <li>\n    <p><a href=\"http://neweracolorado.org/\">New Era Colorado Foundation</a></p>\n  </li>\n  <li>\n    <p><a href=\"http://thecompassioncollective.org/\">The Compassion Collective</a></p>\n  </li>\n  <li>\n    <p><a href=\"urgentactionfund.org\">Urgent Action Fund for Women’s Human Rights</a></p>\n  </li>\n  <li>\n    <p>And a Go Fund Me Campaign for <a href=\"https://www.gofundme.com/zugey\">a local mom battling cancer</a>.</p>\n  </li>\n</ul>\n\n<p>So remember, a company can match gifts no matter how small you are or how small the gifts. In business, as in life, <a href=\"http://little-startup-handbook.dojo4.com/be-generous\">be generous and you will be prosperous</a>.</p>\n\n<p><img src='/ro/dojo4/where-we-gave-in-2015/assets/b.jpeg' alt=\"Screen Shot 2016-01-07 at 7.50.26 PM.jpg\" /></p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/where-we-gave-in-2015/assets/b.jpeg",
          "path": "dojo4/where-we-gave-in-2015/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 500,
            "height": 736
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/where-we-gave-in-2015",
        "type": "dojo4",
        "id": "where-we-gave-in-2015",
        "urls": [
          "/ro/dojo4/where-we-gave-in-2015/assets/b.jpeg",
          "/ro/dojo4/where-we-gave-in-2015/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/where-we-gave-in-2015",
          "prev": "dojo4/the-black-swan-theory",
          "next": "dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people"
        }
      }
    },
    "dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people": {
      "author": "corey@dojo4.com",
      "title": "family-friendly = business-friendly OR how to find good people",
      "published_at": "2016-01-08 22:14:42 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/b.jpeg' alt=\"blogLukeandFlo.jpg\" /></p>\n\n<p>One of the most rewarding opportunities we have as entrepreneurs is to build a dynamic, reliable and resilient team. And yet, hiring and retaining the “right people” is also one of the greatest challenges in business. Over the years of running dojo4, the most important lessons I’ve learned about building a truly wonderful team come down to these three guiding principles:</p>\n\n<ul>\n  <li>\n    <p><em><a href=\"http://little-startup-handbook.dojo4.com/hire-people-you-like\">hire people you’ll be happy to spend time with;</a></em></p>\n  </li>\n  <li>\n    <p><em>when it comes to hiring and firing, <a href=\"http://little-startup-handbook.dojo4.com/courageousness-conquers\">trust your gut</a> - even if it’s unconventional or inconvenient to do so;</em></p>\n  </li>\n  <li>\n    <p><em>and most importantly, people’s life experience is equally (if not more) valuable than their professional skills.</em></p>\n  </li>\n</ul>\n\n<p>Whether or not they have the appropriate skills on their resume, people who lead full and varied lives often have better social skills, greater emotional intelligence, psychological resilience and plasticity, <a href=\"http://little-startup-handbook.dojo4.com/never-lose-sight-of-the-big-picture\">a bigger perspective</a> and a <a href=\"http://little-startup-handbook.dojo4.com/call-on-community\">wider network of valuable connections</a>. My business is built almost entirely on the strength of these qualities in the team I work with.</p>\n\n<p>Although they certainly don’t have a corner on rich and varied life experiences, I’ve found that parents have often developed many of these invaluable traits in the process of having and raising children. Families have been immeasurably integral and valuable to our business.  In the open-sourced, dojo4 <a href=\"https://github.com/dojo4/policy/blob/master/family-friendly_workplace_manifesto\">Family-Friendly Workplace Manifesto</a> we note that parents tend to be some of our most valuable team members because:</p>\n\n<ul>\n  <li>\n    <p><em>they are conditioned for hard work and a relentless schedule;</em></p>\n  </li>\n  <li>\n    <p><em>they have a lot at stake and are likely to be working with the world their kids will inherit in mind;</em></p>\n  </li>\n  <li>\n    <p><em>their home lives emphasize the need for clear decision-making, collaboration and the invaluable ability to play well with others.</em></p>\n  </li>\n</ul>\n\n<p><a href=\"http://www.huffingtonpost.com/kiri-westby/a-mothers-resumebecause-i_b_8901326.html\">A parent’s resume</a> also usually includes years of experience honing applicable skills such as the ability to multitask, attention to detail, negotiation and diplomacy, humility and empathy. The competitive advantages of running a family-friendly workplace are <a href=\"http://images.huffingtonpost.com/2016-01-01-1451613159-9989301-AMothersResume1.png\">persuasive</a>.</p>\n\n<p>Supporting families in the workplace provides direct financial benefit to your company through cost-saving retention of employees and their institutional knowledge. This view recently made headlines when Vodaphone revised its parental leave policy to offer <a href=\"http://adage.com/article/agency-news/huge-investing-moms-good-business/298398/\">at least 16 weeks paid maternity leave and full pay for 30-hour work weeks in the six months following their return</a>. Their video <a href=\"https://www.youtube.com/watch?v=FpxYpymkyt8\">Maternomics</a> argues that businesses that view maternity leave as a loss, are letting the valuable resource of working mothers slip through their hands.</p>\n\n<p>As entrepreneurs, in order to take advantage of the human resource of parents, we have to advocate for two things:</p>\n\n<ul>\n  <li>hiring and supporting parents</li>\n  <li>offering <strong><a href=\"http://www.lifehack.org/310307/why-companies-should-value-parental-leave-for-both-men-and-women\">paid parental leave</a></strong></li>\n</ul>\n\n<p>Before you say, “That’s all well and good but I’m financially responsible to my shareholders and benefits like paid parental leave will never fly,” you might be interested to know that more and more <a href=\"http://www.xconomy.com/national/2014/07/21/sexism-and-misogyny-in-tech-how-investors-can-help-drive-change/\">experienced investors</a> agree with Vodaphone. In a survey of almost 100 tech companies, <a href=\"http://women2.com/2014/05/05/establishing-maternity-leave-policies-help-startups-close-gender-gap/\">one study</a> found that while 0% of seed-funded companies have a maternity or paternity policy, 50% of funded startups began implementing such policies at Series A; and 100% of startups put both in place by the Series D and post-IPO stages.</p>\n\n<p><a href=\"https://www.themuse.com/advice/hey-startups-why-you-should-think-about-your-maternity-leave-policy-now\">Even a small business is likely to lose money on retention costs and efforts to maintain a healthy workplace culture</a> in the long run if they are not able to offer support to new parents.  Astute employees and <a href=\"http://www.nytimes.com/2015/04/08/upshot/silicon-valley-perks-for-some-workers-struggles-for-parents.html?abt=0002&amp;abg=0\">prospective hires</a> will value parental leave benefits and the sacrifices it may take to offer them - and smart, fair-minded people like these are the ones you want on your team.</p>\n\n<p>Cultivating family-friendly workplaces means cultivating more profitable, effective and efficient workplaces. <a href=\"http://dojo4.com/blog/family-friendly-workplace-manifesto\">A workplace that values families, is a happier, more realistic and more sustainable workplace. It is more likely to retain good employees. It is more likely to generate good will, a resource that can be drawn on when it is needed most.</a> And whether or not doing this is a matter of social responsibility, it is an opportunity that entrepreneurs cannot afford to miss.</p>\n\n<p><img src='/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/c.jpeg' alt=\"blogNat-dojo-hat.jpeg\" /></p>\n\n<p><small><em>Stay tuned for our next post on what running a family-friendly workplace actually looks like, written by my collaborator and editor, <a href=\"http://dojo4.com/team/emily-utz\">Emily Utz</a>.</em></small></p>\n\n<p><img src='/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/d.png' alt=\"FamilyFriendlyWorkplaceManifesto.png\" /></p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/b.jpeg",
          "path": "dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 864,
            "height": 864
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/c.jpeg",
          "path": "dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 864,
            "height": 864
          },
          "src": null
        },
        "d.png": {
          "url": "/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/d.png",
          "path": "dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/d.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 2550,
            "height": 3300
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people",
        "type": "dojo4",
        "id": "family-friendly-equals-business-friendly-or-how-to-find-good-people",
        "urls": [
          "/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/b.jpeg",
          "/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/c.jpeg",
          "/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/assets/d.png",
          "/ro/dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people",
          "prev": "dojo4/where-we-gave-in-2015",
          "next": "dojo4/the-sekrets-gem"
        }
      }
    },
    "dojo4/the-sekrets-gem": {
      "author": "spike@dojo4.com",
      "title": "The Sekrets Gem",
      "published_at": "2016-01-29 16:39:07 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>(This post originally appears on Spike’s <a href=\"http://stuff-things.net/\">Stuff… And Things… blog</a>)</p>\n\n<p>I occasionally write about encryption in Ruby, yet somehow I haven’t managed to cover the Dojo’s own <a href=\"https://github.com/ahoward\">Ara’s</a> <a href=\"https://github.com/ahoward/sekrets\">Sekrets</a> gem.</p>\n\n<p>Sekrets provides a simple interface to create and manage encrypted files in Ruby. It’s raison d’être is to make it reasonably painless to store sensitive data, API keys and the like, in Git repos and then access that data inside your Rails app, both in development and production.  <!-- more --> Like all good gems, it just need to be added to your Gemfile:</p>\n\n<div class=\"language-ruby highlighter-rouge\"><code class='code' style='white-space:pre;'><div class='code-line code-line-1'><span style=\"color: #24292f;background-color: #f6f8fa\">gem</span>&nbsp;<span style=\"color: #0a3069\">'sekrets'</span>\n</div></code></div>\n\n<p>And followed up with <code>bundle install</code>. This will add a couple of <em>rake</em> tasks, start with:</p>\n\n<pre><code>rake sekrets:generate:key\n</code></pre>\n\n<p>This creates a <code>.sekrets.key</code> file in application’s root directory. It contains a randomly generated password and is what will allow us to automatically decrypt the encrypted configuration file. If you work with a team, you might want to replace that password with something more easily communicated, just do so before you run the next step.</p>\n\n<p>We want this file to exist in development, and to be available to our deploy, but putting it in the Git repo would defeat the purpose, so this step also adds <code>.sekrets.key</code> to your <code>.gitignore</code>.</p>\n\n<p>To reiterate, <code>.sekrets.key</code> should not be committed to your repo.</p>\n\n<p>Next run:</p>\n\n<pre><code>rake sekrets:generate:config\n</code></pre>\n\n<p>This creates <code>config/sekrets.yml.enc</code>, encrypted with the key in <code>.sekrets.key</code> and sets up <code>config/initializers/sekrets.rb</code>.</p>\n\n<p><code>config/sekrets.yml.enc</code> is an encrypted YAML file. This is where you store whatever data we wish to keep secret:</p>\n\n<div class=\"language-yaml highlighter-rouge\"><code class='code' style='white-space:pre;'><div class='code-line code-line-1'><span style=\"color: #953800\">---</span>\n</div><div class='code-line code-line-2'><span style=\"color: #116329\">api_key</span><span style=\"color: #24292f;background-color: #f6f8fa\">:</span>&nbsp;<span style=\"color: #0550ae\">42</span>\n</div><div class='code-line code-line-3'><span style=\"color: #116329\">aws</span><span style=\"color: #24292f;background-color: #f6f8fa\">:</span>\n</div><div class='code-line code-line-4'>&nbsp;&nbsp;<span style=\"color: #116329\">access_key_id</span><span style=\"color: #24292f;background-color: #f6f8fa\">:</span>&nbsp;<span style=\"color: #0a3069\">XXXXXXXXXXXXXXXXXXXX</span>\n</div><div class='code-line code-line-5'>&nbsp;&nbsp;<span style=\"color: #116329\">secret_access_key</span><span style=\"color: #24292f;background-color: #f6f8fa\">:</span>&nbsp;<span style=\"color: #0a3069\">YYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY</span>\n</div><div class='code-line code-line-6'><span style=\"color: #116329\">the_list_of_my_enemies</span><span style=\"color: #24292f;background-color: #f6f8fa\">:</span>&nbsp;<span style=\"color: #24292f;background-color: #f6f8fa\">[</span><span style=\"color: #0a3069\">'</span><span style=\"color: #0a3069\">Bob'</span><span style=\"color: #24292f;background-color: #f6f8fa\">,</span><span style=\"color: #0a3069\">'</span><span style=\"color: #0a3069\">Kevin'</span><span style=\"color: #24292f;background-color: #f6f8fa\">,</span><span style=\"color: #0a3069\">'</span><span style=\"color: #0a3069\">Stuart'</span><span style=\"color: #24292f;background-color: #f6f8fa\">]</span>\n</div><div class='code-line code-line-7'><span style=\"color: #116329\">winter_is_coming</span><span style=\"color: #24292f;background-color: #f6f8fa\">:</span>&nbsp;<span style=\"color: #0550ae\">true</span>\n</div></code></div>\n\n<p>You can edit the file with:</p>\n\n<pre><code>sekrets edit config/sekrets.yml.enc\n</code></pre>\n\n<p>Or view it with:</p>\n\n<pre><code>sekrets read config/sekrets.yml.enc\n</code></pre>\n\n<p>The initializer sets up a global constant <code>SEKRETS</code>. If the <code>.sekrets.key</code> file exists, then it’s populated with the values from <code>config/sekrets.yml.enc</code>:</p>\n\n<div class=\"language-ruby highlighter-rouge\"><code class='code' style='white-space:pre;'><div class='code-line code-line-1'><span style=\"color: #953800\">SEKRETS</span><span style=\"color: #24292f;background-color: #f6f8fa\">[</span><span style=\"color: #0a3069\">:aws</span><span style=\"color: #24292f;background-color: #f6f8fa\">]</span>\n</div><div class='code-line code-line-2'><span style=\"color: #0550ae\">=&gt;</span>&nbsp;<span style=\"color: #24292f;background-color: #f6f8fa\">{</span><span style=\"color: #0a3069\">\"access_key_id\"</span><span style=\"color: #0550ae\">=&gt;</span><span style=\"color: #0a3069\">\"XXXXXXXXXXXXXXXXXXXX\"</span><span style=\"color: #24292f;background-color: #f6f8fa\">,</span>\n</div><div class='code-line code-line-3'>&nbsp;&nbsp;&nbsp;&nbsp;<span style=\"color: #0a3069\">\"secret_access_key\"</span><span style=\"color: #0550ae\">=&gt;</span><span style=\"color: #0a3069\">\"YYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY\"</span><span style=\"color: #24292f;background-color: #f6f8fa\">}</span>\n</div></code></div>\n\n<p>(SEKRETS is actually a <a href=\"https://github.com/ahoward/map\">Map</a>, a kind of smart Hash, so you can also get values by method <code>SEKRETS.aws</code> or <code>SEKRETS.winter_is_coming?</code>)</p>\n\n<p>Now all that sensitive data your app needs is in the repo and moves around with it. However, if someone gets access to the repo, without the key, they still don’t have access to your secrets. All you need do when bringing on a new developer is have them put the key in the <code>.sekrets.key</code> file on their local machine.</p>\n\n<p>That takes care of development, what about production? Sekrets gives you two options. First, you can set <code>SEKRETS_KEY</code> in your web servers environment, in much the same way people typically make sensitive information available outside of their code base. Alternatively, if you use Capistrano, you can add <code>require 'sekrets/capistrano'</code> to your <code>Capfile</code>. This adds a task that copies the <code>.sekrets.key</code> to the server on deploy.</p>\n\n<p>With either method, when the App boots, Sekrets will find it’s key, decrypt the config file and set up the <code>SEKRETS</code> constant.</p>\n\n<p>It should be obvious, that your sekrets, sorry, secrets are only as secure as your server. Someone with access to the server can recover the <code>SEKRETS_KEY</code> environmental variable or <code>.sekrets.key</code> file and use it to decrypt the sekrets.</p>\n\n<p>However, this is really no different than the common approach of putting sensitive things, like API keys, in the web server environment and accessing them through <code>ENV</code> in the app. In fact, setting <code>SEKRETS_KEY</code> in environment is exactly the same approach.</p>\n\n<p>Ultimately, if sensitive data is on the server and in a form that can be accessed by your software, then it’s only as secure as the server. Sekrets doens’t solve that problem. What it does do is get that data under revision control in a secure way and simplify sharing that data between developers. And that’s a big win.</p>\n\n</div>\n",
      "assets": {},
      "_meta": {
        "identifier": "dojo4/the-sekrets-gem",
        "type": "dojo4",
        "id": "the-sekrets-gem",
        "urls": [
          "/ro/dojo4/the-sekrets-gem/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/the-sekrets-gem",
          "prev": "dojo4/family-friendly-equals-business-friendly-or-how-to-find-good-people",
          "next": "dojo4/meaningful-connection-equals-purposeful-business"
        }
      }
    },
    "dojo4/meaningful-connection-equals-purposeful-business": {
      "author": "corey@dojo4.com",
      "title": "meaningful connection = purposeful business",
      "published_at": "2016-03-02 21:31:54 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/meaningful-connection-equals-purposeful-business/assets/b.jpeg' alt=\"51a1164c6e1021cf9c5c7ad78029c095.jpg\" /> \nSo, what’s the point of business? For a long time I thought the point of <a href=\"http://dojo4.com/\">my business</a> was simply to design and develop software for clients and make money in the process. That turned out not to be true.</p>\n\n<p><a href=\"http://www.stuartmcmillen.com/comics_en/war-on-drugs/\">Milton Friedman</a>, practicalist and Nobel Prize winning economist, said the point of business maximizing profit for the shareholders. Management visionary, <a href=\"http://www.entrepreneur.com/article/237484\">Peter Druker</a>, said the point of business is to \ncreate a customer. And <a href=\"https://www.simpsonsworld.com/video/441732675508\">Richard Branson</a>, says the whole point of business is to make a difference in the world.</p>\n\n<p>I believe that as entrepreneurs that our fundamental, core mission is to <strong>connect</strong>. Simplistically, that may mean connecting people with services, connecting people with products, connecting people with people, connecting people with information, etc. However, there’s a difference between connection and <em>meaningful connection</em>. That being the case, then there’s an important element to examine in our mission to connect- what is that difference? What is the difference between just plain ol’ connection and meaningful connection.</p>\n\n<p>In my experience, essentially what makes that point of connection <em>meaningful</em> is when it is based in <strong>purpose</strong>. But in order to know that purpose, we each have to do the work to find out what is deeply meaningful for each of us, personally. We have to connect with ourselves, our motivations, fears, personal challenges, advantages, strengths and weaknesses, aspirations and inspirations.</p>\n\n<p>What makes us feel that we are living a good life? What makes us come alive? What makes us feel grateful and appreciative of our day-to-day? What fuels our ambition, imagination, and desire to work hard? If we know that, then that sense of meaning and purpose will imbue every connection and carry outward.</p>\n\n<p>Doing this investigation into what our purpose is, and what the purpose of our business really is,  is an opportunity that we have as entrepreneurs. It’s an opportunity to take this fundamental mission to connect people with something they need (or something we think they need) in a more meaningful way. And people can tell the difference when these connections are meaningful. Meaningful connections are good for us, good for our colleagues and employees, good for our customers, and ultimately good for business!</p>\n\n<p>We have everything we need to investigate the real purpose of our businesses and make meaningful connections.  We have the ability to listen to ourselves and others. We have the ability to empathize, to acknowledge our own and each other’s obstacles, grief, humanness. And we have the ability to connect with our own authenticity.</p>\n\n<p>We have an opportunity to make each point of connection more meaningful, more lasting, more enriching. We have the opportunity to blow things open at that moment of connection and to change people’s minds about what that connection is. And we have the opportunity to change our own minds about what that connection is. By having a firm foundation in our own sense of purpose for our businesses, we will bring alive each connection, each sale, each service, each interaction with coworkers, clients, and competitors. I believe that if we want to have successful businesses, truly successful businesses, that this isn’t just preferable, but <em>necessary</em>.</p>\n\n<p>Peter Drucker said: <a href=\"http://www.druckerinstitute.com/2013/04/purpose-of-purpose/\">“The number of people who are really motivated by money is very small. Most people need to feel that they are here for a purpose, and unless an organization can connect to this need to leave something behind that makes this a better world… it won’t be successful over time.”</a></p>\n\n<p>I found out that point of my business isn’t actually to make technology for clients - that’s just the vehicle. The purpose of my business is to cultivate meaningful relationships, it’s to support the people and the families that work within my business, it’s about creating community and expansive human environments.  I found out that <a href=\"http://dojo4.com/about\">the mission of my business, dojo4</a>, is to apply rigorous minds to meaningful work, change the way business is done and cultivate purposeful projects, relationships and environments.</p>\n\n<p>We can all find ways to imbue our work, our businesses, and thus our communities with meaningful and powerful connections. We all do it in different ways because each of us is motivated by different purposes. We always have the opportunity to connect to ourselves and our sense of purpose. And that ability to connect to purpose makes our businesses create meaningful connections that do good for our colleagues, our clients, our competitors and, ultimately, our entire communities.</p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/meaningful-connection-equals-purposeful-business/assets/b.jpeg",
          "path": "dojo4/meaningful-connection-equals-purposeful-business/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 640,
            "height": 500
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/meaningful-connection-equals-purposeful-business",
        "type": "dojo4",
        "id": "meaningful-connection-equals-purposeful-business",
        "urls": [
          "/ro/dojo4/meaningful-connection-equals-purposeful-business/assets/b.jpeg",
          "/ro/dojo4/meaningful-connection-equals-purposeful-business/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/meaningful-connection-equals-purposeful-business",
          "prev": "dojo4/the-sekrets-gem",
          "next": "dojo4/these-are-12-of-my-favorite-things"
        }
      }
    },
    "dojo4/these-are-12-of-my-favorite-things": {
      "author": "ara@dojo4.com",
      "title": "these are 12 of my favorite things",
      "published_at": "2016-04-06 15:50:56 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src=\"http://s3.amazonaws.com/drawohara.com.images/all.jpg\" alt=\"\" /></p>\n\n<p>One of the super sweet things we have going at DOJO4 is that we have a house D.J. - <a href=\"https://twitter.com/blackswansounds\">Joel Davis</a></p>\n\n<p><img src=\"https://static.wixstatic.com/media/18019e_f52af4a4192b497195902a293aa012ed.jpg/v1/fill/w_475,h_526,al_c,q_80,usm_0.66_1.00_0.01/18019e_f52af4a4192b497195902a293aa012ed.jpg\" alt=\"\" /></p>\n\n<p>It isn’t super complicated - basically Joel:</p>\n\n<ul>\n  <li>\n    <p>hangs out in the office running his record company <a href=\"http://www.blackswansounds.com/\">Black Swan Sounds</a></p>\n  </li>\n  <li>\n    <p>jams a bunch of good tunes into the Sonos queue</p>\n  </li>\n</ul>\n\n<p>As you can imagine this complicated arrangement took years of contract negotiations between our legal teams but, basically, we feel like DOJO4 is winning the situation.</p>\n\n<p>Kidding aside, music is very important to me, as a person, and as a developer.  One of my favorite interview questions is:</p>\n\n<p><i>“Show me your music collection.”</i></p>\n\n<p>It’s well known that many musicians become great programmers and that having a musical mind is a good predictor of having the combination of analytical plus creative talents that weaves great code together.  put another way, if you listen to shitty music you probably write shitty code too.</p>\n\n<p>So, when Joel dropped this on FaceBook</p>\n\n<p><img src='/ro/dojo4/these-are-12-of-my-favorite-things/assets/b.png' alt=\"\" /></p>\n\n<p>I knew I had to drop what I was doing and comb through my music collection (did I mention that some programmers I, er, know are also often OCD?) …</p>\n\n<p>Before revealing my list I want preface it by saying two things:</p>\n\n<ul>\n  <li>\n    <p>These are 12 of my favorite <em>complete albums</em>, not tracks, not songs.  Albums.</p>\n  </li>\n  <li>\n    <p>I listen to a TON of electronic music and couldn’t help noticing that none of it fit here.  It isn’t that I don’t have many favorite sets - I just don’t consider them albums, sets are a different kind of collection IMHO.</p>\n  </li>\n</ul>\n\n<p>So, without further adieu here they are, 12 complete albums that I dig:</p>\n\n<h3 id=\"miles-davis--kind-of-blue--httpsenwikipediaorgwikikind_of_blue\">Miles Davis / Kind of Blue / <a href=\"https://en.wikipedia.org/wiki/Kind_of_Blue\" target=\"_blank\">https://en.wikipedia.org/wiki/Kind_of_Blue</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/9/9c/MilesDavisKindofBlue.jpg\" alt=\"\" /></p>\n\n<p>One of my favorite work albums of all time.  Nothing beats it for late night concentration.</p>\n\n<h3 id=\"doc-watson--the-watson-family--httpsenwikipediaorgwikithe_watson_family\">Doc Watson / The Watson Family / <a href=\"https://en.wikipedia.org/wiki/The_Watson_Family\" target=\"_blank\">https://en.wikipedia.org/wiki/The_Watson_Family</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/0/0f/TheWatsonFamily2.jpg\" alt=\"\" /></p>\n\n<p>My first dog was named ‘Shady’ after ‘Shady Grove’ and I’ve been listening to this album ever since I was a little boy.</p>\n\n<h3 id=\"dinosaur--youre-living-all-over-me--httpsenwikipediaorgwikiyou27re_living_all_over_me\">Dinosaur / You’re Living All Over Me / <a href=\"https://en.wikipedia.org/wiki/You%27re_Living_All_Over_Me\" target=\"_blank\">https://en.wikipedia.org/wiki/You%27re_Living_All_Over_Me</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/d/de/Dinosaur_Jr._You%27re_Living_All_Over_Me.jpg\" alt=\"\" /></p>\n\n<p>My wife hates this one but I love the raw energy Jay belts out on the guitar.   I’ve ridden and skied many many miles to these sounds.</p>\n\n<h3 id=\"janes-addiction--nothings-shocking--httpsenwikipediaorgwikinothing27s_shocking\">Jane’s Addiction / Nothing’s Shocking / <a href=\"https://en.wikipedia.org/wiki/Nothing%27s_Shocking\" target=\"_blank\">https://en.wikipedia.org/wiki/Nothing%27s_Shocking</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/f/f2/NothingsShocking.jpg\" alt=\"\" /></p>\n\n<p>This was a favorite, along with their first album in high school when friends were listening to ‘Def Leppard’ and represents a point in my life when I really started wanted to hear new and different sounds.</p>\n\n<h3 id=\"dead-can-dance--into-the-labryinth--httpsenwikipediaorgwikiinto_the_labyrinth_dead_can_dance_album\">Dead Can Dance / Into The Labryinth / <a href=\"https://en.wikipedia.org/wiki/Into_the_Labyrinth_(Dead_Can_Dance_album)\" target=\"_blank\">https://en.wikipedia.org/wiki/Into_the_Labyrinth_(Dead_Can_Dance_album)</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/b/bf/Into_labyrinth_-_dead_can_dance.jpg\" alt=\"\" /></p>\n\n<p>I keep coming back to this genre defying album.  It was a favorite ‘homework album’ in college and high school.</p>\n\n<h3 id=\"beastie-boys--pauls-boutique--httpsenwikipediaorgwikipaul27s_boutique\">Beastie Boys / Paul’s Boutique / <a href=\"https://en.wikipedia.org/wiki/Paul%27s_Boutique\" target=\"_blank\">https://en.wikipedia.org/wiki/Paul%27s_Boutique</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/0/07/BeastieBoysPaul%27sBoutique.jpg\" alt=\"\" /></p>\n\n<p>The greatest album of all time.  Q.E.D.</p>\n\n<h3 id=\"johnny-cash--at-folsom-prison-live--httpsenwikipediaorgwikiat_folsom_prison\">Johnny Cash / At Folsom Prison (Live) / <a href=\"https://en.wikipedia.org/wiki/At_Folsom_Prison\" target=\"_blank\">https://en.wikipedia.org/wiki/At_Folsom_Prison</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/b/bf/Johnny_Cash_At_Folsom_Prison.jpg\" alt=\"\" /></p>\n\n<p>This album represents the west and every great hip-hop album all at once.  Definitely the first time anyone called anything ‘Bas Ass’.</p>\n\n<h3 id=\"prince--purple-rain--httpsenwikipediaorgwikipurple_rain_album\">Prince / Purple Rain / <a href=\"https://en.wikipedia.org/wiki/Purple_Rain_(album)\" target=\"_blank\">https://en.wikipedia.org/wiki/Purple_Rain_(album)</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/9/9c/Princepurplerain.jpg\" alt=\"\" /></p>\n\n<p>I don’t think anyone can love music and not love Prince.  Especially if they are in a hot and heavy make-out-session with a sophomore girlfriend (or boyfriend) (or both).</p>\n\n<h3 id=\"pixies--doolittle--httpsenwikipediaorgwikidoolittle_album\">Pixies / Doolittle / <a href=\"https://en.wikipedia.org/wiki/Doolittle_(album)\" target=\"_blank\">https://en.wikipedia.org/wiki/Doolittle_(album)</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/6/6b/Pixies-Doolittle.jpg\" alt=\"\" /></p>\n\n<p>My wife loves this album.  And I love my wife.  And the Pixies just fucking rock.</p>\n\n<h3 id=\"bob-marley--the-wailers--rastaman-vibration-httpsenwikipediaorgwikirastaman_vibration\">Bob Marley &amp; The Wailers / Rastaman Vibration <a href=\"https://en.wikipedia.org/wiki/Rastaman_Vibration\" target=\"_blank\">https://en.wikipedia.org/wiki/Rastaman_Vibration</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/6/66/BobMarley-RastamanVibration.jpg\" alt=\"\" /></p>\n\n<p>Bob’s greatest if you ask me, and proof of the global impact music can make on politics.</p>\n\n<h3 id=\"rolling-stones--tattoo-you--httpsenwikipediaorgwikitattoo_you\">Rolling Stones / Tattoo You / <a href=\"https://en.wikipedia.org/wiki/Tattoo_You\" target=\"_blank\">https://en.wikipedia.org/wiki/Tattoo_You</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/1/16/TattooYou81.jpg\" alt=\"\" /></p>\n\n<p>Best cover.  Best liner.   ‘Waiting On A Friend’ - sooooo smooth.</p>\n\n<h3 id=\"the-beatles--abbey-road--httpsenwikipediaorgwikiabbey_road\">The Beatles / Abbey Road / <a href=\"https://en.wikipedia.org/wiki/Abbey_Road\" target=\"_blank\">https://en.wikipedia.org/wiki/Abbey_Road</a></h3>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/en/4/42/Beatles_-_Abbey_Road.jpg\" alt=\"\" /></p>\n\n<p>I cruised through the first 11, as Joel had asked, but picking the last one really took some thought.  I went through Kendrick Lamar, Neutral Milk Hotel, Led Zeppelin, Theivery Corporation, Die Antwoord, Emmylou Harris, and the Flaming Lips… But couldn’t settle.</p>\n\n<p>Ultimately I picked this one because it was the first album I ever owned - my dad gave me a tape player with one tape, ‘Abbey Road’, that was purple on one side and white on the other.  I listened to that tape until it was worn out and still think that the b-side of ‘Abbey Road’ is one of the most inspiring sets in history.</p>\n\n<hr />\n\n<p>So, there you have it.  Thanks for inspiring such a fun mental exercise Joel!</p>\n\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/these-are-12-of-my-favorite-things/assets/b.png",
          "path": "dojo4/these-are-12-of-my-favorite-things/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 762,
            "height": 696
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/these-are-12-of-my-favorite-things",
        "type": "dojo4",
        "id": "these-are-12-of-my-favorite-things",
        "urls": [
          "/ro/dojo4/these-are-12-of-my-favorite-things/assets/b.png",
          "/ro/dojo4/these-are-12-of-my-favorite-things/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/these-are-12-of-my-favorite-things",
          "prev": "dojo4/meaningful-connection-equals-purposeful-business",
          "next": "dojo4/dojo4-s-got-answers"
        }
      }
    },
    "dojo4/dojo4-s-got-answers": {
      "author": "corey@dojo4.com",
      "title": "dojo4's got answers",
      "published_at": "2016-04-06 21:36:47 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/dojo4-s-got-answers/assets/b.jpeg' alt=\"Answers.jpg\" /></p>\n\n<p><img src='/ro/dojo4/dojo4-s-got-answers/assets/c.jpeg' alt=\"answersCU.jpg\" /></p>\n\n<p>You’ve got questions, we’ve got answers! But they’ll cost you. 25 cents to be exact.</p>\n\n<p>In collaboration with the inimitable <a href=\"http://youtu.be/cT0pGKaPdLc\">Spike Ilacqua</a>, dojo4 is now offering illuminating answers to any curious passerby in need, for the mere price of a gum-ball.</p>\n\n<p>Currently, answers are dispensed only during business hours, but you can look forward 24-access answers soon. And once this batch of useful and applicable answers has been dished out, we will be supplying our worthy community with tiny-art, at the same low, low price. <em>(Please note: we are now in soliciting tiny art for the tiny-art and answer dispenser. So if you are a tiny artist and would like to contribute, please send an example of your submission to <a href=\"mailto:tinyart@dojo4.com\" target=\"_blank\">tinyart@dojo4.com</a> asap. Fame and appreciation await you.)</em></p>\n\n<p>Our answers have been extremely popular. Come by 2030 17th St., Boulder, CO and get your’s soon. Available while supplies last.</p>\n\n<p><img src='/ro/dojo4/dojo4-s-got-answers/assets/d.jpeg' alt=\"WindyAnswers.jpeg\" /></p>\n\n<p><img src='/ro/dojo4/dojo4-s-got-answers/assets/e.jpeg' alt=\"answeruser1.jpg\" /></p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/dojo4-s-got-answers/assets/b.jpeg",
          "path": "dojo4/dojo4-s-got-answers/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 640,
            "height": 640
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/dojo4-s-got-answers/assets/c.jpeg",
          "path": "dojo4/dojo4-s-got-answers/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 640,
            "height": 640
          },
          "src": null
        },
        "d.jpeg": {
          "url": "/ro/dojo4/dojo4-s-got-answers/assets/d.jpeg",
          "path": "dojo4/dojo4-s-got-answers/assets/d.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 4032,
            "height": 3024
          },
          "src": null
        },
        "e.jpeg": {
          "url": "/ro/dojo4/dojo4-s-got-answers/assets/e.jpeg",
          "path": "dojo4/dojo4-s-got-answers/assets/e.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 477,
            "height": 487
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/dojo4-s-got-answers",
        "type": "dojo4",
        "id": "dojo4-s-got-answers",
        "urls": [
          "/ro/dojo4/dojo4-s-got-answers/assets/b.jpeg",
          "/ro/dojo4/dojo4-s-got-answers/assets/c.jpeg",
          "/ro/dojo4/dojo4-s-got-answers/assets/d.jpeg",
          "/ro/dojo4/dojo4-s-got-answers/assets/e.jpeg",
          "/ro/dojo4/dojo4-s-got-answers/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/dojo4-s-got-answers",
          "prev": "dojo4/these-are-12-of-my-favorite-things",
          "next": "dojo4/tax-day-is-coming-be-not-afraid"
        }
      }
    },
    "dojo4/tax-day-is-coming-be-not-afraid": {
      "author": "emily@dojo4.com",
      "title": "Tax Day Is Coming; Be Not Afraid.",
      "published_at": "2016-04-13 18:27:18 UTC",
      "body": "<div class=\"ro markdown\">\n  \n<p><img src='/ro/dojo4/tax-day-is-coming-be-not-afraid/assets/b.jpeg' alt=\"blue-1_grande.jpg\" /></p>\n\n<p>Mathematician and artist used to be pretty much the same job (see above drawing by <a href=\"https://www.kickstarter.com/projects/1854671654/golden-ratio-coloring-book\">Rafael Araujo</a>). But today the prevailing belief seems to be that artists suck at math, and visa versa.  While I disagree, I do know a lot of artists who seem averse to working with numbers.</p>\n\n<p>You know who you are.  You’re still teetering on the verge of <a href=\"https://brasstaxes.com/extension\">filing that extension</a>, even though Tax Day is less than a week away.</p>\n\n<p>Enter Rus Garofalo of <a href=\"https://brasstaxes.com/\">Brass Taxes</a>. He specializes in taxes for the self-employed, especially us artist-types.  DOJO4 had the opportunity to re-build the backend of <a href=\"https://brasstaxes.com/\">http://brasstaxes.com</a> this year, so we can honestly say: it works beautifully!</p>\n\n<p>Listen dear friends: having someone else file your taxes - someone who actually understands the IRS’ ever-changing rules - <em>is</em> your god-given right as an adult. Can’t afford it?  Planning to DIY with Turbo Tax?  Aside from being a tax write-off, Brass Taxes will be more fun and less expensive than Turbo Tax, as <a href=\"https://youtu.be/9fEm9Y0cpOI\">Rus explains in this video</a> (while wearing a diaper).</p>\n\n<p><img src='/ro/dojo4/tax-day-is-coming-be-not-afraid/assets/c.jpeg' alt=\"rus.jpeg\" /></p>\n\n<p>So go ahead, <a href=\"https://brasstaxes.com/extension\">file that extension</a> and make an appointment with Brass Taxes to put tax season behind you.  That way, if you’re in Colorado, you can go skiing this weekend.</p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/tax-day-is-coming-be-not-afraid/assets/b.jpeg",
          "path": "dojo4/tax-day-is-coming-be-not-afraid/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 600,
            "height": 444
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/tax-day-is-coming-be-not-afraid/assets/c.jpeg",
          "path": "dojo4/tax-day-is-coming-be-not-afraid/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 500,
            "height": 438
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/tax-day-is-coming-be-not-afraid",
        "type": "dojo4",
        "id": "tax-day-is-coming-be-not-afraid",
        "urls": [
          "/ro/dojo4/tax-day-is-coming-be-not-afraid/assets/b.jpeg",
          "/ro/dojo4/tax-day-is-coming-be-not-afraid/assets/c.jpeg",
          "/ro/dojo4/tax-day-is-coming-be-not-afraid/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/tax-day-is-coming-be-not-afraid",
          "prev": "dojo4/dojo4-s-got-answers",
          "next": "dojo4/workeasy-opening-in-our-neighborhood-soon"
        }
      }
    },
    "dojo4/workeasy-opening-in-our-neighborhood-soon": {
      "author": "corey@dojo4.com",
      "title": "WORKEASY opening in our neighborhood soon...",
      "published_at": "2016-04-19 20:33:08 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/workeasy-opening-in-our-neighborhood-soon/assets/b.jpeg' alt=\"workeasy_logo_web.jpg\" /> \n<img src='/ro/dojo4/workeasy-opening-in-our-neighborhood-soon/assets/c.jpeg' alt=\"dojo4-panorama-workeasy.jpg\" /> \nThere’s so much to do, but so few conducive places to do it that are open 24/7, well- stocked with good tunes, good people, good things to eat and drink, at a good location. We’ve been feeling the  need for a 24-hour, member-access speakeasy in downtown Boulder that gets ‘er done- we need a WORKEASY. And now we have one! dojo4 is opening WORKEASY on May 15th, upstairs from our offices, for your easy workin’ pleasure. For more info, <a href=\"https://dojo4.wufoo.com/forms/workeasy-membership/\">apply here and now</a>.</p>\n\n<p>WORKEASY is member community space dedicated to enriching the working and social lives of entrepreneurs, coders, designers and changemakers.\nOur mission is nurture individual and community good fortune through providing an uplifted,  untameable and vitalizing members-only, 24-hour-access space in which members can work and play.</p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/workeasy-opening-in-our-neighborhood-soon/assets/b.jpeg",
          "path": "dojo4/workeasy-opening-in-our-neighborhood-soon/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 291,
            "height": 344
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/workeasy-opening-in-our-neighborhood-soon/assets/c.jpeg",
          "path": "dojo4/workeasy-opening-in-our-neighborhood-soon/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 4096,
            "height": 1166
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/workeasy-opening-in-our-neighborhood-soon",
        "type": "dojo4",
        "id": "workeasy-opening-in-our-neighborhood-soon",
        "urls": [
          "/ro/dojo4/workeasy-opening-in-our-neighborhood-soon/assets/b.jpeg",
          "/ro/dojo4/workeasy-opening-in-our-neighborhood-soon/assets/c.jpeg",
          "/ro/dojo4/workeasy-opening-in-our-neighborhood-soon/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/workeasy-opening-in-our-neighborhood-soon",
          "prev": "dojo4/tax-day-is-coming-be-not-afraid",
          "next": "dojo4/your-people-at-workeasy"
        }
      }
    },
    "dojo4/your-people-at-workeasy": {
      "author": "corey@dojo4.com",
      "title": "your people at WORKEASY",
      "published_at": "2016-04-20 19:26:45 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>Here’s <a href=\"https://dojo4.wufoo.com/reports/workeasy-apps/\">a sample of the first applications</a> that have come in from prospective WORKEASY members. Clearly, should you, too, become a member, you will be surrounded by eclectic taste, dubious, good humor and talent to reach the moon!</p>\n\n<p>Join your people: <a href=\"https://dojo4.wufoo.com/forms/workeasy-membership/\">https://dojo4.wufoo.com/forms/workeasy-membership/.</a></p>\n\n<p><img src='/ro/dojo4/your-people-at-workeasy/assets/b.png' alt=\"Screen Shot 2016-04-20 at 1.20.57 PM.png\" /></p>\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/your-people-at-workeasy/assets/b.png",
          "path": "dojo4/your-people-at-workeasy/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 2180,
            "height": 1360
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/your-people-at-workeasy",
        "type": "dojo4",
        "id": "your-people-at-workeasy",
        "urls": [
          "/ro/dojo4/your-people-at-workeasy/assets/b.png",
          "/ro/dojo4/your-people-at-workeasy/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/your-people-at-workeasy",
          "prev": "dojo4/workeasy-opening-in-our-neighborhood-soon",
          "next": "dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock"
        }
      }
    },
    "dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock": {
      "author": "corey@dojo4.com",
      "title": "the HOW vs the WHAT of building meaningful career & business; or why 'following",
      "published_at": "2016-04-26 22:07:22 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/b.gif' alt=\"tumblr_o2kjrbpG9l1qlcjquo1_400.gif\" /></p>\n\n<p>What does it mean to have a more meaningful career? At some point have you been encouraged to follow your bliss in order to discover your meaningful, engaged career? Have you felt confused, demoralized or duped by this suggestion?</p>\n\n<p>These questions of how to build careers &amp; businesses based on humane and compassionate values, with missions that enact positive impact, and how to engage in meaningful, engaged and joyful work, are deeply intertwined.</p>\n\n<p>And I’m going to tell my story to illustrate the entwinement. I always wanted to do something that really helped people and made real change in the world, and I thought in order to do that I had to work for a company (or build my own organization) that “did good”- that feeding the undernourished, educating the disadvantaged, delivering medicine and clean drinking water, solving environmental problems, saving endangered species, etc.</p>\n\n<p>But it turns out that being a do-gooder is no guarantee of having a meaningful life or career or building a business that actually makes a significantly positive impact. What I learned is that it’s not WHAT a business or a person does but HOW they do it.</p>\n\n<p>To be clear, I have not arrived: I’m pretty sure that I have not found my dream job, or the ideal career. I have not figured out what it means to run a business that is a perfect model of “<a href=\"https://www.bcorporation.net/handbook\">business as a force for good</a>.” However, I have learned a lot and come a long way in finding what I think of as fulfilling livelihood and I’ve found that people with all sorts of backgrounds and experiences can be instrumental in making positive impact. I’ve found out that making positive impact is hugely a matter of attitude, view and approach.</p>\n\n<p>A little bit about myself… I was born in Boulder, CO to a Buddhist family (of the <a href=\"http://www.urbandictionary.com/define.php?term=JewBu\">Jewbu</a> variety). Then, we moved around a lot. At some point, it became clear that I was really good at math and science, and so, was encouraged to study those things, but had no real clue about what I might do for work or as career. I studied Biology and Medical Anthropology but ended up in NYC on a <a href=\"http://www.bluemagazine.com/\">travel magazine</a> photo editor internship and then out of desperation and luck, landed a job as an associate producer on a documentary. Because that was then my only real professional experience (beside bartending and waiting tables), I worked in documentary film production for the next almost 10 years. I ended moving back to Boulder, and again with some desperation and luck, landed a job managing a small software company and am now a partner in that business- it’s still what I’m doing now.</p>\n\n<p>And all along, for years, I’m super sad about not knowing what it was that I wanted to do. I remember having a big fight with an old boyfriend, but only crying when a he asked me “what do you want in your life?” <em>Follow your bliss and the money will follow</em> felt like a bunch of BS to me. Actually it felt like an insult, because I couldn’t even identify what my bliss was. Can hanging out with your friends and being a generally nice person make me money and be meaningful? Generally, not.</p>\n\n<p>I knew I wanted to do something good in the world, but had no clue what that was or how to do it. There was a pervasive feeling of inadequacy and  sadness because I had this sense that I had a lot to offer and was decently smart and competent but just clueless about what to do with that. I would hear about and meet people doing really cool things that actually made a positive impact on their communities and the world, and I felt envious.  My particular situation didn’t afford me a lot of financial support and I often (and erroneously) blamed that for my inability to initiate anything substantive.</p>\n\n<p><a href=\"https://flowingdata.com/2012/10/19/xkcd-style-charts-in-r-javascript-and-python/\"><img src='/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/c.jpeg' alt=\"awesomeness-over-time.jpg\" /> </a></p>\n\n<p>Fast forward to now. What I’m doing now doesn’t necessarily look like what I imagined my dream job would look like and I don’t necessarily feel everyday that what I do is making a positive impact on the world around me, but strangely enough I love the little company I built and feel lucky to do what I do every day. I was kind of coasting along, thinking I was just doing a job, then just co-running my little business, and then sort of gradually and suddenly at the same time, I realized I was doing exactly what I had always wanted to do, which was to make a positive impact on the world and truly help people.</p>\n\n<p>This actualization wasn’t because we were building some kind of ground-breaking software that was delivering earth-shattering solutions to the world’s most complex problems. It’s because <em>we are building a business that allows and encourages people to feel good when they walk in our doors.</em> And when people do business with us they are often surprised by our openness, friendliness and eagerness to find the best solution for them even if it’s counter to our bottom line. <em>We’re building a business that values people’s humanness.</em> \nIt’s impacted my life, my family’s life, and it’s impacted countless people that encounter us (colleagues, employees, clients, the competition, etc.).</p>\n\n<p>Here’s the tricky part: building an engaged, impactful, change-making business or career has way more to with HOW and WHY we do it than what it is or looks like. More fundamental than WHAT a business does, or what we do in a job, is HOW and WHY the business does what it does or HOW and WHY we do what we do in a job. For example, dojo4 is just a services company- sure we have been fortunate enough to find ways to sign some clients like <a href=\"http://offgrid-electric.com/\">Off.Grid</a> and <a href=\"http://www.greenpeace.org/usa/global-warming/click-clean/\">Greenpeace</a>, but at the end of the day, we are writing the exact same code that we may write if we had been hired by <a href=\"http://www.globalresearch.ca/the-complete-history-of-monsanto-the-worlds-most-evil-corporation/5387964\">Monsanto</a> or <a href=\"http://www.huffingtonpost.com/david-badash/chick-fil-a-5-reasons-it-isnt-what-you-think_b_1725237.html\">Chick-fil-A</a>. The WHAT is the same, but the HOW and WHY is different.</p>\n\n<p>Our mission is to support and to provide a wonderful environment for the people we work with and their families. Our mission is to provide a space that is built on the human qualities of humor, curiosity about how to do it better, friendliness, intellectual rigor and joy, to\nprovide support for lifestyles that integrate our many interests, activities, responsibilities and families.</p>\n\n<p>I’ve seen this be so effective that I’ve become deeply inspired by business and the power of business to make positive change in this world. I’ve become an evangelist for “business as a force for good.”</p>\n\n<p>Of course it’s not all about just making a place where people are happy to work- a big part of what a business does of course make a difference-\nI believe that many of the big, big problems facing the world can be solved by business- by providing innovation and services in health, energy, agriculture, communication, education, etc.</p>\n\n<p>The main thing I’ve learned is that building a meaningful, impactful business and/or career starts with the building blocks:</p>\n\n<ul>\n  <li>the ideals that a business is built on</li>\n  <li>the attitude that we take about the work we do</li>\n  <li>how we understand ourselves and each other</li>\n  <li>how we treat ourselves and each other</li>\n</ul>\n\n<p>With these building blocks in place- the WHAT of the career or the business falls in place- the WHAT is so deeply informed by the HOW and the WHY that it can actually feel secondary.</p>\n\n<p>So what does that mean for you?! It means <strong>start where you are</strong>. You can use your current job and business as a force for good by treating your clients, your audience, your competition, your employees, your colleagues, yourself with respect and compassion.</p>\n\n<p><img src='/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/d.jpeg' alt=\"4269275.jpg\" /></p>\n\n<p>Think about what positively impacts you- is it friendliness? Generosity? Honesty? Transparency? Clarity? Humor? Patience? Take whatever that is and cultivate it in how you relate with yourself and the people you encounter through your business.</p>\n\n<p>Take the time to understand yourself and the people you encounter through your business better. Thinking about HOW and WHY you want to want to engage a career or business that makes real positive impact, will help determine and support your decisions about WHAT to do with that business or career.</p>\n\n<p>Although I still don’t know what my bliss is or how to follow it, I’m starting to sense that it doesn’t serve to look to far afield to figure out how to do good with my career and my business. My bliss may be making an impact close to home and in my day-to-day, and letting that inform the bigger decisions and actions.</p>\n\n<p>Imagine if every person and every business started with treating themselves and the people a in their immediate sphere of influence with respect, curiosity and friendliness - that would truly change the world!</p>\n\n<p><em>Thanks to <a href=\"https://twitter.com/Miss_Mandaline?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Mandy Godown</a> and <a href=\"https://twitter.com/nicolecasanova?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Nicole Casanova</a> for inviting me to present at <a href=\"http://www.meetup.com/SheSays-Boulder/\">SheSays Boulder</a>, where I originally gave this as a talk.</em></p>\n\n</div>\n",
      "assets": {
        "b.gif": {
          "url": "/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/b.gif",
          "path": "dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/b.gif",
          "size": 8,
          "img": {
            "format": "gif",
            "width": 400,
            "height": 169
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/c.jpeg",
          "path": "dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 625,
            "height": 350
          },
          "src": null
        },
        "d.jpeg": {
          "url": "/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/d.jpeg",
          "path": "dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/d.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 400,
            "height": 400
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock",
        "type": "dojo4",
        "id": "the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock",
        "urls": [
          "/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/b.gif",
          "/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/c.jpeg",
          "/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/assets/d.jpeg",
          "/ro/dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock",
          "prev": "dojo4/your-people-at-workeasy",
          "next": "dojo4/patience-perspective-and-poop-parenting-and-business"
        }
      }
    },
    "dojo4/patience-perspective-and-poop-parenting-and-business": {
      "author": "corey@dojo4.com",
      "title": "! 'patience, perspective & poop: parenting & business'",
      "published_at": "2016-05-06 16:53:58 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/patience-perspective-and-poop-parenting-and-business/assets/b.jpeg' alt=\"IMG_1030.JPG\" /> \nParenting and entrepreneurship are not that different from one another. They are both thoroughly immersive, deeply consuming and relentlessly demanding experiences. In my experience, both are also profoundly meaningful, acutely joyful, and boundlessly rewarding. And once embarked upon, being a parent and being an entrepreneur are also both choiceless ways of being in the world.</p>\n\n<p>I became an entrepreneur years before I became a parent. And my experiences as a entrepreneur have, no doubt, in countless ways, influenced my parenting style and experience of motherhood. But there’s no question that being being the unwitting parent to my daughter, Florence, has impacted the way I relate to my business, my leadership style, and my identity as an entrepreneur more than any thing else. For the sake of simplicity, I can sum up this influence of motherhood on my experience of entrepreneurship with these 3 P’s of parenthood: patience, perspective, and poop.</p>\n\n<ol>\n  <li>\n    <p>Patience.\nThings take as long as they take. There is likely no more valuable resource than accepting this as truth. The more equanimity I make available to myself in acknowledging this, the more it shows itself to be a super power of effectiveness, efficiency and competence. Whereas at some pre-child point in my life, it was possible to do something simple like leave the house to go somewhere, I now understand that to be a process that can take an unbounded amount of time for no sensible reason. Becoming ruffled, desperate and impatient does not speed up the process, and can, in fact, prolong it. That does not mean that exertion, pressure and clear command of the situation is not required. It just means that wanting things to be different than they actually are is not helpful. Do one thing at a time and then move on to the next thing. The same applies to business. Having a vision for the future is essential, but it is also imperative to relate to what is happening right now with full attention and without sweating that what is happening right now will take exactly as long as it’s going to take, and we might not be able to fully predict how long that is.</p>\n  </li>\n  <li>\n    <p>Perspective.\nAs I’ve heard is the most commonplace experience of becoming a parent (and what is probably the single most salient factor in the survival of the human species), once I gave birth to my daughter, nothing else was as important to me than her and her wellbeing. Suddenly, previously critical elements of my day-to-day life, like the particulars of various relationships, ideas I had about who I was as a person, my need for sleep, my need for accomplishment, etc., showed themselves to be a whole set of relatively inconsequential dramas. Now, keeping a child alive and healthy, and eventually rearing that child as a kind and resourced person, always, always, always takes precedence to anything else. So this then puts the rest into perspective. My sense is that there is nothing, or very few things, that are absolute. This makes everything (else) relative. This is pretty straightforward in parenthood. In business, it sometimes feels less clear, but what I’ve learned is that most things are not that important. There are a few things that are really important and everything else can be related as a rich part of the overall picture, but not essential to it. I’ve learned that part of our effectiveness as entrepreneurs is figuring out what those really important things are and to release the rest from our grip of compulsive attention. Very few things are a matter of life and death- if they’re not, don’t let them them pretend that they are.</p>\n  </li>\n  <li>\n    <p>Poop.\nPoop happens. It happens every day, sometimes a few times a day. It stinks, it’s messy, and it needs to be cleaned up right away so that it doesn’t cause a rash or other unfortunate mishap. Complaining about it or ignoring it is both useless and makes things worse. And not only does it happen, but it would bode ill if it did not happen. Regard it as a sign of health and relate to it quickly, unsqueamishingly and straightforwardly. In parenthood, this poop might also take on the form of spills, barf or dangerous behavior. In business, it can look like any of the number of things that I’d rather not get my hands dirty with on any given day. Sometimes it’s boring day-to-day operations or human error glitches that need fixing, monotonous or difficult emails /  calls / conversations, bureaucratic tangles or relationships that need extra tending or following up on uncomfortable hunches. All of these are a natural part of the digestive system of a healthy business. In themselves, they are no big deal, but if they go unaddressed and are not related to, they can cause a big mess and make things unnecessarily uncomfortable. Relating to little messes quickly and cleanly keeps them from turning into big, sticky messes.</p>\n  </li>\n</ol>\n\n<p>These are three of the indispensable lessons taught to me by parenthood. But perhaps the most valuable is about being fortunate. The inconceivably good fortune I have to be Florence’s mother, reminds me, daily, not to take anything for granted. It reminds that everything is fleeting and nothing is permanent.It reminds me that heartbreak is inherent. It reminds me to enjoy myself and have a sense of humor. It reminds me to put all my energy and will into the things I do, and not to take any of it too seriously. As is parenthood, so as in business, so as in life!</p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/patience-perspective-and-poop-parenting-and-business/assets/b.jpeg",
          "path": "dojo4/patience-perspective-and-poop-parenting-and-business/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 640,
            "height": 640
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/patience-perspective-and-poop-parenting-and-business",
        "type": "dojo4",
        "id": "patience-perspective-and-poop-parenting-and-business",
        "urls": [
          "/ro/dojo4/patience-perspective-and-poop-parenting-and-business/assets/b.jpeg",
          "/ro/dojo4/patience-perspective-and-poop-parenting-and-business/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/patience-perspective-and-poop-parenting-and-business",
          "prev": "dojo4/the-how-vs-the-what-of-building-meaningful-career-or-why-following-your-bliss-is-a-crock",
          "next": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1"
        }
      }
    },
    "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1": {
      "author": "corey@dojo4.com",
      "title": "! 'on the lip of shared ownership: dojo4 becomes a co-op ::: series >>> #1'",
      "published_at": "2016-05-31 20:56:43 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/b.jpeg' alt=\"dojo4_coop_blog1.jpg\" /> \n<img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/c.jpeg' alt=\"IMG_0915.JPG\" /></p>\n\n<p>For years, we’ve talked about how we might diversify ownership of dojo4. <a href=\"https://youtu.be/OXhiuMQchTE\">Ara</a> and <a href=\"https://www.youtube.com/watch?v=06v2Imhm5aQ\">I</a> have been 50/50 owners of this little company for several years now, but have recently decided to move ahead and substantively explore transforming dojo4 into a worker-owned co-op.</p>\n\n<p><strong>WHY?</strong></p>\n\n<p>As co-owners, we’ve shared all the ups and downs, decisions, responsibilities, risks, mistakes, and triumphs. Over those years we’ve also found some real balance with each other as owners. The business has been running smoothly and the happiness quotient has been high. So why throw a wrench in the gears at this point? What advantage could there be in turning dojo4 into a worker-owned co-op, at this point?</p>\n\n<p>Also, we had already decided a while back to share whatever was left in the bank account at the end of the year with everyone who had done work for dojo4 that year. So essentially we had already gone ahead and shared the majority of the upside with our community of contractors (we moved to a purely contractor model at the beginning of 2015), but still retained all the risk. Why would any dojo4 contractor want to share in that risk, especially since they were already enjoying what profit there was?</p>\n\n<p>Here’s our reasoning:</p>\n\n<ul>\n  <li>growth: we’re done well with this business but it’s likely not going to become substantially more innovative or enriching / enriched under it’s current ownership</li>\n  <li>flow: the inevitable bottlenecks that are created by having just two people at all the leverage points may be alleviated by having a broader ownership</li>\n  <li>potential: co-oping will diversify inherent business risk, and it will very likely also increase potential upside</li>\n  <li>longevity &amp; replicability: we have a good thing going here and want to give it its greatest chance of surviving individual circumstances, and if a co-op model does that, it may also be something that can act as a model for similar businesses in other places</li>\n</ul>\n\n<p><strong>HOW?</strong></p>\n\n<p>First we talked to as many people as we could find who had gone in this direction, in tech. We had some really valuable conversations with people like <a href=\"http://www.bostontechcollective.com/bios/\">Yochai Gal</a>.<br />\nThis led us to ask around until we found a really great lawyer who has made it his business and expertise to shepherd organizations on the path to co-ophood. <a href=\"http://www.co-oplaw.org/statebystate/colorado/\">Jason Wiener</a> and his associate, <a href=\"http://www.jrwiener.com/about-jason/\">Jessica Allen</a>, are now providing us with legal counsel, a roadmap and a structure for potential stakeholder engagement in the process. Although not specifically endorsing anything we’re publishing about this process, he’s super supportive of us open-sourcing the process and the artifacts of the process so that other organizations can use our experience as a resource for a similar process of their own.</p>\n\n<p>This is where we are at with things right now (based on a timeline outlined by Jason and Jessica)…</p>\n\n<p><img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/d.jpeg' alt=\"co-op-timeline.jpg\" /></p>\n\n<p><strong>WHAT?</strong></p>\n\n<p>At this point in the process, this is how we see the co-op taking shape and being structured:</p>\n\n<ul>\n  <li>3-7 people buy into the company and become c-owners with Ara and I</li>\n  <li>we start this ownership diversification by choosing one person, and then having the 3 of us choose the next by consensus, and so on</li>\n  <li>new owners buy in to the tune of $5k-$10k each (yet to be determined), which can be financed over the period of ~1 year</li>\n  <li>co-owners at this level are a part of council that makes decisions by quorum according to a super majority about certain specific things:</li>\n  <li>which clients we take</li>\n  <li>which contractors we hire</li>\n  <li>who other members of the co-op are</li>\n</ul>\n\n<p><strong>CONCERNS</strong></p>\n\n<p>We’re pretty excited about this potential transformation, but that doesn’t mean that it doesn’t come with its own worries and concerns, such as:</p>\n\n<ul>\n  <li>something essential about what has made this business work, and successfully support many individuals and families for many years, will get lost if its ownership is diversified - will we dilute not just ownership, but some essential essence of the organization?</li>\n  <li>even if we guard against the dangers of group decision-making, everyone involved has expressed concerns for the “too many roommates” syndrome- we’ll need to work to structure an organization that respects our aversion to process-heavy operations</li>\n  <li>our potential members / stakeholders have various levels of involvement with the current business of dojo4 (e.g. some are current contractors, some are past contractors, some are “friends of the family,” etc.)- how complicated will it be to structure a <a href=\"http://www.co-oplaw.org/topics-2/patronage/#How_Patronage_Works\">patronage system</a> that accommodates members’ various contributions and levels of involvement?</li>\n</ul>\n\n<p>No doubt each of these concerns can be adequately addressed, but there are also likely to be more that will arise as we make the transformation to this new model of shared ownership. Despite this, we also have little doubt that this is a positive, generative reshaping of this business and that we can work with those challenges as they arise!</p>\n\n<p><em>This is the first of a series on our process to becoming a co-op. We hope it is useful to anyone who may be considering or in the process of doing the same. Please know, however, that:</em></p>\n\n<p><em>- nothing published here (or, I think, ever on this site) is a substitute for legal counsel</em>\n<em>- any reference to legal documentation or counsel is my interpretation</em>\n<em>- our lawyer approves whole-heartedly of us open-sourcing this process but is not involved, nor has any editorial approval of anything we publish</em></p>\n\n<p><strong>OTHER RESOURCES</strong></p>\n<ul>\n  <li><a href=\"http://www.co-oplaw.org/\">http://www.co-oplaw.org/</a></li>\n  <li><a href=\"http://techworker.coop/\">http://techworker.coop/</a> and <a href=\"http://techworker.coop/resources/technology-freelancers-guide-starting-worker-cooperative\">http://techworker.coop/resources/technology-freelancers-guide-starting-worker-cooperative</a></li>\n  <li><a href=\"http://www.geo.coop/\">http://www.geo.coop/</a></li>\n  <li><a href=\"https://usworker.coop/\">https://usworker.coop/</a></li>\n  <li><a href=\"http://cdi.coop/\">http://cdi.coop/</a></li>\n  <li><a href=\"http://community-wealth.org/content/worker-cooperatives-models-best-practices\">http://community-wealth.org/content/worker-cooperatives-models-best-practices</a></li>\n  <li><a href=\"http://american.coop/\">http://american.coop/</a></li>\n</ul>\n\n<blockquote>\n  <blockquote>\n    <p>see <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2\">#2</a> <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3\">#3</a> in this blog series«</p>\n  </blockquote>\n</blockquote>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/b.jpeg",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 829,
            "height": 543
          },
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/c.jpeg",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 7253,
            "height": 1840
          },
          "src": null
        },
        "d.jpeg": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/d.jpeg",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/d.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 847,
            "height": 1986
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1",
        "type": "dojo4",
        "id": "on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1",
        "urls": [
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/b.jpeg",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/c.jpeg",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/assets/d.jpeg",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1",
          "prev": "dojo4/patience-perspective-and-poop-parenting-and-business",
          "next": "dojo4/contract-this"
        }
      }
    },
    "dojo4/contract-this": {
      "author": "corey@dojo4.com",
      "title": "contract this!",
      "published_at": "2016-06-22 21:16:49 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/contract-this/assets/b.jpeg' alt=\"contract-meme.jpg\" /></p>\n\n<p>The process of negotiating and getting legal agreements executed can be easy or it can be hard. A lot of that ease or difficulty depends on the relationship between the parties, but a lot also depends on the tool used to document the agreement. It’s always been a necessity for dojo4 that <a href=\"http://dojo4.com/blog/filing-cabinets-are-for-suckers\">this and our other business tools are multi-user, lightweight and online</a>- and so, for years we used a great service called <a href=\"http://www.contractual.ly/\">Contractual.ly</a>. But because they were recently acquired (and thus, sadly for us, shutting down client services) we had to find a good, comparable replacement for creating, negotiating, executing and storing all our contracts. Surprisingly, this proved harder than I would have thought. The basic requirements we were looking for were:</p>\n\n<ul>\n  <li>ability to draft and templatize agreements online</li>\n  <li>ability to share with 3rd parties (clients, contractors, etc.) without them having to create an account with the service</li>\n  <li>ability to have those 3rd parties make real-time edits, not just comments</li>\n  <li>version control</li>\n  <li>ability to sign online and have those 3rd parties sign</li>\n  <li>storage of those executed contracts, preferably within an easily navigable file structure</li>\n  <li>less than $50/month fee</li>\n</ul>\n\n<p>When I asked the folks a Contractual.ly who they might recommend to replace them, they suggested looking at these: <a href=\"http://www.pcmag.com/article2/0,2817,2489199,00.asp\">http://www.pcmag.com/article2/0,2817,2489199,00.asp</a> and <a href=\"https://www.pandadoc.com/\">https://www.pandadoc.com/</a>. There seemed to be some good options there, but in the end, none of them had all the features we need and/or were way out of our price range.</p>\n\n<p>I spent dozens of tedious hours looking at feature lists and on the phone with sometimes confused sales people before I finally found <a href=\"http://www.concordnow.com/\">Concord</a>. Right away, the Concord UI was markedly more elegant and appealing than many of the other services I researched. The needed features are also all there, plus some really helpful integrations with Google Drive and Dropbox, etc. I talked to one of their sales people, who was super helpful, knowledgeable and non-pushy. (If you want to get in touch, too: Ramsay Henderson, <a href=\"mailto:ramsay.henderson@concordnow.com\" target=\"_blank\">ramsay.henderson@concordnow.com</a>, (801)438-4188.)</p>\n\n<p>So we’ve no moved all our contracts and contract services to Concord, and… so far, so good! For small businesses like ours (and maybe yours), it seems like just the ticket. Hopefully our research saves you time and energy.  Small businesses, like ours, are difficult to operate but such a powerful part of doing meaningful work in the world- it’s important to us to share resources to make it easier to do that important work. And in the same vein, don’t forget that we open-source our contract templates and HR policies: [<a href=\"https://github.com/dojo4/policy\" target=\"_blank\">https://github.com/dojo4/policy</a>] (<a href=\"https://github.com/dojo4/policy\" target=\"_blank\">https://github.com/dojo4/policy</a>).</p>\n\n<p>Cheers!</p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/contract-this/assets/b.jpeg",
          "path": "dojo4/contract-this/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 432,
            "height": 288
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/contract-this",
        "type": "dojo4",
        "id": "contract-this",
        "urls": [
          "/ro/dojo4/contract-this/assets/b.jpeg",
          "/ro/dojo4/contract-this/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/contract-this",
          "prev": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1",
          "next": "dojo4/bigger-paychecks-better-impact"
        }
      }
    },
    "dojo4/bigger-paychecks-better-impact": {
      "author": "corey@dojo4.com",
      "title": "bigger paychecks, better impact",
      "published_at": "2016-10-04 22:04:28 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><a href=\"https://en.wikiquote.org/wiki/Scott_Adams\"><img src='/ro/dojo4/bigger-paychecks-better-impact/assets/b.jpeg' alt=\"74b7b0a48ab6c209eae562f3561ed0c2.jpg\" /> </a>\nIt is accepted wisdom that <a href=\"http://www.newsweek.com/ten-reasons-workers-should-be-paid-more-300212\">there are valuable benefits to paying employees more</a>. Paying people more than market rate has been shown to <a href=\"http://fortune.com/2015/07/10/wages-pay-middle-class/\">increase employee engagement</a> and <a href=\"http://www.inc.com/kimberly-weisul/four-strategies-to-raise-profits-by-paying-employees-more.html\">productivity</a>, <a href=\"https://www.americanprogress.org/issues/labor/report/2012/11/16/44464/there-are-significant-business-costs-to-replacing-employees/\">reduce turnover and its associated costs</a>, <a href=\"http://freakonomics.com/2012/05/10/why-it-pays-to-pay-employees-more/\">mediate the need for expensive supervision</a> and <a href=\"https://www.entrepreneur.com/article/252039\">improve brands</a>. Some of these benefits are measurable and concrete, some are subjective but the overall <a href=\"https://www.fastcompany.com/3027244/4-low-cost-retailers-that-are-worth-more-than-youd-think\">result of increasing pay has been found to be more profitable businesses</a>. And while boosting profits is a great reason pay employees more, it there’s another reason that may be exponentially more gratifying: creating real, tangible and personal impact.</p>\n\n<p>A business’ purpose, culture and operations can all contribute to cultivating a positive impact.  That impact can be amplified and diversified by paying employees more. Transferring more of the wealth of a business to its employees can have a positive impact in unpredictable and manifold ways. Bigger paychecks allow businesses to make greater impact by investing in the most impactful sector of the philanthropic economy: <em>individuals</em>. Paying employees more supports those most likely to be generous philanthropists to give even more (<a href=\"https://www.nptrust.org/philanthropic-resources/charitable-giving-statistics/\">the largest source of charitable giving comes from individuals at 71% of total giving, verses the 5% of total giving offered by corporations</a>).</p>\n\n<p>On top of supporting active philanthropy, paying more also creates the conditions and freedoms for people to create impact outside of the constructs of their jobs. When people have more than they need, they are more likely to contribute in their communities and in ways that a business cannot. It allows them spend their time, energy and money on activities that directly affect lives for the better. For instance, a raise recently offered at my company is now being used to offer more affordable, holistic birth-services support. Our part-time director of operations is also a <a href=\"http://www.firstdescentdoula.com/\">doula</a>, and her reaction to that increase in her paycheck was to make her services available to more clients without financial resources. In this way, my business was able to indirectly contribute to <a href=\"http://evidencebasedbirth.com/the-evidence-for-doulas/\">safer and more healthful births</a> and more positive birth experiences for more people in our community.</p>\n\n<p>Paying employees enough not have to work overtime or multiple jobs might allow them the time to volunteer, benefiting individuals, communities or environments. It may allow them pay for an education or activity for their children that could have life-long effects. It may allow their partners to do important unpaid work such as parenting, eldercare, art or writing.</p>\n\n<p>Paying more makes a real impact in people’s personal lives and in ways that we can’t necessarily predict or measure. It is a concrete way to support the good that people already do and to amplify the powerful ripple effect of personal intentions and actions. Not only does it allow our businesses to flourish, it allows the individuals that make up our businesses to spread impact and do good in a way a business itself never can.</p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/bigger-paychecks-better-impact/assets/b.jpeg",
          "path": "dojo4/bigger-paychecks-better-impact/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 400,
            "height": 400
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/bigger-paychecks-better-impact",
        "type": "dojo4",
        "id": "bigger-paychecks-better-impact",
        "urls": [
          "/ro/dojo4/bigger-paychecks-better-impact/assets/b.jpeg",
          "/ro/dojo4/bigger-paychecks-better-impact/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/bigger-paychecks-better-impact",
          "prev": "dojo4/contract-this",
          "next": "dojo4/trends-community-data-made-easy"
        }
      }
    },
    "dojo4/trends-community-data-made-easy": {
      "author": "corey@dojo4.com",
      "title": "! 'trends: community data made easy'",
      "published_at": "2016-10-12 21:57:12 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/trends-community-data-made-easy/assets/b.png' alt=\"Screen Shot 2016-10-12 at 11.44.54 AM.png\" /></p>\n\n<p>The <a href=\"http://www.commfound.org/\">Community Foundation Boulder County</a>’s annual <a href=\"http://trends.commfound.org/\"><em>Trends</em></a> report provides “a common set of measurable data to help improve the quality of life in the community.” And <a href=\"http://dojo4.com/work/code-for-america\">Code for America</a> recently partnered with the Foundation to make this community data more accessible. The partnership, called <a href=\"https://github.com/CodeForBoulder/trends-online\">Code for Boulder</a>, invited dojo4 to get involved. After a community ideation session used to uncover the potential methods that could be used to expose the valuable data content in the <a href=\"http://trends.commfound.org/\"><em>Trends</em></a> report, dojo4 worked with the partnership to implement a fully responsive, standalone microsite that the Community Foundation could easily maintain. The main Community Foundation site was being redesigned by <a href=\"https://www.vermilion.com/\">Vermillion Design</a>, so dojo4 distilled the design patterns from their desktop mockups.</p>\n\n<p>We started our work by building a static “placeholder” site to determine what pieces of content would need to be updated regularly and what bits were more permanent. Ultimately, this rendered the job of integrating the site’s admin backend much, much more quickly.</p>\n\n<p>Initially, we weren’t sure how the site would be updated: 1) using our favorite static site generator <a href=\"https://middlemanapp.com/\">Middleman</a> or 2) using our homegrown rails-based CMS. But since it was a stipulation of the project that the site be easily updated by Code for Boulder volunteers, we chose an option that prioritized maintainability by a rotating, short-term staff of varying technical abilities. We chose a new CMS tool called <a href=\"https://www.datocms.com/\">DatoCMS</a>, “a fully customizable administrative area for static websites”. Indeed, <a href=\"https://github.com/stefanoverna\">Stefano Verna</a>, Dato’s founder, reached out to us and explained how simple it was to integrate DatoCMS, and more importantly, how easy it was for non-technical users to manage it. It was perfect timing and everyone can more effectively engage the web resource that reports the key indicators of quality of life in the Boulder community.</p>\n\n<p><em>Written with <a href=\"http://dojo4.com/team/steve-bailey\">Steve Bailey</a>, who did most of the work on this project.</em></p>\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/trends-community-data-made-easy/assets/b.png",
          "path": "dojo4/trends-community-data-made-easy/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 1884,
            "height": 1240
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/trends-community-data-made-easy",
        "type": "dojo4",
        "id": "trends-community-data-made-easy",
        "urls": [
          "/ro/dojo4/trends-community-data-made-easy/assets/b.png",
          "/ro/dojo4/trends-community-data-made-easy/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/trends-community-data-made-easy",
          "prev": "dojo4/bigger-paychecks-better-impact",
          "next": "dojo4/a-year-of-vinyl-please"
        }
      }
    },
    "dojo4/a-year-of-vinyl-please": {
      "author": "jeremy@dojo4.com",
      "title": "A Year of Vinyl, Please",
      "published_at": "2016-11-22 16:58:04 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/a-year-of-vinyl-please/assets/b.png' alt=\"s300_beatbundle.png\" /> \nFor over a year DOJO4 has had the pleasure of working with the best damn record store on the Internet, <a href=\"http://www.vinylmeplease.com/\">Vinyl Me, Please</a>. They <a href=\"http://dojo4.com/work/vinyl-me\">believe that music has the ability to connect with people on a much deeper level and that through listening to and discovering music, a person’s life can be legitimately impacted for the better.</a> We believe the same thing, so when they approached us last summer, it immediately felt like a great fit. They were reaching the point where their own internal tech know-how just wasn’t cutting it anymore, and they were not yet at the stage where they were going to hire full time technical staff.</p>\n\n<p>It has been a long and joyous project. Over the past year DOJO4 and Vinyl Me Please have:</p>\n\n<ul>\n  <li>streamlined and automated  the fulfillment process taking what used to be a stressful week for one person to a push-button task.</li>\n  <li>reduced the time, and costs for customer support issues related to product replacement.</li>\n  <li>migrated Vinyl Me, Please from an unscalable web infrastructure that regularly took too much maintenance, to an automated, scalable platform.</li>\n  <li>created a customizable e-commerce store tailored to the needs and business processes of Vinyl Me Please and rolled it out with great success. Vinyl Me, Please no longer has the e-commerce woes it had just six months ago.</li>\n  <li>created a member portal where Vinyl Me, Please’s members may more easily manage their subscriptions and orders.</li>\n</ul>\n\n<p>And to cap it off, we helped Vinyl Me, Please hire their full time technical staff and transition all this work off to them.</p>\n\n<p>Matt Fielder, Founder and CEO of Vinyl Me, Please had this to say about working with us:</p>\n\n<blockquote>\n  <p><em>“DOJO4 is the best dev firm around. They’re amazing people and took the time to understand our business needs before building anything. They gave us the resources that made sense given our objectives and worked within a budget that we set. We look at any contractor as an extension of our team and it’s amazing to have people as smart and passionate as the folks at Dojo on our side.”</em></p>\n</blockquote>\n\n<p>We are so pleased to have spent the past year working alongside Vinyl Me, Please; assisting them in bringing the finest music to their members. And if you want, you can <a href=\"http://www.vinylmeplease.com/select-your-plan/\">become a member</a> or <a href=\"http://www.vinylmeplease.com/gift/\">give a membership</a>.</p>\n\n<p>If you need assistance from a team that will care about your success just <a href=\"http://dojo4.com/contact\">let us know</a>.</p>\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/a-year-of-vinyl-please/assets/b.png",
          "path": "dojo4/a-year-of-vinyl-please/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 600,
            "height": 600
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/a-year-of-vinyl-please",
        "type": "dojo4",
        "id": "a-year-of-vinyl-please",
        "urls": [
          "/ro/dojo4/a-year-of-vinyl-please/assets/b.png",
          "/ro/dojo4/a-year-of-vinyl-please/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/a-year-of-vinyl-please",
          "prev": "dojo4/trends-community-data-made-easy",
          "next": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2"
        }
      }
    },
    "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2": {
      "author": "corey@dojo4.com",
      "title": "! 'ON THE LIP OF SHARED OWNERSHIP: DOJO4 BECOMES A CO-OP ::: SERIES >>> #2'",
      "published_at": "2016-12-07 19:09:38 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/assets/b.jpeg' alt=\"dojo4_coop_blog2.jpg\" /></p>\n<blockquote>\n  <blockquote>\n    <p>see <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1\">here</a> for #1 in this blog series«</p>\n  </blockquote>\n</blockquote>\n\n<p>Wow, this is taking us a really long time to do. Granted, I had <a href=\"https://www.instagram.com/p/BKB_CmpBbtB/\">a baby</a> and <a href=\"https://twitter.com/coreykohn/status/781555418417946624\">we bought our building</a> since we first started the process to transition to a cooperative <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1\">6 months ago</a>. But this process takes serious attention, commitment and buy-in, all of which can be in short supply when you are also trying to run a business, even a small business like dojo4.</p>\n\n<p>That being said, we’re on our way. We have a term sheet drafted (to be published in the next installment of this blog series) and are pretty much set to go. In the meantime, we put together a comparison list (also as a pdf table <a href='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/assets/c.html'>here</a>) of what things are like now verses what they will be like after we transition to being a cooperative. This helped us think through where we have more work to do to make things explicit, and is meant to help people who currently work with dojo4 decide whether or not they want to buy in as members. I thought it may also be helpful to anyone outside our organization who is also thinking of co-oping….</p>\n\n<p><em>Note: For those of you who don’t know us or dojo4 personally, it is currently owned 50/50 by <a href=\"http://dojo4.com/team/ara-t-howard\">Ara</a> and <a href=\"http://dojo4.com/team/corey-kohn\">me</a>. And everyone that currently works with dojo4 does so as a contractor.</em></p>\n\n<p><strong>PROFIT / LOSS</strong></p>\n\n<p><strong><em>now</em></strong></p>\n\n<ul>\n  <li>Ara and Corey split profit and risk 50/50</li>\n  <li>profits at year-end are given as ‘bonuses’ based on # of hours billed / worked</li>\n</ul>\n\n<p><strong><em>co-op</em></strong></p>\n\n<ul>\n  <li>member patronage dividends paid out at year-end according to profits minus retained holdings</li>\n  <li>the patronage amount based on actual patronage (e.g. 1 patronage unit for every 10-hours of dojo4 billable work)</li>\n  <li>risk is shared by all members and can be covered with a capital call to members, but more likely would be covered by retained holdings - if a personal guarantee is required, there may be extra compensation to cover that risk (or, at least an internal agreement for members to contribute toward the indemnification of the individual making the personal guarantee)</li>\n</ul>\n\n<p><strong>MONEY</strong></p>\n\n<p><strong><em>now</em></strong></p>\n\n<ul>\n  <li>Ara and Corey are paid a salary; contractors are paid by the hour plus any bonus</li>\n</ul>\n\n<p><strong><em>co-op</em></strong></p>\n\n<ul>\n  <li>the co-op will have some salaried employees</li>\n  <li>all members, including managers will receive a patronage dividend at the end of the year</li>\n</ul>\n\n<p><strong>ORGANIZATIONAL STRUCTURE</strong></p>\n\n<p><strong><em>now</em></strong></p>\n\n<ul>\n  <li>Owners (Ara &amp; Corey) manage and oversee all contractors, may at times delegate some responsibilities to contractors but are essentially responsible for all elements of managing the business</li>\n  <li>Ara and Corey technically have authority to hire, terminate contractors.</li>\n</ul>\n\n<p><strong><em>co-op</em></strong></p>\n\n<ul>\n  <li>Managers: responsible for most elements of running the co-op</li>\n  <li>Council: TBD and outlined in a discrete, enumerable list- e.g. specific project-related, QC responsibilities, moving locations, bringing on new members, etc.</li>\n  <li>Board: hiring &amp; firing managers, possible fundraising, support and advisory group for managers</li>\n</ul>\n\n<p><strong>DECISION-MAKING</strong></p>\n\n<p><strong><em>now</em></strong></p>\n\n<ul>\n  <li>Ara and Corey make all decisions based on area of expertise or by consensus</li>\n</ul>\n\n<p><strong><em>co-op</em></strong></p>\n\n<ul>\n  <li>A Council of co-op members helps Managers make decisions about:\n    <ul>\n      <li>Which clients to take</li>\n      <li>Which contractors to hire (non-owner track and owner-track (trial period)</li>\n      <li>Which projects to take</li>\n      <li>Who will work on which projects</li>\n    </ul>\n  </li>\n  <li>A Board of Directors decides whether to retain or fire the Managers (currently Ara &amp; Corey)</li>\n  <li>The Managers (currently Ara &amp; Corey) make all operational decisions and all / any other decisions that are not made by the Council or the Board</li>\n</ul>\n\n<p><strong>MEMBERSHIP</strong></p>\n\n<p><strong><em>now</em></strong></p>\n\n<ul>\n  <li>Club house rules!</li>\n</ul>\n\n<p><strong><em>co-op</em></strong></p>\n\n<ul>\n  <li>Member buy-in is $X or $X/12 /month paid over a year</li>\n  <li>Membership can be terminated by super majority vote of other members or by member’s own choice</li>\n  <li>Exact buy-in amount is returned member upon termination (no interest or appreciation), to be returned within 3 months of termination, and at discretion of Board, based upon net cash flow and balance sheet.</li>\n  <li>Member’s LLC become a member (entitled to one and only one vote), but the rights and responsibilities of membership will be exercised by the LLC’s principal</li>\n  <li>Membership will be a democracy of people, not businesses, but the legal documentation can show the member’s LLC if they have one. This protects independent contractor designation and limited liability protection.</li>\n</ul>\n\n<p><strong>NOTES</strong></p>\n\n<ul>\n  <li>The current owners, Ara and Corey, are not taking any $ out of the business at the time of conversion to being a co-op. All new member buy-in amounts are going toward giving the business a buffer in the bank account. Ara and Corey are simply diluting their shares in the company, with the faith that by diversifying ownership, the business will thrive and that will be good for everyone.</li>\n  <li>For patronage dividends to qualify for the significant tax benefit (single level taxation), they must be allocated on the basis of patronage, that is the value of goods/services contributed or consumed through the cooperative. In dojo4’s case, this will require measuring the individual contribution of members.  Since members contributions will fluctuate and vary over time, we will continue to tracking time and convert that time into units of patronage.  “Patronage” includes both billable and non-billable hours/service/contribution by a member to or through the cooperative. dojo4 patronage includes both client billable time as well as value-add operational/management time.</li>\n  <li>Cooperatives, like other legal business entities, can buy, own and dispose of property.  This can include real estate, capital assets (web site, equipment, products).  Without opinion on the tax treatment to either the coop or to members arising from the distribution of the proceeds of the sale of property, the cooperative can and many do buy and own property as a way of increasing the profitability of the cooperative, by and for its members (think the dairy marketing and processing coop that buys Grade A dairy equipment).  We will have to check whether the proceeds of the sale of such equipment (hopefully at an increased tax basis from purchase price) is treated as capital gain (better, for now) or as ordinary income (usually higher rates).</li>\n</ul>\n\n<blockquote>\n  <blockquote>\n    <p>see <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3\">here</a> for #3 in this blog series«</p>\n  </blockquote>\n</blockquote>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/assets/b.jpeg",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 829,
            "height": 543
          },
          "src": null
        },
        "c.html": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/assets/c.html",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/assets/c.html",
          "size": 8,
          "img": null,
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2",
        "type": "dojo4",
        "id": "on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2",
        "urls": [
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/assets/b.jpeg",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/assets/c.html",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2",
          "prev": "dojo4/a-year-of-vinyl-please",
          "next": "dojo4/all-in-every-person-is-welcome-here"
        }
      }
    },
    "dojo4/all-in-every-person-is-welcome-here": {
      "author": "corey@dojo4.com",
      "title": "! 'ALL IN: Every Person Is Welcome Here'",
      "published_at": "2016-12-09 23:05:51 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>The election happened. We looked around and suddenly understood that other people might see us as possible haters; that as far as they could see we could be secretly (or not so secretly) harboring ill will toward them, wondering if we’d prefer they weren’t here, and disrespect them as fellow human beings.</p>\n\n<p>Xenophobia, racism, misogyny, homophobia, and prejudice of all kinds have always existed in this country, but we are, perhaps, more in danger now than ever of having those types of violence normalized. We resist and rail against this! And we want people to know that we are <a href=\"http://www.whiteaccomplices.org/\">working to liberate ourselves</a> from these fundamental misunderstandings of the truth of interdependence.</p>\n\n<p><em>All spaces big or small, whether they be a public space, a business, an institution or a country, shall be welcoming and safe for all humans. We may not share beliefs, appearance, privilege, experience nor means, but hold in common the infinite capacity for human kindness. Regardless of gender, religion, origin, race, ethnicity, ability, or economic access, every person has indelible value. We recognize this and proclaim it.</em></p>\n\n<p><img src='/ro/dojo4/all-in-every-person-is-welcome-here/assets/b.jpeg' alt=\"ALL-IN-3-1.jpg\" /></p>\n\n<p>So, we created an <a href=\"http://dojo4.com/all-in\">image</a> (thanks, <a href=\"http://anthonydimitre.com/\">Anthony Dimitre</a>) to let others know and remind ourselves that we welcome all people, whether it be in our homes, our streets, our businesses, our institutions, or our country. If that speaks to you, too, <a href=\"http://dojo4.com/all-in\">download here</a> and share far and wide…</p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/all-in-every-person-is-welcome-here/assets/b.jpeg",
          "path": "dojo4/all-in-every-person-is-welcome-here/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1405,
            "height": 1780
          },
          "src": null
        },
        "b.jpeg.a5f9dd99cfbf8868e1ba68d8ec142ce8.cloudinary.yml": {
          "url": "/ro/dojo4/all-in-every-person-is-welcome-here/assets/b.jpeg.a5f9dd99cfbf8868e1ba68d8ec142ce8.cloudinary.yml",
          "path": "dojo4/all-in-every-person-is-welcome-here/assets/b.jpeg.a5f9dd99cfbf8868e1ba68d8ec142ce8.cloudinary.yml",
          "size": 8,
          "img": null,
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/all-in-every-person-is-welcome-here",
        "type": "dojo4",
        "id": "all-in-every-person-is-welcome-here",
        "urls": [
          "/ro/dojo4/all-in-every-person-is-welcome-here/assets/b.jpeg",
          "/ro/dojo4/all-in-every-person-is-welcome-here/assets/b.jpeg.a5f9dd99cfbf8868e1ba68d8ec142ce8.cloudinary.yml",
          "/ro/dojo4/all-in-every-person-is-welcome-here/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/all-in-every-person-is-welcome-here",
          "prev": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2",
          "next": "dojo4/be-yourself--or-else"
        }
      }
    },
    "dojo4/be-yourself--or-else": {
      "author": "corey@dojo4.com",
      "title": "be yourself. or else.",
      "published_at": "2017-01-06 22:46:58 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/be-yourself--or-else/assets/b.jpeg' alt=\"2777217198_3c54a28001.jpg\" /></p>\n\n<p>While there’s probably nothing more cliche than declaring the power and importance of “being yourself,” there are some real dangers, in business, in NOT being yourself. Here are a few dire circumstances that will be encountered if the “real you” is somehow obscured from your community, clients, and competitors (I speak from experience):</p>\n<ul>\n  <li>you will lose clients/customers</li>\n  <li>you will lose money</li>\n  <li>you will lose employees</li>\n  <li>you will attract weird employees and clients/customers who are NOT a good fit for your organization</li>\n  <li>you will be miserable and wonder what you are doing and why you are doing it</li>\n</ul>\n\n<p>So what does “being yourself” mean, as an organization? It means not pretending to be other than you are. It means not offering more than you can or something different than you feel comfortable with. It means not pretending to be more (or less) professional than you are. It means not pretending to know more (or less) than you know. It means not hiding your size, your age, your circumstances. It means owning what you do know, what you can offer. “Being yourself” means owning your organization’s particular style, circumstances, sense of humor, eccentricities, oddities and  conventions. What you see is what you get. You can always sign yourself up for a job that will stretch your capacity beyond what it may have handled in the past, but don’t hide your personality in the process. And if you own your organization’s unique personality and have confidence in what people (customers, clients, competitors, employees) see, then you can build on that rather than spending your time and energy holding together a facade.</p>\n\n<p>dojo4 is a small software design and development agency. We work best solving hard problems and building tools that can be used by real humans. But often people walking by our storefront office pop their heads in to ask what we are. From outward appearance, people think our office is a cafe or a co-working space or clubhouse or a daycare (no joke). We pride ourselves on building sturdy well-thought-through code and compellingly applied design. We are lucky to have long-term and high-value contracts with <a href=\"http://dojo4.com/work\">several established clients</a>. But looking into our office, you may see <a href=\"http://dojo4.com/blog/family-friendly-workplace-manifesto\">kids</a> and <a href=\"https://twitter.com/drawohara/status/781548125521645568\">dogs</a>, bikes and bike equipment, <a href=\"http://dojo4.com/blog/code-and-and-coffee-at-dojo4\">a lot of random people working out the office</a> who may or may not actually work for the company, <a href=\"https://twitter.com/coreykohn/status/746433825916346368\">communal meals</a>, <a href=\"https://twitter.com/dojo4/status/798286002301370368\">snacks and alcoholic drinks</a> being consumed. You’ll likely hear the excellent, curated tunes being played by <a href=\"https://blog.conduitmusic.co/author/joel-davis/\">our illustrious resident DJ, Joel</a>, but you may also hear the Goldberg Variations or Slayer or Hall &amp; Oates. Sometimes you may not see anyone at all because we’re all working from home or out on bike rides or spending time with our families. This type of agency does not appeal to all clients or potential hires, particularly those who want / need a lot of formality and process. We don’t really do formality or process, in a conventional sense. But that’s great, because it means that we don’t attract people that we can’t make happy. It means that if people are confused and confounded by our appearance, they will go away, and if they are intrigued and feel comfortable, they will stay. That doesn’t mean that we will only work with exactly same-minded people, but it does mean that we are likely to get along with the people that choose to work with us.</p>\n\n<p>When I first got into this business, I was embarrassed that I didn’t know more than I did. My career had been in documentary film, not software design and development. How was I supposed to inspire confidence in clients and co-workers who knew more about this stuff than I did (which wasn’t that hard)? But I actually knew so little, that I had to give up pretending very early on and just own who I was: a smart, competent, inquisitive person who could be very helpful and supportive, but did not know squat about software. This turned out to be a fantastic advantage! And this reality has offered real value to clients and colleagues:</p>\n\n<ul>\n  <li>It’s allowed people to feel comfortable with what they <em>do not know themselves</em>, and thus more at ease with the work we’re doing together.</li>\n  <li>Because I’ve had to ask a lot of questions, it’s allowed important elements of projects and relationships to surface, and thus strengthened those projects and relationships.</li>\n  <li>Having, myself, an eclectic background outside of software, has allowed other people to feel comfortable sharing their diverse experiences, making our connections more human and our work together more robust.</li>\n</ul>\n\n<p>Our uniqueness, our individuality, our foibles, our peculiarities, our orthodoxy or lack thereof, and our honesty can be our greatest offerings and as such, deserve our heartfelt allegiance and worthwhile investment. These qualities, the qualities that reflect who we “really are,” allow us to attract our greatest allies, our most valuable clients and customers, and our most loyal colleagues. In this way, we can be more impactful and accomplishing because we can think more clearly instead of wasting energy being something we are not.  Hiding or underplaying ourselves is stingy (it means we aren’t sharing our inherent wealth) and will create relationships based on false assumptions. When we embody “who we really are,” we forge the strongest relationships, <a href=\"https://www.ashoka.org/en/story/how-change-world\">solve the hardest problems</a> and have the most fun.</p>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/be-yourself--or-else/assets/b.jpeg",
          "path": "dojo4/be-yourself--or-else/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 500,
            "height": 500
          },
          "src": null
        },
        "b.jpeg.7133dbde380599a12a4b2bfeb02e9945.cloudinary.yml": {
          "url": "/ro/dojo4/be-yourself--or-else/assets/b.jpeg.7133dbde380599a12a4b2bfeb02e9945.cloudinary.yml",
          "path": "dojo4/be-yourself--or-else/assets/b.jpeg.7133dbde380599a12a4b2bfeb02e9945.cloudinary.yml",
          "size": 8,
          "img": null,
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/be-yourself--or-else",
        "type": "dojo4",
        "id": "be-yourself--or-else",
        "urls": [
          "/ro/dojo4/be-yourself--or-else/assets/b.jpeg",
          "/ro/dojo4/be-yourself--or-else/assets/b.jpeg.7133dbde380599a12a4b2bfeb02e9945.cloudinary.yml",
          "/ro/dojo4/be-yourself--or-else/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/be-yourself--or-else",
          "prev": "dojo4/all-in-every-person-is-welcome-here",
          "next": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3"
        }
      }
    },
    "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3": {
      "author": "corey@dojo4.com",
      "title": "! 'ON THE LIP OF SHARED OWNERSHIP: DOJO4 BECOMES A CO-OP ::: SERIES >>> #3'",
      "published_at": "2017-01-31 18:46:45 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3/assets/b.jpeg' alt=\"dojo4_coop_blog3.jpg\" /></p>\n\n<blockquote>\n  <p>see <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1\">#1</a> and <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2\">#2</a> in this blog series</p>\n</blockquote>\n\n<p>We’re getting close but need to make a foundational decision before the deal can be done - we have to make a choice about what kind of entity this cooperative is going to be. Shall we be Cooperative Corporation or Cooperative Partnership LLC? (See the <a href=\"http://www.co-oplaw.org/governance-operations/entity/\">Co-op Law’s description</a> of these two types of entities.) Each has pros and cons, and each has implications for the fundamental underpinnings of the business.</p>\n\n<p>In order to help us make the decision, we got in touch with <a href=\"https://www.wegnercpas.com/employee/bruce-mayer\">Bruce Mayer</a> at <a href=\"https://www.wegnercpas.com/\">Wegner CPAs</a>. Like the expert that he is in cooperative accounting, he broke it down for us. Generously, he’s allowing us to share his explanations and commentary here. Thanks, <a href=\"http://www.grocer.coop/articles/patronage-dividends-primer\">Bruce</a>! I’ve categorized it here according to various partnership versus corporation considerations for your reading pleasure:</p>\n\n<p><em>(Everything below in italics are Bruce’s words.)</em></p>\n\n<p><strong>BUILDING RESERVES</strong>\n<em>…partnership rules are not conducive to building up reserves that belong to the Co-op.  All income passes through to the owners’ personal returns.  So any funds you want to leave in the Co-op to help it continue after the current owners leave will need some accounting and agreements that don’t work well in a partnership. Basically people need to leave behind funds that they paid tax on.  In contrast, corporate taxation allows a decision to be made each year about what part of profits goes to owners by patronage dividends or is taxed to the Co-op and stays as retained earnings.</em></p>\n\n<p><strong>INDIVIDUAL TAXES</strong> \n<em>In partnership taxation all owners have compensation reported on the K-1 and they need to pay quarterly estimated taxes.  In a corporation owners get a W-2 unless you set it up as a clearinghouse or service type of Co-op and then folks would get a 1099-MISC. When there are K-1s for a large group there will be pressure to get the tax return done quickly.  People will want to file their 1040s.  For corporate taxation the completion of the return and the decision to allocate the profit or loss can wait since it does not change owner taxes in the year just passed.</em></p>\n\n<p><strong>TIMING and TAX RETURN DEFERRAL</strong>\n<em>In partnership taxation the profit or loss is allocated to owners in the same year the Co-op has the loss or profit.  In corporate taxation any profit allocated by a patronage dividend is deducted by the Co-op in the year earned but it is income to the individuals in the year the patronage dividend is allocated.  So if there is a 2016 profit and the amounts are paid out as patronage dividends in 2017, the Co-op deducts it in 2016 while the owners claim it as income in 2017.  There is a one year deferral of the tax on that amount.</em></p>\n\n<p><strong>RETAINED EARNINGS from NON-MEMBERS</strong>\n<em>When there is work done by non-owners any profits generated by that will be allocated to owners in partnership taxation.  In corporate taxation that amount stays with the Co-op which pays the tax and keeps it as retained earnings.</em></p>\n\n<p><strong>ALLOCATION OF LOSS</strong>\n<em>In partnership taxation the loss is immediately allocated to the owners for the year of the loss.  In corporate taxation you have the choice of allocating the loss to members or letting the Co-op keep the loss to offset past or future income. In partnership taxation all income is allocated to owners.  In corporate taxation there is a choice about allocating that to owners or having the Co-op pay tax on it.</em></p>\n\n<p><strong>DIRECTIONALITY</strong>\n<em>It is possible to try partnership accounting and then in a later year switch to taxation as a corporation.  You cannot go in the other direction.  Once corporate taxation is chosen the only way to get back to partnership taxation is to dissolve and start over.</em></p>\n\n<p>dojo4 is likely going to go with being a Cooperative Partnership LLC for now. We need to get ourselves over the finish line and that route is easiest for us at this point, since we are already a partnership. It will allow us to have the least amount of administrative and accounting overhead in the short-term. And when/if we’re ready, we can move to being a Cooperative Corporation. Our venerable lawyer, <a href=\"http://www.ccd.coop/team_item/jason-wiener-esq/\">Jason Wiener</a>, (who also, wisely, recommended Wegner/<a href=\"http://www.thenews.coop/tag/bruce-mayer/\">Bruce</a> to us) assured me that both forms are bono fide versions of being a cooperative organize- phewsh! Almost there…</p>\n\n<blockquote>\n  <p>see the next installment in the series, <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4\">blog #4</a></p>\n</blockquote>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3/assets/b.jpeg",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 829,
            "height": 543
          },
          "src": null
        },
        "b.jpeg.bec7483fb243fe093a70e8f7bda05283.cloudinary.yml": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3/assets/b.jpeg.bec7483fb243fe093a70e8f7bda05283.cloudinary.yml",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3/assets/b.jpeg.bec7483fb243fe093a70e8f7bda05283.cloudinary.yml",
          "size": 8,
          "img": null,
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3",
        "type": "dojo4",
        "id": "on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3",
        "urls": [
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3/assets/b.jpeg",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3/assets/b.jpeg.bec7483fb243fe093a70e8f7bda05283.cloudinary.yml",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3",
          "prev": "dojo4/be-yourself--or-else",
          "next": "dojo4/spreading-the-good-feels"
        }
      }
    },
    "dojo4/spreading-the-good-feels": {
      "author": "jetha@dojo4.com",
      "title": "Spreading The Good Feels",
      "published_at": "2017-03-15 18:28:39 UTC",
      "body": "<div class=\"ro markdown\">\n  <pre><code>          Spreading The Good Feels\n</code></pre>\n\n<p><img src='/ro/dojo4/spreading-the-good-feels/assets/b.png' alt=\"448965129.png\" /></p>\n\n<p>Jessica Watson, of the design firm <a href=\"http:http://www.pointsnorthstudio.com//\">Points North</a> reached out to us with a spunky idea of spreading some love to a local stranger. As part of her <a href=\"https://twitter.com/search?f=tweets&amp;q=%2328dayskind&amp;src=typd\">#28dayskind</a>, she sent us a box of blank coffee sleeves and we were tasked with coloring, offering jokes and words of wisdom and kindness. Here we are, dojo4 peeps and friends, yukkin’ it up over delish Audrey Jane’s Pizza <a href=\"http://www.thepizzagarage.com/\"></a> all while listening to the tunes of our in house DJ Joel of <a href=\"https://conduitmusic.co/\">Conduit</a>. We got some serious giggles and ‘awwww’s’ by offering our best in an effort to let some random folk how awesome they truly are (or simply make them laugh).</p>\n\n<p><img src='/ro/dojo4/spreading-the-good-feels/assets/c.jpeg' alt=\"Photo 2017-03-03 02_21.jpg\" /></p>\n\n<p>Coffee cozies were dropped at our local, and beloved, <a href=\"http://www.boxcarcoffeeroasters.com/\">Boxcar roasters</a>. Baristas had some favorites and there was nothing but delight as their patrons enjoyed their tea/coffee! Thanks again to Jessica, who gave us a reason to gather, brainstorm, feel inspired and laugh all for the joy for another human!</p>\n\n<p><img src='/ro/dojo4/spreading-the-good-feels/assets/d.jpeg' alt=\"17097931_10156083768353916_1238986777565250540_o.jpg\" /></p>\n\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/spreading-the-good-feels/assets/b.png",
          "path": "dojo4/spreading-the-good-feels/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 598,
            "height": 330
          },
          "src": null
        },
        "b.png.c2f0963e00414ab6411844ba82023996.cloudinary.yml": {
          "url": "/ro/dojo4/spreading-the-good-feels/assets/b.png.c2f0963e00414ab6411844ba82023996.cloudinary.yml",
          "path": "dojo4/spreading-the-good-feels/assets/b.png.c2f0963e00414ab6411844ba82023996.cloudinary.yml",
          "size": 8,
          "img": null,
          "src": null
        },
        "c.jpeg": {
          "url": "/ro/dojo4/spreading-the-good-feels/assets/c.jpeg",
          "path": "dojo4/spreading-the-good-feels/assets/c.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 1512,
            "height": 2016
          },
          "src": null
        },
        "d.jpeg": {
          "url": "/ro/dojo4/spreading-the-good-feels/assets/d.jpeg",
          "path": "dojo4/spreading-the-good-feels/assets/d.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 2048,
            "height": 2048
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/spreading-the-good-feels",
        "type": "dojo4",
        "id": "spreading-the-good-feels",
        "urls": [
          "/ro/dojo4/spreading-the-good-feels/assets/b.png",
          "/ro/dojo4/spreading-the-good-feels/assets/b.png.c2f0963e00414ab6411844ba82023996.cloudinary.yml",
          "/ro/dojo4/spreading-the-good-feels/assets/c.jpeg",
          "/ro/dojo4/spreading-the-good-feels/assets/d.jpeg",
          "/ro/dojo4/spreading-the-good-feels/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/spreading-the-good-feels",
          "prev": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3",
          "next": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4"
        }
      }
    },
    "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4": {
      "author": "corey@dojo4.com",
      "title": "! 'ON THE LIP OF SHARED OWNERSHIP: DOJO4 BECOMES A CO-OP ::: SERIES >>> #4'",
      "published_at": "2017-03-27 21:19:25 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/b.jpeg' alt=\"dojo4_coop_blog4.jpg\" /></p>\n\n<p><em>&gt; see <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-1\">#1</a>, <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-2\">#2</a> and <a href=\"http://dojo4.com/blog/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-3\">#3</a> in this blog series</em></p>\n\n<p><img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/c.png' alt=\"Screen Shot 2017-03-15 at 12.29.17 PM.png\" /></p>\n\n<p>We did it! We cooperated. We cooperate. We are a cooperative.</p>\n\n<p><a href=\"https://d3vv6lp55qjaqc.cloudfront.net/items/2M3N2k3f1E0C0h0E2l1M/Image%202017-03-16%20at%2010.02.57.png\">Almost six and a half years after filing our dojo4 articles of organization as a Limited Liability Company, we’ve converted to being a Limited Cooperative Association (LCA).</a></p>\n\n<p><img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/d.png' alt=\"Cert of Good Standing_13MAR17.png\" /></p>\n\n<p>We chose being an LCA over a being a Cooperative Corporation, mostly because it meant that we did not have to make any substantial changes to our accounting system or corporate structure. Now we just issue K1s both to the founders and the new members. Plus, as a LCA, it’s easy to become a Cooperative Corporation later, but hard to go the other way.</p>\n\n<p>As promised, and with the blessing of <a href=\"http://www.jrwiener.com/\">our deeply cool lawyer, Jason</a>, we’ve open-sourced all our legal documents for you to reference or draw on in whatever way is most helpful to you. You can find them here:</p>\n\n<blockquote>\n  <p><a href=\"https://github.com/dojo4/policy/tree/master/co-op\">https://github.com/dojo4/policy/tree/master/co-op</a>.</p>\n</blockquote>\n\n<p>You’ll likely still need Jason, or <a href=\"http://www.co-oplaw.org/\">another attorney</a>, to help you draft documents that take your organization’s particularities into account, including some specific conversion documents, but hopefully the documents we’ve shared are supportive to your conversion process (that sure does have an ecclesiastical ring to it).</p>\n\n<p>But before you go and take a look at all that legalese, outlined here are some of our learnings, so far:</p>\n\n<ul>\n  <li>Although not overly complicated, the co-op conversion process can take a looooong time. And we’re small, so if your business is larger or more complex than ours, apply a multiplicative factor to how long it could take. It took us almost exactly a year. It’s hard to run a business and turn it into a co-op at the same time. (Granted, we did <a href=\"https://twitter.com/coreykohn/status/781555418417946624\">buy a building</a> and <a href=\"https://twitter.com/coreykohn/status/793128317410906113\">have a baby</a> during that time.)</li>\n  <li>Communication is key. As a small organization with lots of immediate and asynchronous communication tools, we tend to have fairly informal communication channels. For the most part this worked well throughout the process. We used email, <a href=\"http://www.redmine.org/\">Redmine (a project management tool we use)</a> <a href=\"https://www.flowdock.com/\">Flowdock</a>, and <a href='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/e.html'>in-person meetings</a>. However, we’re having to deal with how to keep those channels transparent and communicative now that some people at dojo4 are members and some are not. For the most part all our communications are transparent (e.g. we try to keep important messages out of email and in Flowdock and Redmine, where anyone can easily see them), but there are now more communications that concern only members. We are seeing how we have to be aware of inadvertent clubbiness and opacity. So far, we’ve addressed this by assigning a liaison who is not a member to make sure that important co-op information gets out properly to the non-member dojo4 contractor community. We’re doing this through the <a href=\"http://www.redmine.org/projects/redmine/news\">Redmine news feature</a>.</li>\n  <li>Legal documents vs. actual operations. All the paperwork is signed and that paperwork specifies some of the ways in which we decided we wanted to run this co-operative, but are very quickly feeling the gap between what’s on paper and how to actualize it all the myriad real-life scenarios that dominate the day-to-day of running a business. For instance, the voting protocols that are outlined in the <a href=\"https://www.gitbook.com/book/dojo4/dojo4-coop-member-handbook/edit#/edit/master/term-sheet.md\">term sheet</a>, aren’t really operationalized. The terms sheet specifies one-member = one-vote, that being operationalized using <a href=\"http://agileforall.com/learning-with-fist-of-five-voting/\">fist-to-five</a>, and a passing vote requirement of super-majority (2/3) vote of the members. But what does that actually mean? After several ebullient hours of conversation it was clear that there are many possible interpretations. For this and a number of other important reasons to flesh out operational procedure, we are creating a <a href=\"https://www.gitbook.com/book/dojo4/dojo4-coop-member-handbook/\">dojo4 co-op members handbook (a work in progress!)</a>.</li>\n  <li>As we learn (or not) and incorporate our learnings (or not), we will document any relevant and useful information in this blog series.</li>\n</ul>\n\n<p>So here we are. As per our <a href=\"https://github.com/dojo4/policy/blob/master/co-op/term_sheet\">term sheet</a> and <a href=\"https://github.com/dojo4/policy/blob/master/co-op/bylaws\">bylaws</a> we nominated new members by consensus decision - we are lucky to have had a pool of many long-term contractors and colleagues who were interested in becoming members. So now we are a total of 6 members (2 founders, 4 new members) and already enjoying the responsibilities and necessary collaboration of diversified ownership. I feel very proud and appreciative to have have helped make this conversion happen and to now be a member of a <a href=\"https://cooperativesforabetterworld.coop/\">real, live member-owned co-operative</a>. Viva la dojo4!</p>\n\n<p><img src='/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/f.gif' alt=\"giphy.gif\" /></p>\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/b.jpeg",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 829,
            "height": 543
          },
          "src": null
        },
        "b.jpeg.a46933c20d26303e1a79f21ce856cdc9.cloudinary.yml": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/b.jpeg.a46933c20d26303e1a79f21ce856cdc9.cloudinary.yml",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/b.jpeg.a46933c20d26303e1a79f21ce856cdc9.cloudinary.yml",
          "size": 8,
          "img": null,
          "src": null
        },
        "c.png": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/c.png",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/c.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 1080,
            "height": 1358
          },
          "src": null
        },
        "d.png": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/d.png",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/d.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 2550,
            "height": 3300
          },
          "src": null
        },
        "e.html": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/e.html",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/e.html",
          "size": 8,
          "img": null,
          "src": null
        },
        "f.gif": {
          "url": "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/f.gif",
          "path": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/f.gif",
          "size": 8,
          "img": {
            "format": "gif",
            "width": 250,
            "height": 191
          },
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4",
        "type": "dojo4",
        "id": "on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4",
        "urls": [
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/b.jpeg",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/b.jpeg.a46933c20d26303e1a79f21ce856cdc9.cloudinary.yml",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/c.png",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/d.png",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/e.html",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/assets/f.gif",
          "/ro/dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4",
          "prev": "dojo4/spreading-the-good-feels",
          "next": "dojo4/assessing-the-b-corp-assessment"
        }
      }
    },
    "dojo4/assessing-the-b-corp-assessment": {
      "author": "corey@dojo4.com",
      "title": "assessing the b corp assessment",
      "published_at": "2017-04-10 22:50:51 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/assessing-the-b-corp-assessment/assets/b.png' alt=\"Screen Shot 2017-03-24 at 11.48.47 AM.png\" /></p>\n\n<p>It was recently <a href=\"https://www.bcorporation.net/become-a-b-corp/how-to-become-a-b-corp/performance-requirements\">time to re-certify</a> as a <a href=\"https://www.bcorporation.net/what-are-b-corps\">B Corp</a> - we were happy to do it and pleased to <a href=\"https://www.bcorporation.net/community/dojo4\">pass with flying colors</a>. Just like <a href=\"http://www.bimpactassessment.net/\">the original assessment</a>, the recertification took some serious time and energy, but we’ve been really pleased to be a <a href=\"https://www.bcorporation.net/what-are-b-corps\">B Corp</a> these last two years and so it felt well worth it.</p>\n\n<p><a href=\"https://unreasonable.is/5-benefits-to-becoming-a-b-corp/\">As we’ve mentioned before</a>, there are lots (or at least 5!) of good reasons to be a B Corp:</p>\n<ol>\n  <li>It’s stellar marketing.</li>\n  <li>It puts you in good company and a strong network.</li>\n  <li>It raises your standards and makes them easier to maintain.</li>\n  <li>It supports and includes you in a thriving movement.</li>\n  <li>It lets you and your stakeholders, rather than your shareholders, decide what’s best.</li>\n</ol>\n\n<p>That being said, the B Corp certification is a means not an end. Being a B Corp means meeting <a href=\"https://www.bcorporation.net/what-are-b-corps/about-b-lab\">the highest standards of verified, overall social and environmental performance, public transparency, and legal accountability</a>. Being a force for good is achieved by organizations without necessarily being B Corp certified. But the certification does provide a framework and support structure for some of the world’s most impactful businesses in the world, big and small, to do their best work.</p>\n\n<p>The B Impact Assessment is updated every two years to keep the standards up to date. Having gone through it twice now, we have some specific suggestions to improve those standards, especially to make it more accessible for startups looking to certify (and re-certify). There are a number of ways that what certain companies do (or don’t do) could be more adequately and compellingly reflected in the assessment:</p>\n\n<ul>\n  <li>\n    <p>Currently only contributions to 501c3s are accounted for. This does not reflect financial and in-kind contributions to entities and campaigns that may not be designated as non-profits. For instance, the current assessment has no way to recognize our contributions to GoFundMe campaigns for individuals, support for <a href=\"https://medium.com/@ShaunKing/please-support-these-5-standing-rock-legal-defense-funds-to-stop-the-dakota-access-pipeline-754be4674ec2\">Standing Rock activists and actions</a>, or <a href=\"http://www.awesomeboulder.org/\">Awesome Boulder</a>.  Not all impactful philanthropic financial and in-kind contributions are tax deductible.</p>\n  </li>\n  <li>\n    <p>The assessment puts a lot of weight on environmental practices and emphasizes the reduction of waste. However, it does not account at all for the carbon cost of internet/data usage. As a tech company, we have no physical inventory but store a vast amount of information on servers that use <a href=\"http://thebulletin.org/dirty-parts-computing-world9312\">an immense amount of energy</a> and <a href=\"http://\">water to operate</a>. If we were asked to track this usage, it would work against our B Impact score- and rightly so. The <a href=\"https://bthechange.com/will-the-digital-future-be-green-6cd2bbd34f4a\">B Corp community</a> is <a href=\"https://bthechange.com/sustainability-in-business-a-greener-internet-99aa96734024\">looking at this as a major factor</a> to be taken into consideration, but it is currently omitted from the actual assessment. The assessment could be used to get <a href=\"http://www.greenpeace.org/usa/global-warming/click-clean/\">companies to up their game and use the internet in greener, most sustainable ways</a>.</p>\n  </li>\n  <li>\n    <p>At dojo4, collectively, we have <a href=\"https://github.com/spikex\">made</a> <a href=\"https://github.com/ahoward\">thousands</a> of <a href=\"https://opensource.org/\">open-source</a> <a href=\"https://github.com/copiousfreetime\">contributions</a>. This is one of our most valuable contributions to the technical and business communities. There is currently no way to reflect this contribution, qualitatively nor quantitatively, in the assessment. This is a major oversight of the unique offerings and impacts that technical organizations make to business, education, innovation and society, in general.</p>\n  </li>\n  <li>\n    <p>dojo4 consists almost exclusively of contractors (and now, members, since we’ve become a co-operative). We offer both perks and substantive benefits to contractors. However, right now it does not matter how much awesome stuff we do for contractors (none of which is legally mandated)- the B Impact system has no way to count it. Most startups rely heavily on contractors, and measuring the good that we do by them would help motivate companies to treat contractors better than they otherwise might. The assessment would be improved by creating ways to measure benefits that companies offer to 1099 contractors.</p>\n  </li>\n  <li>\n    <p>To reflect the current workforce, the assessment should account for the efforts made in home / virtual offices. People make huge investments in make their home offices to make them environmentally friendly. The B Impact assessment would be greatly enhanced if it took into account the efforts made to reduce and track the use of water, energy, as well as the procurement practices in alternate workplaces.  But, right now if you have a home or virtual office, the assessment does not count a single positive thing that you do for the environment.  This favors those companies that pay rent or own an office building and does not reward those who reduce unnecessary and wasteful commutes by working where they live.</p>\n  </li>\n  <li>\n    <p>The assessment offers points for creating local benefit. This is surely a worthy criterion but does not provide an alternate opportunity for organizations that serve their end-users digitally, and thus often without regard to geo-location. Currently, the benefit is only measured for the end user, not the client, so our choice to work with local companies is not reflect since only the location of the client’s customers is measured. This does not adequately account for the supply chain choices that can be made by software developers to support their local economies. For instance, we cannot usefully define the location of the individuals that use the software we build, but we can choose to work with clients that operate in a specific location, such as our local community. If the client is local, the benefit should be local, even if that client serves an international group of users.</p>\n  </li>\n</ul>\n\n<p>As <a href=\"https://en.wikipedia.org/wiki/B_Lab\">B Lab</a> and <a href=\"https://www.voanews.com/a/b-corporation-real-value-social-values/3798503.html\">the B Corp community </a>continues to evolve, the assessment will continue to evolve and adapt to the standards that are necessary to do the most impactful work that businesses can be doing in the world. We’re proud to be part of that movement and excited to adapt and improve as part of it!</p>\n\n<p><em>We would not have made it through the original assessment, the recent recertification nor much of the content in this blog post without hard work and intellectual acumen of <a href=\"http://dojo4.com/team/emily-utz\">Emily KenCairn</a>.</em> <em>And you could now have the same good fortune to work with her in this capacity - amongst other things, she now works with companies of all sizes to help them get B Corp certified through her own consultancy, <a href=\"http://www.apiaryimpactadvisors.com/\">Apiary Impact Advisors</a>.</em> <em>Hire Apiary today and you’ll be a B Corp before you know it!</em></p>\n\n\n</div>\n",
      "assets": {
        "b.png": {
          "url": "/ro/dojo4/assessing-the-b-corp-assessment/assets/b.png",
          "path": "dojo4/assessing-the-b-corp-assessment/assets/b.png",
          "size": 8,
          "img": {
            "format": "png",
            "width": 1242,
            "height": 1156
          },
          "src": null
        },
        "b.png.57bdb9b0308ab66175ec9f82a25206f6.cloudinary.yml": {
          "url": "/ro/dojo4/assessing-the-b-corp-assessment/assets/b.png.57bdb9b0308ab66175ec9f82a25206f6.cloudinary.yml",
          "path": "dojo4/assessing-the-b-corp-assessment/assets/b.png.57bdb9b0308ab66175ec9f82a25206f6.cloudinary.yml",
          "size": 8,
          "img": null,
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/assessing-the-b-corp-assessment",
        "type": "dojo4",
        "id": "assessing-the-b-corp-assessment",
        "urls": [
          "/ro/dojo4/assessing-the-b-corp-assessment/assets/b.png",
          "/ro/dojo4/assessing-the-b-corp-assessment/assets/b.png.57bdb9b0308ab66175ec9f82a25206f6.cloudinary.yml",
          "/ro/dojo4/assessing-the-b-corp-assessment/body.md"
        ],
        "created_at": "2025-05-06 08:47:13 +0000",
        "updated_at": "2025-05-06 08:47:13 +0000",
        "rel": {
          "curr": "dojo4/assessing-the-b-corp-assessment",
          "prev": "dojo4/on-the-lip-of-shared-ownership-dojo4-becomes-a-co-op-series-number-4",
          "next": "dojo4/friday-question"
        }
      }
    },
    "dojo4/friday-question": {
      "author": "corey@dojo4.com",
      "title": "Friday Question",
      "published_at": "2017-06-09 22:31:12 UTC",
      "body": "<div class=\"ro markdown\">\n  <p>Here are some questions we’ve asked each other at dojo4. <a href=\"http://dojo4.com/blog/a-bow-and-a-clap\">We’ve asked each other one such question every Friday for the past 6+ years</a>- so, obviously, there have been many more than the following queries, but here are a selection of 52, just in case you are inspired to do something similar for a year and need some prompts:</p>\n\n<ol>\n  <li>If you were not bound by the constraints of time and space, and could explore anything in the universe, what would you explore?</li>\n  <li>What’s the most surprising thing that nobody knows about you?</li>\n  <li>What is one of your favorite family traditions?</li>\n  <li>If you could only bring one thing with you on a trip, what would it be?</li>\n  <li>What is a skill with your hands that you would like to develop?</li>\n  <li>How do you deal with distraction?</li>\n  <li>What’s the best concert you’ve been to?</li>\n  <li>Who was the first person you kissed?</li>\n  <li>What’s the last thing you did to help a random stranger?</li>\n  <li>What are you grateful for today that you haven’t yet gotten a chance to say thank you for?</li>\n  <li>What’s one of your favorite places in the world?</li>\n  <li>If your life was a hot air balloon and you could to throw something overboard to make it float more successfully, what would you jettison?</li>\n  <li>What was the first album you owned?</li>\n  <li>What is one of your favorite pieces of art and why?</li>\n  <li>What’s a habit you have that you’d like to give up or change?</li>\n  <li>What’s the most dangerous thing you do?</li>\n  <li>What helps get you in the flow?</li>\n  <li>What’s your earliest memory?</li>\n  <li>What is your favorite thing about this season?</li>\n  <li>What is something you aspire to do before the end of this year?</li>\n  <li>How do you deal with disappointment?</li>\n  <li>What is an unusual skill or talent that you have?</li>\n  <li>What is something you like to cook and make well?</li>\n  <li>What’s something you’d like to know how to cook?</li>\n  <li>If you weren’t here right now, where would you be instead?</li>\n  <li>What is your most valuable travel advice?</li>\n  <li>What’s one your favorite places in the world?</li>\n  <li>What is one of the most rewarding or challenging things for you about being in community?</li>\n  <li>How do you experience magic in your life?</li>\n  <li>Ignoring all practical restraints, if you could spend a year doing any charitable activity, what would it be?</li>\n  <li>What is the most surprising / unexpected element of your life?</li>\n  <li>Do you have a good bullshit detector, and if so, how does it work?</li>\n  <li>What is a phrase you’d like to hear more? And what is a phrase you’d like to say more?</li>\n  <li>Which of the sense perceptions are you most attached to and why?</li>\n  <li>What’s something you said too late?</li>\n  <li>What did a typical Friday or Saturday night look like for you when you were about 16 years old?</li>\n  <li>Where do you fall in the sibling lineup (oldest, youngest, middle, single, etc.) and how do you think this has affected you as a person?</li>\n  <li>If you were going to give a TED talk what would it be about?</li>\n  <li>If you could live one year of your life again, what year (age) would that be?</li>\n  <li>What skill, that you don’t currently have, would you want to develop for life after the apocalypse?</li>\n  <li>With the skills that you currently have, what will your career be after the apocalypse?</li>\n  <li>What executive action would you take if you were President of the country?</li>\n  <li>When you are stressed, anxious, depressed, etc., do you divert yourself or does that make it worse? If you divert yourself, what do you do that works?</li>\n  <li>What’s the longest time you’ve ever gone without speaking? What was the context?</li>\n  <li>Do you plan for worst case scenarios? If so, how?</li>\n  <li>What is your favorite surface to walk on barefoot?</li>\n  <li>How do you justify your worst habits?</li>\n  <li>What triggered the last time you had a belly laugh?</li>\n  <li>What’s the closest you’ve ever come to death?</li>\n  <li>What is something you know now that you wish you would have known when you were a teenager?</li>\n  <li>Of all your worldly possessions, what would be the hardest to give up?</li>\n  <li>Who are you named after?</li>\n</ol>\n\n<p>Here’s the context… It’s Friday at noon. We stand in a circle. We <a href=\"https://media.giphy.com/media/MUeQeEQaDCjE4/giphy.gif\">bow</a>. We <a href=\"http://clap.resn.co.nz/\">clap</a>. We do a minute of <a href=\"http://sitillustrated.com/images/snore-top-meditator-meditation-cartoon.gif\">silent meditation</a>. One person asks a question that helps us know and understand each other better. We’ve had easy questions and hard questions, poignant questions and silly questions. We use the guidelines of <a href=\"http://www.centerforcouncil.org/what-is-council.html\">council</a> as the framework to answer the question:</p>\n\n<ul>\n  <li>speak from the heart</li>\n  <li>listen completely</li>\n  <li>be spontaneous</li>\n  <li>be lean</li>\n  <li>everything is confidential</li>\n</ul>\n\n<p>And we signal the end with a clap and a bow and then we all have lunch together.</p>\n\n<p>We do it every week, whether there are 2 of us or 12 of us. We do it with guests. We do it whether we’re busy or not. It’s part of how we’ve overcome the inevitable seasickness that comes with the swells and dips of being a small business. No doubt, it’s made us a better business.</p>\n\n\n</div>\n",
      "assets": {},
      "_meta": {
        "identifier": "dojo4/friday-question",
        "type": "dojo4",
        "id": "friday-question",
        "urls": [
          "/ro/dojo4/friday-question/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/friday-question",
          "prev": "dojo4/assessing-the-b-corp-assessment",
          "next": "dojo4/family-friendly-workplace-manifesto-now-more-than-ever"
        }
      }
    },
    "dojo4/family-friendly-workplace-manifesto-now-more-than-ever": {
      "author": "corey@dojo4.com",
      "title": "Family-Friendly Workplace Manifesto, now more than ever",
      "published_at": "2017-06-30 19:02:52 UTC",
      "body": "<div class=\"ro markdown\">\n  <p><img src='/ro/dojo4/family-friendly-workplace-manifesto-now-more-than-ever/assets/b.jpeg' alt=\"dojo4_family.jpg\" /></p>\n\n<p>The demands of the workplace seem to only be <a href=\"http://equitablegrowth.org/report/overworked-america/\">increasing</a>. And the seemingly infinite capacity for work to expand into all areas of our lives <a href=\"https://www.nytimes.com/2015/05/31/upshot/the-24-7-work-cultures-toll-on-families-and-gender-equality.html\">drives a further wedge into the endemic gender gap</a>. This coupled with <a href=\"https://www.worldpolicycenter.org/policies/is-paid-leave-available-to-mothers-and-fathers-of-infants/is-paid-leave-available-for-mothers-of-infants\">a lack of family leave </a>is not only causing a societal deficiency, but is also <a href=\"https://www.dol.gov/featured/paidleave/cost-of-doing-nothing-report.pdf\">taking its toll on the bottom line of our businesses</a>. <a href=\"https://unreasonable.is/why-family-friendly-is-business-friendly/\">As I’ve said before</a>, this is a missed opportunity. Parents and families make strong, profitable businesses. Instead of asking parents and families to sacrifice themselves to support <a href=\"https://www.newamerica.org/weekly/edition-144/beyond-inbox-zero/\">a grinding work culture</a>, we can adapt our businesses. It will <a href=\"http://www.nationalpartnership.org/issues/work-family/paid-leave-resources.html#existing\">improve our morale</a>, <a href=\"https://www.wsj.com/articles/feds-yellen-says-family-friendly-work-policies-can-boost-economy-1494005456\">boost our economy</a> and <a href=\"http://www.huffingtonpost.com/joe-keefe/familyfriendly-workplaces_b_13127872.html\">fortify our businesses</a>.</p>\n\n<p>With this being <a href=\"https://medium.com/mit-initiative-on-the-digital-economy/working-for-a-better-future-92cf96b1f0a9\">more relevant that ever</a>, I thought it would be a good time to <a href=\"http://dojo4.com/blog/family-friendly-workplace-manifesto\">repost</a> the <strong>Family-Friendly Workplace Manifesto</strong>. <a href=\"https://github.com/dojo4/policy/blob/master/family-friendly_workplace_manifesto\">Use</a> this manifesto <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\">in part or whole</a>, or craft your own:</p>\n\n<blockquote>\n  <p>Whereas being parents or caretakers, having a family, is something that we should be able to celebrate and have pride in at work, we declare this <strong>Family-Friendly Workplace Manifesto</strong>. Having a family provides joy and challenge. It should not be something that anyone feels the need to hide, justify, explain away or be embarrassed about.</p>\n</blockquote>\n\n<blockquote>\n  <p>Parents and other caretakers have the right conditions to be some of our most valuable co-workers and employees, because:</p>\n</blockquote>\n\n<blockquote>\n  <ul>\n    <li>they have no choice but to be used to and conditioned for hard work and a relentless schedule</li>\n    <li>they have a lot at stake and are likely to be working not necessarily for themselves but for the greater welfare of their families</li>\n    <li>their home lives emphasize the need for clear decision-making, collaboration and the inescapable need to be able to play well with others</li>\n  </ul>\n</blockquote>\n\n<blockquote>\n  <p>Because of this, family-friendly workplaces have the potential to be more profitable, effective and efficient workplaces. A workplace that values families, is a happier, more realistic and more sustainable workplace. It is more likely to retain good employees. It is more likely to generate good will, a resource that can be drawn on when it is needed most.</p>\n</blockquote>\n\n<blockquote>\n  <p>To engender a family-friendly work place, we declare the following…</p>\n</blockquote>\n\n<blockquote>\n  <ul>\n    <li>We recognize that life happens. Recurrent sickness, snow days, school holidays, child-care fails, school and doctors appointments, and emergencies of all kinds are part of the fabric of life and cannot be disappeared. The work will get done at another time soon.</li>\n    <li>Having children in the workplace, from time to time, makes it a richer place. Small beings may be distracting, but it is good for our co-workers to know our families and our families to know our coworkers. It provides potential role models for our children. It provides potential humor and playfulness for our co-workers. And sometimes it is just best, in the big picture, to have our children with us rather than the drain on logistical resources that it would take to figure out where else they can be.</li>\n    <li>We acknowledge that there is undue burden on single parents, financially disadvantaged parents, parents or caretakers of those with special needs, breast-feeding mothers and parents of sleep-depriving infants. Acknowledging this does not imply a lower standard of expectation but allows for the understanding of a different set of demands.</li>\n    <li>A healthy family demands a particular kind of schedule. Work and meetings scheduled at the last minute or during the time needed to get children off to daycare/school or during dinner or bedtime are not necessarily going to be doable or productive for parents. A workplace that supports flexible schedules and the ability to work remotely will optimize and capitalize on the good work that parents/caretakers have to offer. We now live in a world that offers many tools for productive, asynchronous team work - we will take advantage of them to support a healthier, more inclusive and more generative workplace.</li>\n    <li>Providing paid parental leave is integral to the structure of a family-friendly workplace.</li>\n  </ul>\n</blockquote>\n\n\n</div>\n",
      "assets": {
        "b.jpeg": {
          "url": "/ro/dojo4/family-friendly-workplace-manifesto-now-more-than-ever/assets/b.jpeg",
          "path": "dojo4/family-friendly-workplace-manifesto-now-more-than-ever/assets/b.jpeg",
          "size": 8,
          "img": {
            "format": "jpeg",
            "width": 480,
            "height": 640
          },
          "src": null
        },
        "b.jpeg.6e76776911b6869a35a58ce33cd263fc.cloudinary.yml": {
          "url": "/ro/dojo4/family-friendly-workplace-manifesto-now-more-than-ever/assets/b.jpeg.6e76776911b6869a35a58ce33cd263fc.cloudinary.yml",
          "path": "dojo4/family-friendly-workplace-manifesto-now-more-than-ever/assets/b.jpeg.6e76776911b6869a35a58ce33cd263fc.cloudinary.yml",
          "size": 8,
          "img": null,
          "src": null
        }
      },
      "_meta": {
        "identifier": "dojo4/family-friendly-workplace-manifesto-now-more-than-ever",
        "type": "dojo4",
        "id": "family-friendly-workplace-manifesto-now-more-than-ever",
        "urls": [
          "/ro/dojo4/family-friendly-workplace-manifesto-now-more-than-ever/assets/b.jpeg",
          "/ro/dojo4/family-friendly-workplace-manifesto-now-more-than-ever/assets/b.jpeg.6e76776911b6869a35a58ce33cd263fc.cloudinary.yml",
          "/ro/dojo4/family-friendly-workplace-manifesto-now-more-than-ever/body.md"
        ],
        "created_at": "2025-05-06 08:47:14 +0000",
        "updated_at": "2025-05-06 08:47:14 +0000",
        "rel": {
          "curr": "dojo4/family-friendly-workplace-manifesto-now-more-than-ever",
          "prev": "dojo4/friday-question",
          "next": "dojo4/were-all-naked-8-ways-to-help-the-right-clients-find-you"
        }
      }
    }
  },
  "_meta": {
    "url": "/ro",
    "types": [
      "dojo4"
    ],
    "page": {
      "count": 9,
      "size": 42,
      "first": 0,
      "last": 8,
      "index": 7,
      "curr": 7,
      "prev": 6,
      "next": 8
    }
  }
}